import React from 'react';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import { injectIntl } from 'react-intl';
import { withRouter } from 'react-router-dom';
import { connect } from 'react-redux';

import Grid from '@material-ui/core/Grid';
import IconHeader from "../icon_header";
import '../../css/help.css'

import {
    show_letou_announcements
} from '../../../actions';


const styles = theme => ({
   
    content : {
        display: 'flex',
        paddingRight: 400,
    },
    infoSelect : {
        paddingLeft: 300,
        display: 'flex',
        flexDirection: 'column',
    },
    aboutUsDetail : {
       fontSize: '14px',
    },
    helpCenterArticleColumn: {
        fontSize: '14px',
        listStyleType: 'none',
    }
})

export class BetRuleFourTh extends React.Component {
    constructor(props) {
        super(props);
        
        this.state = {
          hide: true,
          current: 1
        }
    }
    getLabel(labelId) {
        const { formatMessage } = this.props.intl;
        return formatMessage({ id: labelId });
    }

    onClick(index) {
        this.setState({
          hide: false,
          current: index
          
        })
      }
    
    render() {
  
      const { classes } = this.props;
      
      
      return (
       
        <div className={classes.root}> 
            <IconHeader/>
            <Grid container className={classes.content}>
                <Grid item xs={5} className={classes.infoSelect}>
                    <div className="HelpCenterLeftNav">
                            <ul>
                                <li>
                                    <a href="/th/for_member">{this.getLabel('for-member')}</a>
                                </li>
                                <li>
                                    <a href="/th/for_partner">{this.getLabel('for-partner')}</a>
                                </li>
                            </ul>
                        </div>
                </Grid>
            
                <Grid item xs={7} className={classes.detail}>
                    <div className="HelpCenterList">
                        <ul>
                            <li>
                                <a href="/th/for_member">บริการแก่สมาชิกใช้ >
                                    <i></i>
                                </a>
                            </li>
                            <li>
                                <a href="/th/for_member">กติกาเกมส์กีฬา >
                                    <i></i>
                                </a>
                            </li>
                        </ul>
                    </div>
                    <div className="HelpCenterSmNav">
                        <ul>
                            <li className={this.state.current === 1 ? "Active" : ""} onClick={this.onClick.bind(this,1)}>
                                <a>Tennis</a>
                            </li>
                            <li className={this.state.current === 2 ? "Active" : ""} onClick={this.onClick.bind(this,2)}>
                                <a>Basketball</a>
                            </li>
                            <li className={this.state.current === 3 ? "Active" : ""} onClick={this.onClick.bind(this,3)}>
                                <a>American football</a>
                            </li>
                            <li className={this.state.current === 4 ? "Active" : ""} onClick={this.onClick.bind(this,4)}>
                                <a>ฮอคกี้น้ำแข็ง</a>
                            </li>
                            <li className={this.state.current === 5 ? "Active" : ""} onClick={this.onClick.bind(this,5)}>
                                <a>กีฬาเบสบอล</a>
                            </li>
                            <li className={this.state.current === 6 ? "Active" : ""} onClick={this.onClick.bind(this,6)}>
                                <a>Handball</a>
                            </li>
                            <li className={this.state.current === 7 ? "Active" : ""} onClick={this.onClick.bind(this,7)}>
                                <a>Volleyball</a>
                            </li>
                            <li className={this.state.current === 8 ? "Active" : ""} onClick={this.onClick.bind(this,8)}>
                                <a>วอลเลย์บอลชายหาด</a>
                            </li>
                            <li className={this.state.current === 9 ? "Active" : ""} onClick={this.onClick.bind(this,9)}>
                                <a>ฟุตซอล</a>
                            </li>
                            <li className={this.state.current === 10 ? "Active" : ""} onClick={this.onClick.bind(this,10)}>
                                <a>แบดมินตัน</a>
                            </li>
                            <li className={this.state.current === 11 ? "Active" : ""} onClick={this.onClick.bind(this,11)}>
                                <a>รักบี้ยูเนี่ยน & ลีก</a>
                            </li>
                            <li className={this.state.current === 12 ? "Active" : ""} onClick={this.onClick.bind(this,12)}>
                                <a>ลูกดอก</a>
                            </li>
                            <li className={this.state.current === 13 ? "Active" : ""} onClick={this.onClick.bind(this,13)}>
                                <a>สนุ๊กเกอร์</a>
                            </li>
                            <li className={this.state.current === 14 ? "Active" : ""} onClick={this.onClick.bind(this,14)}>
                                <a>ปิงปอง</a>
                            </li>
                            <li className={this.state.current === 15 ? "Active" : ""} onClick={this.onClick.bind(this,15)}>
                                <a>กอล์ฟ</a>
                            </li>
                            <li className={this.state.current === 16 ? "Active" : ""} onClick={this.onClick.bind(this,16)}>
                                <a>Cricket</a>
                            </li>
                            <li className={this.state.current === 17 ? "Active" : ""} onClick={this.onClick.bind(this,17)}>
                                <a>ฟุตบอลลีกเสมือนจริง (VFL)</a>
                            </li>
                            <li className={this.state.current === 18 ? "Active" : ""} onClick={this.onClick.bind(this,18)}>
                                <a>E-Sports</a>
                            </li>
                            <li className={this.state.current === 19 ? "Active" : ""} onClick={this.onClick.bind(this,19)}>
                                <a>DOTA2</a>
                            </li>
                            <li className={this.state.current === 20 ? "Active" : ""} onClick={this.onClick.bind(this,20)}>
                                <a>Counter Strike: GO</a>
                            </li>
                        </ul>
                        <div className="ClearBoth"></div>
                    </div>
                    <div id="HelperCenterDetail" >
                        <div className="centerDetail" hidden={this.state.current !== 1}>
                        <p>เทนนิส</p>
                            <p>สำคัญ</p>
                            <p>※กรณีเกษียณอายุและเดินผ่านผู้เล่นคนใด ๆ ที่ยังไม่ได้ลงเดิมพันถือเป็นโมฆะ
                                <br /> ※ในกรณีที่มีความล่าช้า (ฝนตกมืด) ตลาดทั้งหมดยังคงมีปัญหาและการซื้อขายจะดำเนินต่อไปทันทีที่การแข่งขันยังคงดำเนินต่อไป
                                <br /> ※ในกรณีที่ผู้ตัดสินได้รับโทษจากการลงโทษ (s) การเดิมพันทั้งหมดในเกมนั้นจะยืนขึ้น
                                <br /> ※ในกรณีที่การแข่งขันเสร็จสิ้นก่อนเกม / จุดสิ้นสุดของเกมทั้งหมดจะถือว่าเป็นโมฆะ</p>
                            <p>
                                <br /> กฎการชำระบัญชีและการยกเลิก
                            </p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                                <br /> ※หากผู้เล่น / ทีมแสดงผลไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                                <br /> ※หากผู้เล่นเกษียณตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ
                                <br /> ※ถ้าการแข่งขันถูกตัดสินโดย Match tie-break แล้วจะถือเป็นชุดที่ 3
                                <br /> ※ทุกๆ tie-break หรือ match tie-break นับเป็น 1 เกม
                                <br /> ※คู่ผสมซุปเปอร์ผูกแบ่งเป็นนับเป็น 1 เกม</p>
                            <p>
                                <br /> ตลาดพิเศษ
                            </p>
                            <p>แปลก ๆ / แม้แต่จำนวนเกมส์
                                <br /> จำนวนเกมที่แปลกและแม้กระทั่งของเกมจะถูกกำหนดโดยทีมสุดท้ายที่มีการแข่งขันรวมทั้งเกมทั้งหมดเพื่อพิจารณาการเดิมพัน
                            </p>
                            <p>แฮนดิแค็ปเกม (รวมทั้งเดิมพันชุดที่ 1)
                                <br /> การตัดสินเดิมพันจะขึ้นอยู่กับ: ผู้เล่นรายใดจะชนะหลังจากที่เกมสปอตถูกนำไปใช้กับคะแนนสุดท้าย</p>
                            <p>ตั้งค่าแฮนดิแคป
                                <br /> การตัดสินเดิมพันจะขึ้นอยู่กับ: ผู้เล่นใดจะชนะหลังจาก Set Spread ถูกนำไปใช้กับคะแนนสุดท้าย</p>
                            <p>จำนวนชุดทั้งหมด (ดีที่สุดจาก 3)
                                <br /> เกมทำนายสำหรับจำนวนรวมกี่ชุด สามารถเลือกเดิมพันได้: 2 และ 3 ชุด</p>
                            <p>จำนวนชุดทั้งหมด (ดีที่สุดจาก 5)
                                <br /> เกมทำนายสำหรับจำนวนรวมกี่ชุด สามารถเลือกเดิมพันได้: 3, 4 และ 5 ชุด</p>
                            <p>ยอดรวม (รวมการเดิมพันชุดที่ 1)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของเกมในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้</p>
                            <p>คะแนนชุดที่ถูกต้อง (ดีที่สุดจาก 3 ชุด)
                                <br /> ทายผลสุดท้ายของเกมสามารถเลือกเดิมพันได้:
                                <br /> 2: 1 - ทีมชุดใหญ่ 2 ชุดเยือนทีม 1 ชุด
                                <br /> 2: 0 - ทีมชาติชุดที่ 2, ทีมเยือน 0 ชุด
                                <br /> 0: 2 - ทีมเจ้าบ้าน 0 ชุด, เยือนทีม 2 ชุด
                                <br /> 1: 2 - ทีมเจ้าบ้าน 1 ชุดทีมเยือน 2 ชุด</p>
                            <p>คะแนนชุดที่ถูกต้อง (ดีที่สุดจาก 5 ชุด)
                                <br /> ทายผลสุดท้ายของเกมสามารถเลือกเดิมพันได้:
                                <br /> 3: 2 - ทีมชุดใหญ่ 3 ชุดเยือนทีม 2 ชุด
                                <br /> 3: 1 - ทีมชุดใหญ่ 3 ชุดเยือนทีม 1 ชุด
                                <br /> 3: 0 - ทีมเจ้าบ้าน 3 ชุดเยือนทีม 0 ชุด
                                <br /> 0: 3 - ทีมเจ้าบ้าน 0 เซตทีมเยือน 3 ชุด
                                <br /> 1: 3 - ทีมชุดใหญ่ 1 ชุดทีมเยือน 3 ชุด
                                <br /> 2: 3 - ทีมชุดใหญ่ 2 ชุดเยือนทีม 3 ชุด</p>
                            <p>In-Play - จำนวนเกมทั้งหมด (รวมชุดเดิมพัน 1-5 ชุด)
                                <br /> คาดการณ์เกมสุดท้ายของทีม หากเกมมากกว่าเส้นแสดงโอเวอร์ / ภายใต้เส้นที่กำหนดไว้ล่วงหน้าผลลัพธ์ที่ได้จะสิ้นสุดลง
                                ถ้าเกมนี้มีค่าน้อยกว่าเส้นแสดงการเปิด / ต่ำที่กำหนดไว้ล่วงหน้าผลชนะจะเป็น ต่ำ</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 2}>
                        <p>บาสเกตบอล</p>
                            <p>สำคัญ</p>
                            <p>※ตลาดไม่พิจารณาการทำงานล่วงเวลายกเว้นที่ระบุไว้เป็นอย่างอื่น</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงหลังจากวันที่เริ่มต้นการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากอัตราต่อรองถูกเสนอโดยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 2 นาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>ตลาดพิเศษ</p>
                            <p>อีเกิ้ล / Fulltime
                                <br /> ครึ่งเวลา / เต็มเวลาหมายถึงการเดิมพันเพื่อคาดการณ์ผลการแข่งขันครึ่งเวลาและผลการแข่งขันเต็มเวลาของการแข่งขัน
                                สามารถเลือกเดิมพันได้:
                                <br /> ทีมเจ้าบ้าน / ทีมเจ้าบ้าน: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเจ้าบ้าน / เสมอ: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเจ้าบ้าน / ทีมเยือน: ทีมที่บ้านชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> วาด / ทีมเจ้าบ้าน: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> วาด / วาด: ทั้งสองทีมผูกในช่วงพักครึ่งและจบเกมทั้งสองทีมผูก
                                <br /> ทีมวาดภาพ / นอกทีม: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเยือนชนะ
                                <br /> ทีมเยือน / ทีมเจ้าบ้าน: ทีมเยือนชนะครึ่งหลังและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะครึ่งหลังและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> คะแนนคี่ / คู่ (รวมครึ่งแรก / ครึ่งหลังและช่วงไตรมาสที่ 1-4)
                                <br /> คะแนนแปลกและเด่นถูกกำหนดโดยการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน
                                <br /> คะแนนสะสม (รวม 1/2 ครึ่งและเดิมพันไตรมาสที่ 1-4)
                                <br /> คะแนนสปอลหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแต้มต่อที่กำหนดให้กับผลการแข่งขัน
                                <br /> รวมยอดรวม (รวมครึ่งแรก / ครึ่งหลังและไตรมาสที่ 1/4)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> ผลรวมทีมเยือน / นอกบ้าน
                                <br /> ทำนายคะแนนสุดท้ายของทีม หากทีมที่บ้าน / ทีมเยือนทำแต้มได้มากกว่าโอเวอร์ / อันเดอร์ไลน์ที่กำหนดไว้ล่วงหน้า ถ้าคะแนนของทีมบ้านเกิด
                                / นอกทีมมีค่าน้อยกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> Matchbet และ Totals
                                <br /> Matchbet และ Total หมายถึงการเดิมพันทั้งสองทำนายว่าการจับคู่จะส่งผลให้ชนะในบ้านหรือชนะไป; และจำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของเหตุการณ์จะเกินหรือต่ำกว่า
                                <br /> มีตัวเลือกการเดิมพันดังต่อไปนี้:
                                <br /> บ้านและหลัง - เดิมพันชนะหากทีมเจ้าบ้านชนะและประตูรวมอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและที่อยู่ต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> เดิมพันเยือนและชนะ - เดิมพันจะชนะถ้าทีมเยือนชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> การเดิมพันและระหว่างการเดิมพันจะชนะถ้าทีมเยือนชนะและประตูรวมอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> กำไรที่ได้รับ
                                <br /> ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 10 คะแนน (ไม่รวม 10)
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 6-10 คะแนน
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 1-5 คะแนน
                                <br /> เดิมพันชนะไปและชนะคะแนนมากกว่า 10 คะแนน (ไม่รวม 10)
                                <br /> เดิมพันทีมเยือนชนะและชนะคะแนน 6-10 คะแนน
                                <br /> เดิมพันชนะไปและชนะคะแนน 1-5 จุด
                                <br /> ไตรมาสที่ให้คะแนนสูงสุด
                                <br /> ทำนายคะแนนสูงสุดในไตรมาสที่ 1 ไตรมาสที่ 2 ไตรมาสที่ 3 หรือไตรมาสที่ 4
                                <br /> ไม่มีการเดิมพัน (รวม 1/2 ครึ่งและเดิมพันไตรมาสที่ 1-4)
                                <br /> หากผลการแข่งขันรอบสุดท้ายหลังจากเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการเดิมพันการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                                <br /> อัตรากำไรสุทธิรวม NBA
                                <br /> ช่วงคะแนนรวมเกมทำนาย ช่วงนี้เหมาะสำหรับการแข่งขันเอ็นบีเอ
                                <br /> อัตรากำไรขั้นต้น - ช่วงปกติ
                                <br /> ช่วงคะแนนรวมเกมทำนาย ช่วงนี้เหมาะสำหรับการแข่งขันที่ไม่ใช่เอ็นบีเอ
                                <br /> Total 3way
                                <br /> คะแนนสุดท้ายของการทำนายมีคะแนนรวมมากกว่าหรือน้อยกว่าคะแนนรวมที่ได้รับ
                                <br /> European Handicap
                                <br /> มีสามทางเลือกสำหรับทีมที่บ้านวาดและทีมเยือน เฉพาะเวลาปกติการทำงานล่วงเวลาจะไม่นับ
                                <br /> แฮนดิแค็ปไลน์ 1 แต้ม - ทีมเริ่มต้นได้ 1 แต้ม
                                <br /> เดิมพันทีมชนะ:
                                <br /> ชนะโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> การวางเดิมพัน:
                                <br /> -Win โดยตรง 1 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> เดิมพันชนะทีม:
                            </p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 3}>
                        <p>อเมริกันฟุตบอล</p>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่มีความล่าช้า (ฝนตกมืด) ตลาดทั้งหมดยังคงมีปัญหาและการซื้อขายจะดำเนินต่อไปทันทีที่การแข่งขันยังคงดำเนินต่อไป</p>
                            <p>※ตลาดไม่พิจารณาการทำงานล่วงเวลายกเว้นที่ระบุไว้เป็นอย่างอื่น</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากมีการเสนอราคาด้วยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 89 วินาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากมีการแสดงคะแนนผิดเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพันในช่วงเวลานี้</p>
                            <p>※หากทีมงานแสดงผลไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※ในกรณีที่มีการแข่งขันที่ถูกทอดทิ้งหรือเลื่อนออกไปตลาดทั้งหมดถือเป็นโมฆะเว้นแต่การแข่งขันจะดำเนินต่อไปในช่วงเวลาเดียวกันของสัปดาห์เอ็นเอฟแอล
                                (วันพฤหัสบดี - วันพุธ)</p>
                            <p>ตลาดพิเศษ</p>
                            <p>อีเกิ้ล / Fulltime
                                <br /> ครึ่งเวลา / เต็มเวลาหมายถึงการเดิมพันเพื่อคาดการณ์ผลการแข่งขันครึ่งเวลาและผลการแข่งขันเต็มเวลาของการแข่งขัน
                                สามารถเลือกเดิมพันได้:
                                <br /> ทีมเจ้าบ้าน / ทีมเจ้าบ้าน: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเจ้าบ้าน / เสมอ: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเจ้าบ้าน / ทีมเยือน: ทีมที่บ้านชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> วาด / ทีมเจ้าบ้าน: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> วาด / วาด: ทั้งสองทีมผูกในช่วงพักครึ่งและจบเกมทั้งสองทีมผูก
                                <br /> ทีมวาดภาพ / นอกทีม: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเยือนชนะ
                                <br /> ทีมเยือน / ทีมเจ้าบ้าน: ทีมเยือนชนะครึ่งหลังและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะครึ่งหลังและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> คี่ / คู่แต้ม (รวมการเดิมพันครึ่งแรก)
                                <br /> คะแนนแปลกและเด่นถูกกำหนดโดยการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน เฉพาะเวลาปกติเท่านั้นไม่รวมค่าล่วงเวลา
                                <br /> คี่ / คู่แต้ม (ล่วงเวลา)
                                <br /> คะแนนแปลกและเด่นถูกกำหนดโดยการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน เดิมพันนี้มีการทำงานล่วงเวลา
                                <br /> 1st Half - จุดกระจาย
                                <br /> คะแนนสปอลหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มคะแนนที่กำหนดให้กับผลการแข่งขัน
                                <br /> 1st Half Points Spreads หมายถึงการเดิมพันผลการแข่งขันในครึ่งแรกจากครึ่งแรกของการแข่งขันที่จะตัดสิน
                                <br /> คะแนนสะสม (รวมเดิมพันครึ่งหลัง / เกินเวลา)
                                <br /> คะแนนสปอลหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มคะแนนที่กำหนดให้กับผลการแข่งขัน เดิมพันนี้มีการทำงานล่วงเวลา
                                <br /> ครึ่งแรก - ยอดรวม
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> ครึ่งแรก - ยอดรวมการเดิมพันหมายถึงการเดิมพันผลการแข่งขันในครึ่งแรกจากครึ่งแรกของการแข่งขันที่จะตัดสิน
                                <br /> รวมยอดรวม (รวมเดิมพันครึ่งหลัง / เกินเวลา)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เดิมพันนี้มีการทำงานล่วงเวลา
                                <br /> กำไรที่ได้รับ
                                <br /> ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 14 คะแนน (ไม่รวม 14)
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 8-14 คะแนน
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 1-7 คะแนน
                                <br /> ทั้งสองทีมผูก
                                <br /> เดิมพันชนะไปและชนะคะแนนมากกว่า 14 คะแนน (ไม่รวม 10)
                                <br /> เดิมพันชนะไปและชนะคะแนน 8-14 คะแนน
                                <br /> เดิมพันชนะไปและชนะคะแนน 1-7 จุด
                                <br /> ไตรมาสที่ให้คะแนนสูงสุด
                                <br /> ทำนายคะแนนสูงสุดในไตรมาสที่ 1 ไตรมาสที่ 2 ไตรมาสที่ 3 หรือไตรมาสที่ 4
                                <br /> ผลรวมทีมเยือน / นอกบ้าน
                                <br /> ทำนายคะแนนสุดท้ายของทีม หากทีมที่บ้าน / ทีมเยือนทำแต้มได้มากกว่าโอเวอร์ / อันเดอร์ไลน์ที่กำหนดไว้ล่วงหน้า ถ้าคะแนนของทีมบ้านเกิด
                                / นอกทีมมีค่าน้อยกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> In-Play - ส่วนต่างที่ได้รับจากการเล่นฟุตบอลอเมริกันรวมทั้งการทำงานล่วงเวลา
                                <br /> เมื่อจบเกมคะแนนของทีมในบ้านโดยหักคะแนนจากทีมเยือน เดิมพันนี้มีการทำงานล่วงเวลา สามารถเลือกเดิมพันได้</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 4}>
                        <p>ฮอคกี้น้ำแข็ง</p>
                            <p>สำคัญ</p>
                            <p>※ทุกตลาด (ยกเว้นช่วงเวลาล่วงเวลาและตลาดยิงปืน) ถือเป็นเวลาปกติยกเว้นกรณีที่มีการกล่าวถึงในตลาด</p>
                            <p>※ถ้าการแข่งขันถูกขัดจังหวะและดำเนินการต่อภายใน 48 ชั่วโมงหลังจากเริ่มเล่นครั้งแรกแล้วการเดิมพันที่เปิดทั้งหมดจะตัดสินด้วยผลการแข่งขัน
                                มิเช่นนั้นการเดิมพันที่ยังไม่ได้กำหนดทั้งหมดถือเป็นโมฆะ
                            </p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากตลาดยังคงเปิดอยู่เมื่อเกิดเหตุการณ์ต่อไปนี้: เป้าหมายและบทลงโทษเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากอัตราต่อรองถูกเสนอโดยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 2 นาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากมีการป้อนคะแนนผิดพลาดตลาดทั้งหมดจะถูกยกเลิกเมื่อถึงเวลาแสดงคะแนนผิดพลาด</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงหลังจากวันที่เริ่มต้นการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>ตลาดพิเศษ</p>
                            <p>คะแนนที่ถูกต้อง
                                <br /> คะแนนที่ถูกต้องหมายถึงการเดิมพันเพื่อทำนายคะแนนสุดท้ายเมื่อสิ้นสุดการแข่งขันเต็มเวลา ตัวเลือก "อื่น ๆ " บ่งชี้ว่าถ้าผลของตัวเลือกที่ไม่ใช่ด้านในออกตัวเลือก
                                "อื่น ๆ " จะชนะ เฉพาะเวลาปกติการทำงานล่วงเวลาและการยิงลูกโทษเท่านั้นไม่นับรวม
                                <br /> คี่ / คู่ (รวมถึงเดิมพันช่วงเวลาที่ 1 และ 2nd / 3rd)
                                <br /> เป้าหมายที่แปลกและไม่เท่ากันหมายถึงการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน เฉพาะเวลาปกติการยิงพิเศษและการยิงลูกโทษเท่านั้นที่ไม่นับ
                                แปลกและแม้กระทั่งหมายถึงการเดิมพันผลของช่วง 1 / 2nd / 3rd จากรอบระยะเวลาการแข่งขันเพื่อตัดสิน
                                <br /> คี่ / แม้แต่เป้าหมาย (อิงค์ OT และจุดโทษ)
                                <br /> เป้าหมายที่แปลกและไม่เท่ากันหมายถึงการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน รวมทั้งการทำงานล่วงเวลาและการลงโทษลูกโทษ
                                <br /> โอกาสคู่ (รวมถึงเดิมพันช่วงเวลาที่ 1 และ 2nd / 3rd)
                                <br /> ทายผลสุดท้ายด้วยโอกาสคู่ สามารถเลือกเดิมพันได้:
                                <br /> 1 หรือ 2 - หากผลที่ได้คือบ้านหรือนอกบ้านการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                                <br /> 1 หรือ X - หากผลที่ได้คือบ้านหรือวาดแล้วการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                                <br /> X หรือ 2 - หากผลที่ได้คือการจับสลากหรือออกไปการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                                <br /> ไม่มีการเดิมพัน (รวมถึงเดิมพันช่วงเวลาที่ 1 และ 2nd / 3rd)
                                <br /> หากผลการแข่งขันรอบสุดท้ายหลังจากเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการเดิมพันการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                                <br /> หากช่วงเวลาของการแข่งขันเสมอการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                                <br /> ส่วนแบ่งเป้าหมาย (รวมการเดิมพันในช่วงที่ 1 และ 2/3)
                                <br /> การเพิ่มเป้าหมายหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวดังกล่าวก่อนที่กิจกรรมจะเริ่มต้นขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแต้มต่อที่กำหนดให้กับผลการแข่งขัน เฉพาะเวลาปกติการทำงานล่วงเวลาและการยิงลูกโทษเท่านั้นไม่นับรวม
                                <br /> ส่วนแบ่งเป้าหมาย (รวม OT)
                                <br /> การเพิ่มเป้าหมายหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวดังกล่าวก่อนที่กิจกรรมจะเริ่มต้นขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแต้มต่อที่กำหนดให้กับผลการแข่งขัน รวมทั้งการทำงานล่วงเวลาและการลงโทษลูกโทษ
                                <br /> ยอดรวม (รวมการเดิมพันในช่วงที่ 1 และ 2/3)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> เฉพาะเวลาปกติการทำงานล่วงเวลาและการยิงลูกโทษเท่านั้นไม่นับรวม
                                <br /> ยอดรวม (รวม OT)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ รวมทั้งการทำงานล่วงเวลาและการลงโทษลูกโทษ
                                <br /> Matchbet และ Totals
                                <br /> Matchbet และ Total หมายถึงการเดิมพันทั้งสองทำนายว่าการแข่งขันจะส่งผลให้ชนะในบ้านหรือชนะไปหรือเสมอหรือไม่ และจำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของเหตุการณ์จะเกินหรือต่ำกว่า
                                <br /> มีตัวเลือกการเดิมพันดังต่อไปนี้:
                                <br /> เดิมพันเยือนและชนะ - เดิมพันจะชนะถ้าทีมเยือนชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> Draw &amp; Over - เดิมพันจะชนะถ้าผลการแข่งขันที่เกิดขึ้นในการวาดและเป้าหมายทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและหลัง - เดิมพันชนะหากทีมเจ้าบ้านชนะและประตูรวมอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> การเดิมพันและระหว่างการเดิมพันจะชนะถ้าทีมเยือนชนะและประตูรวมอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> วาดและใต้ - เดิมพันจะชนะหากผลการแข่งขันที่ได้รับในการวาดและเป้าหมายทั้งหมดอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและที่อยู่ต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> กำไรที่ได้รับ
                                <br /> ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 10 คะแนน (ไม่รวม 10)
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 6-10 คะแนน
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 1-5 คะแนน</p>
                            <p>2way (รวม OT)
                                <br /> 2 วิธีหมายถึงการเดิมพันว่าทีมใดชนะ (ไม่ผูก) รวมทั้งการทำงานล่วงเวลาและการลงโทษลูกโทษ
                                <br /> ผลรวมทีมเยือน / นอกบ้าน
                                <br /> ทำนายคะแนนสุดท้ายของทีม หากทีมที่บ้าน / ทีมเยือนทำแต้มได้มากกว่าโอเวอร์ / อันเดอร์ไลน์ที่กำหนดไว้ล่วงหน้า ถ้าคะแนนของทีมบ้านเกิด
                                / นอกทีมมีค่าน้อยกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เฉพาะเวลาปกติการทำงานล่วงเวลาและการยิงลูกโทษเท่านั้นไม่นับรวม
                                <br /> European Handicap
                                <br /> มีสามทางเลือกสำหรับทีมที่บ้านวาดและทีมเยือน เฉพาะเวลาปกติการทำงานล่วงเวลาและการยิงลูกโทษเท่านั้นไม่นับรวม
                                <br /> แฮนดิแค็ปไลน์ 1 บอล - ทีมที่เริ่มเล่นบอล 1 ลูก
                                <br /> เดิมพันทีมชนะ:
                                <br /> ชนะโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> การวางเดิมพัน:
                                <br /> -Win โดยตรง 1 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> เดิมพันชนะทีม:
                                <br /> - เสียหรือแพ้โดยการเดิมพันใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> Handicap Line 1 Ball - ทีมที่ได้รับการเริ่มต้นลูกบอลเต็มรูปแบบ
                                <br /> เดิมพันทีมชนะ:
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> เดิมพันชนะทีม:
                                <br /> - เล็งตรง 1 - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะโดยคะแนนใด ๆ หรือเสียโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> ตัวอย่าง:
                                <br /> การวางเดิมพัน:
                                <br /> - แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> แฮนดิแค็ปไลน์ 2 บอล - ทีมที่เริ่มเล่นบอล 2 ลูก
                                <br /> เดิมพันทีมชนะ:
                                <br /> ชนะโดย 3 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> การวางเดิมพัน:
                                <br /> -Win โดยตรง 2 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> เดิมพันชนะทีม:
                                <br /> - เสียหรือแพ้โดยการเดิมพันใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะโดย 3 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> Handicap Line 2 Ball - ทีมที่ได้รับการเริ่มต้นบอล 2 ครั้ง
                                <br /> เดิมพันทีมชนะ:
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> เดิมพันชนะทีม:
                                <br /> -Lose โดยตรง 2 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะด้วยคะแนนใด ๆ หรือเสียโดย 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> การวางเดิมพัน:
                                <br /> - แพ้ 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> ในการเล่น - เป้าหมายถัดไป (เฉพาะ OT เท่านั้น)
                                <br /> การเดิมพันเริ่มจากช่วงเวลาที่ทีมไปถึงเป้าหมายถัดไป สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและไม่มีเป้าหมาย การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น
                                <br /> ในการเล่น - ใครชนะในส่วนที่เหลือของการแข่งขัน (OT เท่านั้น!)?
                                <br /> การเดิมพันจะได้รับการยอมรับหลังจากการตัดสินเดิมพัน, เวลาที่เหลืออยู่ในการให้คะแนนการแข่งขันจะมีผลเหนือกว่า ในการเดิมพันใด
                                ๆ ที่ได้รับการยอมรับก่อนที่ลูกบอลจะไม่นับ สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและเสมอกัน การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น
                                <br /> ในการเล่น - เป้าหมายถัดไป (การลงโทษการลงโทษ)
                                <br /> การเดิมพันเริ่มจากช่วงเวลาที่ทีมไปถึงเป้าหมายถัดไป สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและไม่มีเป้าหมาย การเดิมพันจะมีการยิงลูกโทษเท่านั้น
                                <br /> In-Play - ทีมใดจะชนะการยิงลูกโทษ
                                <br /> เดิมพันทีมที่ชนะการลงโทษ สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือน</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 5}>
                        <p>กีฬาเบสบอล</p>
                            <p>สำคัญ</p>
                            <p>※โอกาสพิเศษที่เป็นไปได้จะไม่ได้รับการพิจารณาในตลาดใด ๆ ยกเว้น "ใครเป็นผู้ชนะจุด X" และ "ทีมใดจะชนะการแข่งขันไปยัง
                                X จุด" หรือระบุไว้เป็นอย่างอื่น
                            </p>
                            <p>※ชื่อของตลาดไม่ได้สะท้อนถึงข้อกำหนดที่แท้จริงที่ใช้ในกีฬาเบสบอล โปรดสังเกตตำนานต่อไปนี้สำหรับคำที่ใช้จริงในเบสบอล:</p>
                            <p>ชื่อตลาด
                                <br /> ข้อกำหนดที่ใช้ในกีฬาเบสบอล
                                <br /> ระยะเวลา
                                <br /> โอกาส
                                <br /> การทำงานล่วงเวลา (OT)
                                <br /> โอกาสพิเศษ
                                <br /> จุด
                                <br /> วิ่ง
                                <br /> ครึ่งแรก
                                <br /> ผลหลังจากช่วงครึ่งปีที่ 9
                                <br /> กฎการชำระบัญชีและการยกเลิก
                            </p>
                            <p>※การตลาดทั้งหมดจะถูกหักล้างตามผลสุดท้ายหลังจากโอกาส 9 (โอกาส 8 ½ถ้าทีมบ้านเป็นผู้นำที่จุดนี้)</p>
                            <p>※ในกรณีที่การแข่งขันถูกขัดจังหวะหรือยกเลิกและจะไม่ดำเนินการต่อในวันเดียวกันตลาดที่ไม่มีการตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องหรือสถานะการแข่งขันไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>ตลาดพิเศษ</p>
                            <p>Matchbet และ Totals</p>
                            <p>Matchbet และ Total หมายถึงการเดิมพันทั้งสองทำนายว่าการแข่งขันจะส่งผลให้ชนะในบ้านหรือชนะไปหรือเสมอหรือไม่ และจำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของเหตุการณ์จะเกินหรือต่ำกว่า
                                <br /> มีตัวเลือกการเดิมพันดังต่อไปนี้:
                            </p>
                            <p>เดิมพันแบบชนะเลิศและสูงกว่า - เดิมพันชนะหากทีมเยือนชนะและประตูรวมสูงกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>เดิมพันแบบ‧ &amp; สูงกว่า - เดิมพันจะชนะหากผลการแข่งขันที่เกิดขึ้นในการวาดและเป้าหมายทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>เดิมพันสูงขึ้นหากทีมเจ้าบ้านชนะและประตูรวมอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>เดิมพันแบบเอแอททีแอนด์เอ้า - เดิมพันชนะหากทีมเยือนชนะและประตูรวมทั้งหมดต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>‧Draw &amp; Under - เดิมพันจะชนะถ้าผลการแข่งขันที่เกิดขึ้นในการดึงและเป้าหมายทั้งหมดอยู่ใต้เส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>เดิมพันเบื้องหลังและต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>กำไรที่ได้รับ</p>
                            <p>ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                            </p>
                            <p>‧ชนะทีมในบ้านที่จะชนะและชนะคะแนนมากกว่า 4 คะแนน (ไม่รวม 4)</p>
                            <p>‧ชนะทีมในบ้านที่จะชนะและชนะคะแนน 3-4 จุด</p>
                            <p>‧ชนะทีมในบ้านที่จะชนะและชนะคะแนน 1-2 จุด</p>
                            <p>‧ชนะทีมเยือนชนะและชนะคะแนนมากกว่า 4 คะแนน (ไม่รวม 4)</p>
                            <p>‧ชนะทีมเยือนชนะและชนะคะแนน 3-4 คะแนน</p>
                            <p>‧ชนะทีมเยือนชนะและชนะคะแนน 1-2 จุด</p>
                            <p>คะแนนสะสม (ล่วงเวลา)</p>
                            <p>คะแนนสปอลหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มคะแนนที่กำหนดให้กับผลการแข่งขัน เดิมพันนี้มีการทำงานล่วงเวลา</p>
                            <p>ยอดรวม (ล่วงเวลา)</p>
                            <p>การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เดิมพันนี้มีการทำงานล่วงเวลา</p>
                            <p>แปลก / วิ่งได้ (ทำงานล่วงเวลา)</p>
                            <p>จำนวนการวิ่งหรือวิ่งในสกอร์สุดท้าย เดิมพันนี้มีการทำงานล่วงเวลา</p>
                            <p>ผลรวมทีมเยือน / นอกบ้าน</p>
                            <p>ทำนายคะแนนสุดท้ายของทีม หากทีมที่บ้าน / ทีมเยือนทำแต้มได้มากกว่าโอเวอร์ / อันเดอร์ไลน์ที่กำหนดไว้ล่วงหน้า ถ้าคะแนนของทีมบ้านเกิด
                                / นอกทีมมีค่าน้อยกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เฉพาะเวลาปกติเท่านั้นไม่รวมค่าล่วงเวลา</p>
                            <p>ในการเล่น - อัตรากำไรที่ชนะรวมถึงการทำงานล่วงเวลา</p>
                            <p>เมื่อจบเกมคะแนนของทีมในบ้านโดยหักคะแนนจากทีมเยือน เดิมพันนี้มีการทำงานล่วงเวลา</p>
                            <p>สามารถเลือกเดิมพันได้:</p>
                            <p>‧ชนะทีมในบ้านที่จะชนะและชนะคะแนนมากกว่า 3 คะแนน (รวม 3)</p>
                            <p>‧ชนะทีมในบ้านที่จะชนะและชนะ 2 แต้ม</p>
                            <p>‧ชนะทีมในบ้านที่จะชนะและชนะ 1 แต้ม</p>
                            <p>‧ทำให้ทีมในบ้านเสียและเสียคะแนน 1 คะแนน</p>
                            <p>‧ทำให้ทีมในบ้านแพ้และแพ้ 2 แต้ม</p>
                            <p>‧ให้คะแนนทีมที่บ้านแพ้และเสียคะแนนมากกว่า 3 คะแนน (รวม 3)</p>
                            <p>ในการเล่น - ใครคะแนน X จุด?</p>
                            <p>สามารถเดิมพันตัวเลือกคือทีมบ้านและคณะกรรมการทีมเยือน มีการนับคะแนนเพลย์ออฟ</p>
                            <p>ในการเล่น - ทีมใดชนะการแข่งขันไปยังจุด X</p>
                            <p>สามารถเดิมพันตัวเลือกคือทีมบ้านและคณะกรรมการทีมเยือน มีการนับคะแนนเพลย์ออฟ
                                <br /> X คือ 3, 5 และ 7 หากจบเกมคะแนนไม่ถึง X จุดเดิมพันถือเป็นโมฆะ (ยกเลิก)</p>
                            <p>แฮงค์เอ้าช์ในเอเชีย - เล่น</p>
                            <p>การเดิมพันทั้งหมดในตลาดเอเชียแฮนดิแคปอิน - เพลย์จะตัดสินตามเส้นคะแนนสำหรับส่วนที่เหลือของเกมหลังจากที่เดิมพันถูกสังหารแล้วคะแนนใด
                                ๆ ก่อนวางเดิมพันจะถูกละเว้นสำหรับการชำระบัญชี มีการนับคะแนนเพลย์ออฟ</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 6}>
                        <p>แฮนด์บอล</p>
                            <p>สำคัญ</p>
                            <p>※ทุกตลาด (ยกเว้นช่วงพักครึ่งครึ่งแรกที่ทำแต้ม X และทีมใดจะชนะการแข่งขันไปยัง X แต้ม) ถือว่าเป็นเวลาปกติเท่านั้น</p>
                            <p>※ถ้าการแข่งขันเกิดขึ้นที่สนามยิง 7 เมตร; ตลาด "ใครคะแนน Xth จุด?" และ "ทีมใดจะชนะการแข่งขันไป X จุด?" จะเป็นโมฆะ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงนับจากวันที่เริ่มต้นเตะการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากมีการเสนอราคาด้วยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 3 นาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>ตลาดพิเศษ</p>
                            <p>อีเกิ้ล / Fulltime
                                <br /> ครึ่งเวลา / เต็มเวลาหมายถึงการเดิมพันเพื่อคาดการณ์ผลการแข่งขันครึ่งเวลาและผลการแข่งขันเต็มเวลาของการแข่งขัน
                                สามารถเลือกเดิมพันได้:
                                <br /> ทีมเจ้าบ้าน / ทีมเจ้าบ้าน: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเจ้าบ้าน / เสมอ: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเจ้าบ้าน / ทีมเยือน: ทีมที่บ้านชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> วาด / ทีมเจ้าบ้าน: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> วาด / วาด: ทั้งสองทีมผูกในช่วงพักครึ่งและจบเกมทั้งสองทีมผูก
                                <br /> ทีมวาดภาพ / นอกทีม: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเยือนชนะ
                                <br /> ทีมเยือน / ทีมเจ้าบ้าน: ทีมเยือนชนะครึ่งหลังและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะครึ่งหลังและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> คี่ / คู่ (รวมการเดิมพัน 1st / 2nd)
                                <br /> เป้าหมายที่แปลกและไม่เท่ากันหมายถึงการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน เฉพาะเวลาปกติเท่านั้นไม่รวมค่าล่วงเวลา
                                <br /> แปลกและแม้กระทั่งหมายถึงการเดิมพันผลของครึ่งแรก / ครึ่งหลังจากครึ่งแรก / ครึ่งหลังของการแข่งขันที่จะตัดสิน
                                <br /> โอกาสคู่ (รวม 1/2 เดิมพัน)
                                <br /> ทายผลสุดท้ายด้วยโอกาสคู่ สามารถเลือกเดิมพันได้:
                                <br /> 1 หรือ 2 - หากผลที่ได้คือบ้านหรือนอกบ้านการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                                <br /> 1 หรือ X - หากผลที่ได้คือบ้านหรือวาดแล้วการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                                <br /> X หรือ 2 - หากผลที่ได้คือการจับสลากหรือออกไปการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                                <br /> ไม่ต้องเดิมพัน (รวมการเดิมพันที่ 1 และ 2)
                                <br /> หากผลการแข่งขันรอบสุดท้ายหลังจากเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการเดิมพันการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                                หากครึ่งหนึ่งของเกมมีการเดิมพันการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                                <br /> การเพิ่มเป้าหมาย (รวมเดิมพันครั้งที่ 1)
                                <br /> การเพิ่มเป้าหมายหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวดังกล่าวก่อนที่กิจกรรมจะเริ่มต้นขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแต้มต่อที่กำหนดให้กับผลการแข่งขัน เฉพาะเวลาปกติเท่านั้นไม่รวมค่าล่วงเวลา
                                <br /> ครึ่งแรก - การวางเป้าหมายหมายถึงการเดิมพันผลการแข่งขันในครึ่งแรกจากครึ่งแรกของการแข่งขันที่จะตัดสิน
                                <br /> รวมยอดรวม (รวมเดิมพันครึ่งแรก)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> ครึ่งแรก - ยอดรวมการเดิมพันหมายถึงการเดิมพันผลการแข่งขันในครึ่งแรกจากครึ่งแรกของการแข่งขันที่จะตัดสิน
                                <br /> ครึ่งคะแนนสูงที่สุด
                                <br /> ทำนายคะแนนสูงสุดในครึ่งแรกครึ่งหรือครึ่งหลัง
                                <br /> Matchbet และ Totals
                                <br /> Matchbet และ Total หมายถึงการเดิมพันทั้งสองทำนายว่าการแข่งขันจะส่งผลให้ชนะในบ้านหรือชนะไปหรือเสมอหรือไม่ และจำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของเหตุการณ์จะเกินหรือต่ำกว่า
                                <br /> มีตัวเลือกการเดิมพันดังต่อไปนี้:
                                <br /> เดิมพันเยือนและชนะ - เดิมพันจะชนะถ้าทีมเยือนชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> Draw &amp; Over - เดิมพันจะชนะถ้าผลการแข่งขันที่เกิดขึ้นในการวาดและเป้าหมายทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและหลัง - เดิมพันชนะหากทีมเจ้าบ้านชนะและประตูรวมอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> การเดิมพันและระหว่างการเดิมพันจะชนะถ้าทีมเยือนชนะและประตูรวมอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> วาดและใต้ - เดิมพันจะชนะหากผลการแข่งขันที่ได้รับในการวาดและเป้าหมายทั้งหมดอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและที่อยู่ต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้ากำไรที่ได้รับ
                                <br /> ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 10 คะแนน (ไม่รวม 10)
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 6-10 คะแนน
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 1-5 คะแนน
                                <br /> ทั้งสองทีมผูก
                                <br /> เดิมพันชนะไปและชนะคะแนนมากกว่า 10 คะแนน (ไม่รวม 10)
                                <br /> เดิมพันทีมเยือนชนะและชนะคะแนน 6-10 คะแนน
                                <br /> เดิมพันชนะไปและชนะคะแนน 1-5 จุด
                                <br /> ผลรวมทีมเยือน / นอกบ้าน
                                <br /> ทำนายคะแนนสุดท้ายของทีม หากทีมที่บ้าน / ทีมเยือนทำแต้มได้มากกว่าโอเวอร์ / อันเดอร์ไลน์ที่กำหนดไว้ล่วงหน้า ถ้าคะแนนของทีมบ้านเกิด
                                / นอกทีมมีค่าน้อยกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เฉพาะเวลาปกติเท่านั้นไม่รวมค่าล่วงเวลา
                                <br /> ในการเล่น - ทีมใดชนะการแข่งขันไปยังจุด X
                                <br /> ทำนายว่าทีมใดได้รับคะแนน X ครั้งแรก ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมบ้านซึ่งจะได้รับ 20 คะแนน
                                <br /> X คือ: 20, 30, 40 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก
                                <br /> In-Play - จุดคะแนน X ใคร
                                <br /> การคาดการณ์เกมที่ทีมได้รับคะแนน X ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมเยือนได้รับ 1 คะแนนทีมเยือนมีคะแนน 40 คะแนน
                                <br /> X คือ: 10,15,20,25 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 7}>
                        <p>วอลเลย์บอล</p>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่การจับคู่ไม่เสร็จสิ้นการตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>※ชุดราตรีสีทองไม่ได้มีการพิจารณาในตลาดใด ๆ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงนับจากวันที่เริ่มต้นเตะการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>ตลาดพิเศษ</p>
                            <p>แฮนดิแค็ป (รวมการเดิมพันชุดที่ 1)
                                <br /> แฮนดิแค็ปหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (มีประสิทธิภาพในการเริ่มต้นของหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแต้มต่อที่กำหนดให้กับผลการแข่งขัน
                                <br /> ยอดรวม (รวมการเดิมพันชุดที่ 1)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> จำนวนชุดทั้งหมด (ดีที่สุดจาก 5)
                                <br /> เกมทำนายจะมีกี่ชุด สามารถเลือกเดิมพันได้ 3, 4 และ 5
                                <br /> คะแนนชุดที่ถูกต้อง
                                <br /> ทายผลสุดท้ายของเกมสามารถเลือกเดิมพันได้:
                                <br /> 3: 0 - ทีมเจ้าบ้าน 3 ชุดเยือนทีม 0 ชุด
                                <br /> 3: 1 - ทีมชุดใหญ่ 3 ชุดเยือนทีม 1 ชุด
                                <br /> 3: 2 - ทีมชุดใหญ่ 3 ชุดเยือนทีม 2 ชุด
                                <br /> 0: 3 - ทีมเจ้าบ้าน 0 เซตทีมเยือน 3 ชุด
                                <br /> 1: 3 - ทีมชุดใหญ่ 1 ชุดทีมเยือน 3 ชุด
                                <br /> 2: 3 - ทีมชุดใหญ่ 2 ชุดเยือนทีม 3 ชุด
                                <br /> จำนวนเซ็ทจะเกินขีด จำกัด เท่าไร?
                                <br /> คาดเดาจำนวนเซ็ตทีมจะมีคะแนนมากกว่า 25 คะแนน (5 ชุด 15 คะแนน)
                                <br /> ชุดที่ 1 แข่งกับ X
                                <br /> ทำนายว่าทีมใดได้รับคะแนน X แรกในชุดที่ 1 ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมบ้านซึ่งจะได้รับ 20 คะแนน
                                <br /> X คือ: 20, 30, 40 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก
                                <br /> ชุดที่ 1 คี่ / คู่
                                <br /> ชุดที่ 1 คี่และคู่มีการกำหนดด้วยคะแนนชุดแรกเพื่อพิจารณาการเดิมพัน
                                <br /> ผู้ชนะชุดแรก (รวมถึงชุดเดิมพันที่ 3 และ 4/5)
                                <br /> ในกรณีที่การแข่งขันเริ่มต้น แต่ไม่เสร็จสมบูรณ์เดิมพันทั้งหมดจะเป็นโมฆะ
                                <br /> ในการเล่น - ทีมใดชนะการแข่งขันไปยังจุด X
                                <br /> ทำนายว่าทีมใดได้รับคะแนน X ครั้งแรก ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมบ้านซึ่งจะได้รับ 20 คะแนน
                                <br /> X คือ: 20, 30, 40 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก
                                <br /> In-Play - จุดคะแนน X ใคร
                                <br /> การคาดการณ์เกมที่ทีมได้รับคะแนน X ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมเยือนได้รับ 1 คะแนนทีมเยือนมีคะแนน 40 คะแนน
                                <br /> X คือ: 10,15,20,25 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก</p>
                        </div>
                        
                        <div className="centerDetail" hidden={this.state.current !== 8}>
                        <p>วอลเลย์บอลชายหาด</p>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่การจับคู่ไม่เสร็จสิ้นตลาดที่ไม่มีการตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>※ชุดราตรีสีทองไม่ได้มีการพิจารณาในตลาดใด ๆ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงนับจากวันที่เริ่มต้นเตะการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากทีมเกษียณตลาดที่ไม่มีการตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>ตลาดพิเศษ</p>
                            <p>แฮนดิแค็ป (รวมการเดิมพันชุดที่ 1)
                                <br /> แฮนดิแค็ปหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (มีประสิทธิภาพในการเริ่มต้นของหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแต้มต่อที่กำหนดให้กับผลการแข่งขัน
                                <br /> ยอดรวม (รวมการเดิมพันชุดที่ 1)
                                <br /> การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้
                                <br /> จำนวนชุดทั้งหมด (ดีที่สุด 3)
                                <br /> เกมทำนายจะมีกี่ชุด สามารถเลือกเดิมพันได้ 2 และ 3
                                <br /> คะแนนชุดที่ถูกต้อง
                                <br /> ทายผลสุดท้ายของเกมสามารถเลือกเดิมพันได้:
                                <br /> 2: 0 - ทีมชาติชุดที่ 2, ทีมเยือน 0 ชุด
                                <br /> 2: 1 - ทีมชุดใหญ่ 2 ชุดเยือนทีม 1 ชุด
                                <br /> 0: 2 - ทีมเจ้าบ้าน 0 ชุด, เยือนทีม 2 ชุด
                                <br /> 1: 2 - ทีมเจ้าบ้าน 1 ชุดทีมเยือน 2 ชุด
                                <br /> จำนวนเซ็ทจะเกินขีด จำกัด เท่าไร?
                                <br /> คาดการณ์จำนวนเซ็ตทีมจะมีคะแนนมากกว่า 21 คะแนน (3 ชุด 15 คะแนน)
                                <br /> ชุดที่ 1 แข่งกับ X
                                <br /> ทำนายว่าทีมใดได้รับคะแนน X แรกในชุดที่ 1 ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมบ้านซึ่งจะได้รับ 20 คะแนน
                                <br /> X คือ: 20, 30, 40 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก
                                <br /> ชุดที่ 1 คี่ / คู่
                                <br /> ชุดที่ 1 คี่และคู่มีการกำหนดด้วยคะแนนชุดแรกเพื่อพิจารณาการเดิมพัน
                                <br /> ใครชนะชุดแรก (รวมถึงชุดเดิมพันที่ 2 และ 3)
                                <br /> ในกรณีที่การแข่งขันเริ่มต้น แต่ไม่เสร็จสมบูรณ์เดิมพันทั้งหมดจะเป็นโมฆะ
                                <br /> ในการเล่น - ทีมใดชนะการแข่งขันไปยังจุด X
                                <br /> ทำนายว่าทีมใดได้รับคะแนน X ครั้งแรก ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมบ้านซึ่งจะได้รับ 20 คะแนน
                                <br /> X คือ: 20, 30, 40 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก
                                <br /> In-Play - จุดคะแนน X ใคร
                                <br /> การคาดการณ์เกมที่ทีมได้รับคะแนน X ตัวอย่างเช่นคะแนนปัจจุบัน 20-19 ทีมเยือนได้รับ 1 คะแนนทีมเยือนมีคะแนน 40 คะแนน
                                <br /> X คือ: 10,15,20,25 ... เป็นต้น
                                <br /> ในตอนท้ายของเกมไม่มีทีมใดได้รับแต้ม X แต้มต่อจะถือว่าถูกยกเลิก</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 9}>
                        <p>ฟุตซอล</p>
                            <p>สำคัญ</p>
                            <p>※ทุกตลาด (ยกเว้นอีเกิ้ล, ครึ่งปีแรก, โอเวอร์ไทม์และการยิงลูกโทษ) เป็นระยะเวลาปกติเท่านั้น</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะและดำเนินการต่อภายใน 48 ชม. หลังจากวันที่เริ่มต้นการแข่งขันการเดิมพันแบบโอเพนทั้งหมดจะตัดสินด้วยผลการแข่งขัน
                                มิเช่นนั้นการเดิมพันที่ยังไม่ได้กำหนดทั้งหมดถือเป็นโมฆะ
                            </p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากตลาดยังคงเปิดขึ้นเมื่อเหตุการณ์ต่อไปนี้เกิดขึ้นแล้ว: เป้าหมายบัตรสีแดงหรือสีเหลืองแดงและการลงโทษเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากเปิดตลาดด้วยบัตรสีแดงที่ขาดหายไปหรือไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากอัตราต่อรองถูกเสนอโดยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 2 นาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากมีการป้อนคะแนนที่ไม่ถูกต้องตลาดทั้งหมดจะถูกยกเลิกไปเมื่อมีการแสดงคะแนนที่ไม่ถูกต้อง</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงหลังจากวันที่เริ่มต้นการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากชื่อหรือหมวดหมู่ของทีมแสดงไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>ตลาดพิเศษ
                                <br /> แฮงค์อินในเอเชีย - เล่น
                                <br /> เดิมพันทั้งหมดในตลาด Handicap In-Play ของเอเชียจะตัดสินตามเส้นคะแนนสำหรับส่วนที่เหลือของเกม / ครึ่งหลังการวางเดิมพันเดิมพันใด
                                ๆ ก็ตามก่อนที่จะมีการวางเดิมพันจะถูกละเว้นเพื่อการชำระบัญชี</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 10}>
                        <p>แบดมินตัน</p>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่การจับคู่ไม่เสร็จสิ้นการตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงนับจากวันที่เริ่มต้นเตะการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากผู้เล่น / ทีมแสดงผลไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากผู้เล่นเกษียณตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 11}>
                        <p>รักบี้ยูเนี่ยน &amp; ลีก</p>
                            <p>สำคัญ</p>
                            <p>※ทุกตลาด (ยกเว้นอีเกิ้ล, ครึ่งปีแรก, โอเวอร์ไทม์และการยิงลูกโทษ) เป็นระยะเวลาปกติเท่านั้น</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะและดำเนินการต่อภายใน 48 ชม. หลังจากการเตะเริ่มต้นการเดิมพันที่เปิดทั้งหมดจะตัดสินด้วยผลการแข่งขัน
                                มิเช่นนั้นการเดิมพันที่ยังไม่ได้กำหนดทั้งหมดถือเป็นโมฆะ
                            </p>
                            <p>※ปกติ 80 นาที: การแข่งขันขึ้นอยู่กับผลการแข่งขันเมื่อสิ้นสุดการแข่งขัน 80 นาทีตามที่กำหนดยกเว้นที่ระบุไว้เป็นอย่างอื่น
                                รวมถึงการบาดเจ็บใด ๆ หรือเวลาหยุดการแข่งขัน แต่ไม่รวมถึงเวลาพิเศษเวลาที่กำหนดสำหรับการยิงลูกโทษหรือการเสียชีวิตอย่างกะทันหัน</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากตลาดยังคงเปิดทำการเมื่อเหตุการณ์ต่อไปนี้เกิดขึ้นแล้ว: การเปลี่ยนแปลงคะแนนหรือบัตรสีแดงเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากเปิดตลาดด้วยบัตรสีแดงที่ขาดหายไปหรือไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากอัตราต่อรองถูกเสนอโดยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 2 นาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงหลังจากวันที่เริ่มต้นการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากชื่อหรือหมวดหมู่ของทีมแสดงไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>ตลาดพิเศษ</p>
                            <p>อีเกิ้ล / Fulltime
                                <br /> ครึ่งเวลา / เต็มเวลาหมายถึงการเดิมพันเพื่อคาดการณ์ผลการแข่งขันครึ่งเวลาและผลการแข่งขันเต็มเวลาของการแข่งขัน
                                สามารถเลือกเดิมพันได้:
                                <br /> ทีมเจ้าบ้าน / ทีมเจ้าบ้าน: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเจ้าบ้าน / เสมอ: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเจ้าบ้าน / ทีมเยือน: ทีมที่บ้านชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> วาด / ทีมเจ้าบ้าน: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> วาด / วาด: ทั้งสองทีมผูกในช่วงพักครึ่งและจบเกมทั้งสองทีมผูก
                                <br /> ทีมวาดภาพ / นอกทีม: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเยือนชนะ
                                <br /> ทีมเยือน / ทีมเจ้าบ้าน: ทีมเยือนชนะครึ่งหลังและจบเกมที่ทีมเจ้าบ้านชนะ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะครึ่งหลังและจบเกมทั้งสองทีมเสมอ
                                <br /> ทีมเยือน / ทีมเยือน: ทีมเยือนชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ
                                <br /> คี่ / คู่แต้ม (รวมการเดิมพันครึ่งแรก)
                                <br /> เป้าหมายที่แปลกและไม่เท่ากันหมายถึงการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน เฉพาะเวลาปกติเท่านั้นไม่รวมค่าล่วงเวลา
                                <br /> ครึ่งหลังคี่ / แม้แต่คะแนนหมายถึงการเดิมพันผลการแข่งขันในครึ่งแรกจากคะแนนการแข่งขันครึ่งแรกที่จะตัดสิน
                                <br /> คะแนนสะสม (รวมเดิมพันครึ่งแรก)
                                <br /> คะแนนสปอลหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับการเริ่มต้นของหัวอย่างแท้จริง (เริ่มต้นอย่างมีประสิทธิภาพโดยการเริ่มต้นหัวนั้นก่อนที่เหตุการณ์จะเริ่มขึ้น)
                                ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มคะแนนที่กำหนดให้กับผลการแข่งขัน
                                <br /> 1st Half Points Spreads หมายถึงการเดิมพันผลการแข่งขันในครึ่งแรกจากครึ่งแรกของการแข่งขันที่จะตัดสิน
                                <br /> ครึ่งคะแนนสูงที่สุด
                                <br /> ทำนายคะแนนสูงสุดในครึ่งแรกครึ่งหรือครึ่งหลัง
                                <br /> สหภาพรักบี้ที่ชนะการประกวด
                                <br /> ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 14 คะแนน (ไม่รวม 14)
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 8-14 คะแนน
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 1-7 คะแนน
                                <br /> ทั้งสองทีมผูก
                                <br /> เดิมพันชนะไปชนะและชนะคะแนนมากกว่า 14 คะแนน (ไม่รวม 14)
                                <br /> เดิมพันชนะไปและชนะคะแนน 8-14 คะแนน
                                <br /> เดิมพันชนะไปและชนะคะแนน 1-7 จุด
                                <br /> ลีกรักบี้ที่ชนะการประกวด
                                <br /> ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 12 คะแนน (ไม่รวม 12)
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 7-12 คะแนน
                                <br /> เดิมพันทีมบ้านชนะและชนะคะแนน 1-6 คะแนนทั้งสองทีมเสมอ
                                <br /> เดิมพันชนะไปและชนะคะแนนมากกว่า 12 คะแนน (ไม่รวม 12)
                                <br /> ชนะทีมเยือนชนะและชนะคะแนน 7-12 คะแนน
                                <br /> เดิมพันชนะไปและชนะคะแนน 1-6 จุด
                                <br /> In-Play - ใครชนะการแข่งขันที่เหลือ?
                                <br /> การเดิมพันจะได้รับการยอมรับหลังจากการตัดสินเดิมพัน, เวลาที่เหลืออยู่ในการให้คะแนนการแข่งขันจะมีผลเหนือกว่า ในการเดิมพันใด
                                ๆ ที่ได้รับการยอมรับก่อนที่ลูกบอลจะไม่นับ สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและเสมอกัน
                                <br /> ในการเล่น - ช่วงพักครึ่ง - ใครชนะส่วนที่เหลือ?
                                <br /> การเดิมพันจะได้รับการยอมรับหลังจากการตัดสินเดิมพัน, เวลาที่เหลืออยู่ในการให้คะแนนการแข่งขันจะมีผลเหนือกว่า ในการเดิมพันใด
                                ๆ ที่ได้รับการยอมรับก่อนที่ลูกบอลจะไม่นับ สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและเสมอกัน การเดิมพันมีเพียงครึ่งแรกเท่านั้น
                                <br /> ในการเล่น - อัตรากำไรรวม Rugby
                                <br /> จำนวนรวมของเป้าหมายที่เกมทั้งสองทีมบวกการคำนวณทั้งหมด ตัวเลือกเดิมพันคือ: น้อยกว่า 28, 28-34, 35-41, 42-48,
                                49-55, 56-62 และมากกว่า 62
                                <br /> ช่วงการเล่นในครึ่งหลัง - อัตรากำไรรวม Rugby
                                <br /> จำนวนรวมของเป้าหมายที่เกมทั้งสองทีมบวกการคำนวณทั้งหมด ตัวเลือกเดิมพันคือ: น้อยกว่า 7, 7-13, 14-20, 21-27, 28-34,
                                35-41 และมากกว่า 41 กรณีการเดิมพันมีเพียงครึ่งแรกเท่านั้น
                                <br /> ในเดี๋ยวนี้ - Matchbet และ Totals
                                <br /> Matchbet และ Total หมายถึงการเดิมพันทั้งสองทำนายว่าการแข่งขันจะส่งผลให้ชนะในบ้านหรือชนะไปหรือเสมอหรือไม่ และจำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของเหตุการณ์จะเกินหรือต่ำกว่า
                                <br /> มีตัวเลือกการเดิมพันดังต่อไปนี้:
                                <br /> เดิมพันเยือนและชนะ - เดิมพันจะชนะถ้าทีมเยือนชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> Draw &amp; Over - เดิมพันจะชนะถ้าผลการแข่งขันที่เกิดขึ้นในการวาดและเป้าหมายทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและหลัง - เดิมพันชนะหากทีมเจ้าบ้านชนะและประตูรวมอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> การเดิมพันและระหว่างการเดิมพันจะชนะถ้าทีมเยือนชนะและประตูรวมอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> วาดและใต้ - เดิมพันจะชนะหากผลการแข่งขันที่ได้รับในการวาดและเป้าหมายทั้งหมดอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                                <br /> บ้านและที่อยู่ต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 12}>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่การจับคู่ไม่เสร็จสิ้นการตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากผู้เล่น / ทีมแสดงผลไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากการแข่งขันไม่สมบูรณ์ตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>※ Bullseye นับเป็นสีแดงเช็คเอาท์</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 13}>
                            <p>สนุ๊กเกอร์</p>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่ผู้เล่นเกษียณหรือถูกตัดสิทธิในตลาดที่ไม่มีการตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากผู้เล่น / ทีมแสดงผลไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากการแข่งขันไม่สมบูรณ์ตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 14}>
                            <p>ปิงปอง</p>
                            <p>สำคัญ</p>
                            <p>※ในกรณีที่การจับคู่ไม่เสร็จสิ้นการตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงนับจากวันที่เริ่มต้นเตะการเดิมพันจะถือเป็นโมฆะ</p>
                            <p>※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากผู้เล่น / ทีมแสดงผลไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน</p>
                            <p>※หากผู้เล่นเกษียณตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ</p>
                            <p>ตลาดพิเศษ</p>
                            <p>จำนวนเซ็ทจะเกินขีด จำกัด ของจำนวนที่กำหนด
                                <br /> จำนวนคะแนนที่กำหนดไว้อย่างน้อยหนึ่งทีมมากกว่า 11 คะแนน</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 15}>
                            <p>กอล์ฟ</p>
                            <p>สำคัญ</p>
                            <p>※การเดิมพันทั้งหมดเป็นไปตามผลของการแข่งขันกอล์ฟอย่างเป็นทางการเพื่อการตั้งถิ่นฐาน</p>
                            <p>※หากผู้เล่นไม่ได้มีส่วนร่วมในการแข่งขันหรือรอบที่ระบุผู้เล่นเดิมพันทั้งหมดจะเป็นโมฆะ หากนักกอล์ฟในทัวร์นาเม้นท์และทางออกที่เฉพาะเจาะจงเปลี่ยนหรือตัดสิทธิเดิมพันทั้งหมดจะหมดลง</p>
                            <p>※หากการแข่งขันหรือรอบที่เฉพาะเจาะจงเลื่อนออกไปหรือระงับการเดิมพันทั้งหมดจะมีผลภายใน 48 ชั่วโมงหลังจากสิ้นสุดการแข่งขัน</p>
                        </div>
                        <div className="centerDetail"hidden={this.state.current !== 16}>
                        <p>สำคัญ</p>
                            <p>※ทุกตลาดไม่พิจารณา super overs ยกเว้นที่ระบุไว้เป็นอย่างอื่น
                                <br /> ※การลงโทษไม่ได้รับการพิจารณาในตลาดใด ๆ ที่มีการส่งมอบหรือรับมอบสินค้า
                                <br /> ※ยี่สิบ 20: การเล่นเกินกำหนดทั้งหมดจะต้องเล่นให้กับตลาดที่ยังไม่ตัดสินใจที่จะตัดสินได้เว้นแต่จะได้ข้อสรุปที่เป็นธรรมชาติ
                                <br /> ※ ODIs: ต้องมีการเล่น 90% ของยอดเงินทั้งหมดที่จัดสรรไว้สำหรับการเล่นในช่วงเวลาที่มีการวางเดิมพันเพื่อให้ตลาดตัดสินได้เว้นแต่โอกาสจะได้ข้อยุติตามธรรมชาติแล้ว
                                <br /> ※ Super overs: เพิ่มเวลา</p>
                            <p>กฎการชำระบัญชีและการยกเลิก</p>
                            <p>※หากการแข่งขันถูกยกเลิกก่อนการแข่งขันใด ๆ การเดิมพันทั้งหมดถือเป็นโมฆะเว้นแต่จะมีการเล่นซ้ำภายใน 48 ชั่วโมงนับจากเวลาเริ่มต้นครั้งแรก
                                <br /> ※ถ้าการแข่งขันถูกมัดและกฎการแข่งขันอย่างเป็นทางการไม่ได้กำหนดผู้ชนะ หรือถ้ากฎการแข่งขันกำหนดผู้ชนะโดยการโยนเหรียญหรือการวาดภาพจำนวนมากตลาดที่ยังไม่ตัดสินใจทั้งหมดถือเป็นโมฆะ
                                <br /> ※ในกรณีที่ยังไม่เสร็จสิ้นตลาดที่ยังไม่ตัดสินใจทั้งหมดในเรื่องนี้เฉพาะเจาะจงจะถือเป็นโมฆะเว้นแต่โอกาสได้บรรลุข้อสรุปตามธรรมชาติเช่น
                                ประกาศทีมทั้งหมดออก ฯลฯ
                                <br /> ※หากตลาดยังคงมีคะแนนไม่ถูกต้องซึ่งมีผลกระทบอย่างมากต่อราคาเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                            </p>
                            <p>ตลาดพิเศษ</p>
                            <p>2 วิธี</p>
                            <p>วิธีที่ 2 หมายถึงการเดิมพันว่าทีมใดชนะและรวมไปถึงซุปเปอร์ เดิมพันแบบแมทช์เพลย์จะตัดสินตามกฎการแข่งขันอย่างเป็นทางการ
                                ในเกมที่ได้รับผลกระทบจากสภาพอากาศเลวร้ายการเดิมพันจะตัดสินตามผลการแข่งขันอย่างเป็นทางการ</p>
                            <p>รวม Spreads</p>
                            <p>การกระจายรวมหมายถึงการเดิมพันที่กำหนดโดยจำนวนการวิ่งทั้งหมดในผลการแข่งขัน เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด
                                หากผลรวมเกินกว่าเส้นสูงกว่าหรือต่ำกว่าเส้นที่กำหนดไว้ หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ต่ำกว่าที่กำหนดไว้</p>
                            <p>แปลก / แม้วิ่ง</p>
                            <p>คี่ / วันหมายถึงการเดิมพันที่กำหนดโดยจำนวนรวมของการวิ่งในผลการแข่งขันคือ Odd หรือ Even เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>ผลรวมของทีม</p>
                            <p>การวางเดิมพันหมายความว่าคะแนนโดยรวมของทีมมากกว่าหรือต่ำกว่าจำนวนรวมที่กำหนดเมื่อสิ้นสุดการแข่งขันปกติ เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>จำนวนการวิ่งสูงสุดจะได้คะแนนเท่าไหร่?</p>
                            <p>ทำนายการให้คะแนนสูงสุดเพื่อให้ได้วิ่งไม่กี่ เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>ทีมใดมีคะแนนสูงสุด</p>
                            <p>ทำนายว่าทีมใดได้รับคะแนนสูงสุด สามารถเดิมพันตัวเลือกคือทีมบ้านวาดและทีมเยือน เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>ทีมรวมช่วง</p>
                            <p>ทำนายช่วงคะแนนของทีมเฉพาะเมื่อสิ้นสุดช่วงเวลาปกติ เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>ทีมทีมแรกหก / สิบ overs - 3Way</p>
                            <p>คาดการณ์ผลลัพธ์หลังจากหกถึงสิบครั้งแรก สามารถเดิมพันตัวเลือกคือทีมบ้านวาดและทีมเยือน</p>
                            <p>ทีมทีมแรกหก / สิบรอบ - ผลรวม</p>
                            <p>การเดิมพันจะถูกกำหนดโดยคะแนนของทีมหนึ่ง ๆ หลังจากมีการจ่ายเงินตามจำนวนที่ระบุ</p>
                            <p>ทีมทีมแรกหก / สิบ overs - ช่วงทั้งหมด</p>
                            <p>คาดการณ์ช่วงคะแนนสำหรับทีมหนึ่ง ๆ เมื่อสิ้นสุดการระบุจำนวนครั้งที่ระบุ</p>
                            <p>จะมี Super overs?</p>
                            <p>คาดการณ์ว่าเกมจะเชื่อมโยงกับสุดยอดหรือไม่</p>
                            <p>ในการเล่น - การดำเนินการของทีม</p>
                            <p>ทำนายช่วงคะแนนของทีมเฉพาะเมื่อสิ้นสุดช่วงเวลาปกติ เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>จำนวนในการเล่นในการให้คะแนนสูงสุดหรือไม่?</p>
                            <p>ทำนายการให้คะแนนสูงสุดเพื่อให้ได้วิ่งไม่กี่ เฉพาะช่วงเวลาปกติเท่านั้นไม่นับยอดเกินขนาด</p>
                            <p>In-Play - ทีมใดจะเป็นผู้นำหลังจากพ่ายแพ้ "X"</p>
                            <p>การคาดการณ์ผลลัพธ์หลังจากมีการพากย์เฉพาะ สามารถเดิมพันตัวเลือกคือทีมบ้านวาดและทีมเยือน</p>
                            <p>ทีมในการเล่น - ทั้งหมดทำงานหลัง "X" overs</p>
                            <p>การเดิมพันจะถูกกำหนดโดยคะแนนของทีมหนึ่ง ๆ หลังจากมีการจ่ายเงินตามจำนวนที่ระบุ</p>
                            <p>ทีมในการเล่น - ทีมทำงานหลังจากพาดหัว "X"</p>
                            <p>คาดการณ์ช่วงคะแนนสำหรับทีมหนึ่ง ๆ เมื่อสิ้นสุดการระบุจำนวนครั้งที่ระบุ</p>
                            <p>การเล่นในทีม - การรวมทีมสำหรับ "X" ในโอกาส "X"</p>
                            <p>การเดิมพันจะพิจารณาจากคะแนนของทีมหนึ่ง ๆ หลังจากมีโอกาส / overs ที่ระบุไว้</p>
                            <p>In-Play - Team Odd / แม้ในการแข่งขันสำหรับ "X" ในโอกาส "X"</p>
                            <p>การเดิมพันจะพิจารณาจากคะแนนของทีมหนึ่ง ๆ หลังจากมีโอกาส / overs ที่ระบุไว้</p>
                            <p>จำนวนในการเล่น - ทีมทั้งหมดทำงานในการแสดง "X" ของ "X" ในโอกาส "X"</p>
                            <p>การเดิมพันจะพิจารณาจากคะแนนของทีมหนึ่ง ๆ หลังจากมีโอกาส / overs / delivery ที่ระบุไว้</p>
                            <p>ในการเล่น - การเลิกจ้างต่อไป</p>
                            <p>ตัวเลือกที่ใช้ได้คือ: ติด, โบว์ลิ่ง, LBW, วิ่งออก, นิ่งงันหรืออื่น ๆ หากไม่มี wickets อื่นตกเดิมพันทั้งหมดจะเป็นโมฆะ</p>
                            <p>ในการเล่น - การเลิกจ้างต่อไป (จับ / ไม่ถูกจับ)</p>
                            <p>ตัวเลือกที่ใช้ได้คือ: ติดและไม่ติด หากไม่มี wickets อื่นตกเดิมพันทั้งหมดจะเป็นโมฆะ</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 17}>
                        <p>ฟุตบอลลีกเสมือนจริง (VFL)</p>
                            <p>วิธีการเล่น</p>
                            <p>VFL ให้ประสบการณ์การพนันเงินจริง 24/7/365 กับฟุตบอลเสมือนจริง ลีกประกอบด้วย 16 ทีมและฤดูกาลทำงานอย่างต่อเนื่อง แต่ละฤดูกาลประกอบด้วย
                                30 วันที่ตรงกัน (การแข่งขันในบ้านและอื่น ๆ )
                                <br /> สามารถวางเดิมพันได้ตลอดเวลา - แม้จะอยู่ในช่วงฤดูก็ตาม</p>
                            <p>ข้อมูลซีซัน</p>
                            <p>หนึ่งฤดูกาลกินเวลา 141 นาทีโดยรวมแบ่งออกเป็นช่วง 'Pre ลีก', 'Matchday Loop' และช่วง 'Post league' ช่วงเวลา 'Pre League'
                                ทำงานก่อนที่จะเริ่มฤดูกาลและใช้เวลา 2:30 นาที
                                <br /> วันที่ตรงกันทั้งหมดจะสรุปเป็นช่วง 'Matchday Loop' โดยมีระยะเวลารวม 137: 30 ในตอนท้ายของทุกฤดูกาลจะมีช่วงเวลา
                                Post Season 60 ขึ้นไป</p>
                            <p>ข้อมูลวันแข่งขัน</p>
                            <p>เวลาในการแข่งขันหนึ่งครั้งอยู่ที่เวลา 4:35 นาที แบ่งออกเป็นช่วง 'การจับคู่', 'ครึ่งแรก', 'ช่วงพักครึ่งหัว', 'ครึ่งหลัง',
                                'หลังการแข่งขัน' และ 'ช่วงหลังแข่ง'
                                <br /> ช่วงเวลา 'การจับคู่' ทำงานก่อนที่จะเริ่มการแข่งขันเป็นเวลา 60 วินาที การแข่งขันใช้เวลา 1:30 นาทีสำหรับแต่ละครึ่งและพักครึ่งกันเป็นเวลา
                                10 วินาที การแข่งขันแต่ละครั้งจะตามด้วยช่วงหลังการโพสต์การแข่งขัน (Post Match) 10 วินาทีและท้ายสุดคือ 'Matchday
                                Period' 15 วินาที</p>
                            <p>การพนัน</p>
                            <p>อนุญาตให้วางเดิมพันในการแข่งขัน VFL ได้ถึง 10 วินาทีก่อนที่จะเริ่มเตะ ตลาดเดิมพันสำหรับวันแข่งขันในอนาคตของฤดูกาลปัจจุบันยังคงเปิดอยู่
                                เมื่อเลือกวันที่ตรงกันจากแถบ "เลือก Matchday" ที่ด้านล่างการแข่งขันที่เกี่ยวข้องกับวันนั้นพร้อมกับราคาจะปรากฏในส่วนราคาต่ำกว่า
                                ตัวเลือกการเดิมพันที่เกี่ยวข้องกับการจับคู่ดังต่อไปนี้มีดังนี้
                                <br /> ‧Asian HDP
                                <br /> ‧รวม (มากกว่า; ใต้)
                                <br /> ‧.3ทาง (ที่บ้านวาด; ไป)
                                <br /> ‧-300ครึ่ง (บ้านวาด; ไป)
                                <br /> ‧เป้าหมายแรก (บ้านไม่มีเป้าหมาย;
                                <br /> ‧ภาษาจีน (บ้านวาด; ไป)</p>
                            <p>เบ็ดเตล็ด</p>
                            <p>การจับคู่ทั้งหมดจะออกอากาศเป็นสตรีมวิดีโอสดผ่านเครื่องเล่นสื่อในเบราเซอร์ของคุณ
                                <br /> คุณสามารถสลับได้อย่างอิสระระหว่างแปดเกมที่พร้อมใช้งานต่อวันที่จับคู่หรือเลือกเล่นตามการแข่งขันที่คุณชื่นชอบเท่านั้น
                                การจำลองการจับคู่เกิดขึ้นผ่านการผสมผสานของ Artificial Intelligence และเครื่องกำเนิดตัวเลขสุ่มแบบอิสระ ในเวลาเดียวกันพารามิเตอร์ประสิทธิภาพของผู้เล่น
                                VFL จะขึ้นอยู่กับนักฟุตบอลอาชีพ (เช่นในแง่ของจำนวนเป้าหมายฟิตเนสสถิติการจับคู่แบบต่อเนื่อง ฯลฯ )</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 18}>
                        <p>E-Sports</p>
                            <p>กฎทั่วไป</p>
                            <p>●กรณีที่มีผู้เล่นสองคนหรือทีมที่เล่นเกมหรือแผนที่หลายรายการเช่น "ดีที่สุด 3" และไม่เล่นเกมหรือแผนที่มากกว่าหนึ่งเกมเนื่องจากผลของการแข่งขันถูกตัดสินแล้วเดิมพันในเกมที่ไม่ได้เล่น
                                หรือแผนที่จะเป็นโมฆะและเงินเดิมพันจะได้รับการคืนเงิน
                            </p>
                            <p>●วันที่และเวลาเริ่มต้นจะแสดงขึ้นเพื่อเป็นข้อมูลเท่านั้นและอาจไม่ถูกต้อง กรณีที่การแข่งขันถูกยกเลิกยกเลิกหรือถูกขัดจังหวะและไม่เสร็จสิ้นภายใน
                                48 ชั่วโมงนับจากเวลาเริ่มต้นที่กำหนดไว้ครั้งแรกการเดิมพันในเหตุการณ์ดังกล่าวถือเป็นโมฆะและการคืนเงินเดิมพัน อย่างไรก็ตามเกมหรือแผนที่ที่เสร็จสิ้นภายใน
                                48 ชั่วโมงจะได้รับการตัดสินตามปกติแม้ว่าเกมหรือแผนที่เพิ่มเติมที่ควรจะเป็นส่วนหนึ่งของเกมเดียวกันจะถูกยกเลิกหรือเลื่อนออกไป</p>
                            <p>●การเดิมพันถูกตัดสินตามการออกอากาศอย่างเป็นทางการของผู้จัดงานหรือผู้จัดกิจกรรม ในกรณีที่การออกอากาศแสดงถึงเคาน์เตอร์ของรอบที่ได้รับรางวัลฆ่ามังกรอาคาร
                                ฯลฯ โดยทั่วไปแล้วจะใช้เพื่อชำระเดิมพันที่เกี่ยวข้อง หากผลการเดิมพันไม่ชัดเจนจากการออกอากาศหรือหากไม่มีการออกอากาศระบบจะใช้สถิติ
                                API สำหรับเกมที่มีให้</p>
                            <p>●ในกรณีที่มีการจัดทำดัชนีหรือหมายเลขตลาด (เช่นผู้ชนะรอบที่ระบุใน Counter Strike: GO หรือทีมที่ทำคะแนนฆ่าเฉพาะใน League
                                of Legends หรือ DOTA2) ดัชนีจะกำหนดวัตถุประสงค์ที่จะนับ คำพูดเช่น "next" ในชื่อทางการตลาดไม่ได้รับการรับประกันว่าถูกต้องเนื่องจากการออกอากาศอาจล่าช้าและเราอาจไม่สามารถเลื่อนระดับดัชนีได้อย่างแม่นยำเมื่อเป้าหมายถูกทำคะแนนหรือรอบที่เสร็จสิ้น
                                การเดิมพันทั้งหมดจะถูกตัดสินตามรอบหรือวัตถุประสงค์ที่ระบุไว้โดยไม่คำนึงถึงข้อความอื่นใดในชื่อทางการตลาดหรือระยะเวลาในการเดิมพันเมื่อมีการวางเดิมพัน
                            </p>
                            <p>●หากจำนวนรอบหรือแผนที่ที่กำหนดไว้มีการเปลี่ยนแปลงหรือหากมีการเสนอราคาอย่างไม่ถูกต้องตามจำนวนรอบหรือแผนที่จากจำนวนที่กำหนดจริงเดิมพันบนขอบที่ชนะ
                                (รวมแฮนดิแคป) รอบรวม ​​/ แผนที่ถูกต้อง คะแนน ฯลฯ ถือเป็นโมฆะและเงินเดิมพันคืน ผู้ชนะของแผนที่และผู้เดิมพัน matchup
                                ชนะ</p>
                            <p>●หากแผนที่ใดไม่ได้เล่นหรือได้รับรางวัลให้กับผู้เล่นหรือทีมหนึ่งรายโดย walkover หรือค่าเริ่มต้นโดยไม่ต้องเล่นเริ่มมีการเดิมพันทั้งหมดในแผนที่นั้นและใน
                                matchup โดยรวมจะเป็นโมฆะและเงินเดิมพันจะได้รับการคืนเงิน การเดิมพันที่เกี่ยวข้องกับแผนที่ที่เล่นเท่านั้น แผนที่จะถือว่าเริ่มต้นทันทีที่นาฬิกาเกมเริ่มขึ้นหรือทีมหรือผู้เล่นเกมจะดำเนินการเกี่ยวกับเกมกับแผนที่นั้นรวมทั้งการหยิบขูดรีดและการซื้ออาวุธ</p>
                            <p>League of Legends</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวข้องกับเสาอาคารที่ถูกทำลายทั้งหมดจะถูกนับว่าถูกทำลายโดยทีมของฝ่ายตรงข้ามแม้ว่าจะมีการตีครั้งสุดท้ายจากเหล่าสมุน</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวกับตัวยับยั้งการยับยั้งการทำลายทั้งหมดจะถูกนับว่าถูกทำลายโดยทีมของฝ่ายตรงข้ามถึงแม้ว่าการตีครั้งสุดท้ายจะเป็นของ
                                minion ก็ตาม</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวข้องกับจำนวนของตัวยับยั้งที่ถูกทำลายแต่ละ 6 ตัวที่ได้รับการยับยั้งจะถูกนับเพียงครั้งเดียวแม้ว่ามันจะถูกทำลาย
                                respawns และถูกทำลายอีกครั้ง</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวข้องกับตัวยับยั้งต่อไปจะทำลายการยับยั้งตัวยับยั้งแต่ละครั้งจะนับแยกออกจากกันแม้ว่าจะมีการปนเปื้อนและกำลังถูกทำลายเป็นครั้งที่สองหรือต่อมาก็ตาม</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวข้องกับการฆ่า (รวมถึง "First Blood" ซึ่งใน League of Legends มีความหมายเหมือนกันกับการฆ่าครั้งแรกบนแผนที่)
                                การออกอากาศอย่างเป็นทางการหรือ API เกมถ้ามีให้เห็นได้ชัดเจนในการพิจารณาว่าการตายของ Champion นับเป็นการฆ่า .
                                ตัวอย่างเช่นเมื่อ Champion ถูกสังหารโดยความเสียหายจากหอคอยหรือสมุนโดยไม่ต้องมีส่วนร่วมของ Champion ศัตรูนี้อาจไม่ได้รับการจดทะเบียนเป็นการฆ่าในการออกอากาศซึ่งในกรณีนี้จะไม่ถือว่าเป็นการฆ่าเพื่อวัตถุประสงค์ในการยุติการเดิมพัน</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวข้องกับทีมต่อไปในการทำประตูหรือเฉพาะทีมที่ทำคะแนนได้มากที่สุดโดยเฉพาะอย่างยิ่งในกรณีที่มีการเสนอตัวเลือก
                                "ไม่ใช่" หรือ "ดึง" และเป็นผลลัพธ์ที่ชนะการเดิมพันในทีมใดทีมหนึ่งเป็นผู้แพ้ หากไม่มีการคัดเลือกและไม่มีทีมใดเป็นผู้ชนะการเดิมพันทั้งหมดในตลาดจะเป็นโมฆะและการคืนเงินเดิมพัน</p>
                            <p>●มังกรธาตุและมังกรผู้อาวุโสทั้งหมดจะถูกคำนวณในตลาดมังกร</p>
                            <p>●ในกรณีที่ทีมใดยอมจำนนเดิมพันจะยืนและถูกตัดสินดังนี้
                                <br /> I. สำหรับการเดิมพันที่เกี่ยวข้องกับผู้ชนะแผนที่ทีมที่ชนะคือทีมที่ไม่ยอมแพ้
                                <br /> ครั้งที่สอง เดิมพันที่เกี่ยวข้องกับมังกรยักษ์ใหญ่และฆ่าจะตัดสินตามสถานการณ์ในขณะที่มีการยอมจำนน
                                <br /> III การเดิมพันที่เกี่ยวข้องกับอาคารและตัวยับยั้งจะตัดสินตามที่ทีมที่ชนะได้ทำลายจำนวนเสาเพิ่มเติมและ / หรือตัวยับยั้งตามหลักวิชาที่ต้องการในการชนะเกมตามปกติจากตำแหน่งเมื่อมีการยอมจำนน
                                <br /> IV ตัวอย่างเช่นถ้าตัวยับยั้งใด ๆ ของทีมสูญเสียลงในขณะที่ยอมแพ้แล้วไม่มีการยับยั้งเพิ่มเติมจะถือว่าได้ถูกทำลาย
                                ถ้าไม่มีการยับยั้งของทีมสูญเสียลงแล้วทีมที่ชนะจะถือว่าได้ทำลายสารยับยั้งเพิ่มเติมอีกหนึ่งตัวโดยให้ความสำคัญกับตัวยับยั้งที่ถูกทำลายไปแล้วหากตัวยับยั้งดังกล่าวมีอยู่และได้กลับคืนสู่สภาพเดิม
                                <br /> V. ถ้าทีมที่ชนะเลิศได้ทำลายหอคอยชั้น 1 และอาคาร 1 ชั้นแล้วจะถือว่าเป็นอาคารที่ถูกทำลายอีกสามแห่ง (รวมเป็น 7
                                แห่ง) เพราะต้องทำลายหอคอยอย่างน้อยหนึ่งชั้น 3 และ สองอาคาร nexus ได้รับรางวัลเกมปกติจากตำแหน่งที่</p>
                            <p>​</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 19}>
                        <p>DOTA2</p>
                            <p>●สำหรับการเดิมพันที่เกี่ยวข้องกับเสาอาคารที่ถูกทำลายทั้งหมดจะถูกนับว่าถูกทำลายโดยทีมของฝ่ายตรงข้ามแม้ว่าจะมีการตีครั้งสุดท้ายจากเหล่าสมุน
                                <br /> ●สำหรับการวางเดิมพันที่เกี่ยวข้องกับค่ายทหารค่ายที่ถูกทำลายทั้งหมดจะถูกนับว่าถูกทำลายโดยทีมฝ่ายตรงข้ามแม้ว่าจะมีการตีครั้งสุดท้ายจากเหล่าสมุน
                                ค่ายทหารระยะไกลและระยะประชิดในแต่ละคู่นับเป็นค่ายทหารที่แยกต่างหากเพื่อให้แต่ละทีมมีทั้งหมดหกค่ายทหาร
                                <br /> ●สำหรับการเดิมพันที่เกี่ยวข้องกับการฆ่า (นอกเหนือจาก "First Blood") การออกอากาศอย่างเป็นทางการหรือ API ของเกมถ้ามีให้เห็นได้ชัดเจนในการพิจารณาว่าการตายของ
                                Champion นับเป็นการฆ่าหรือไม่ ตัวอย่างเช่นเมื่อ Champion ถูกสังหารโดยความเสียหายจากหอคอยหรือสมุนโดยไม่ต้องมีส่วนร่วมของ
                                Champion ศัตรูนี้อาจไม่ได้รับการจดทะเบียนเป็นการฆ่าในการออกอากาศซึ่งในกรณีนี้จะไม่ถือว่าเป็นการฆ่าเพื่อวัตถุประสงค์ในการยุติการเดิมพัน
                                <br /> ●สำหรับการเดิมพัน First Blood การออกอากาศหรือคะแนน API อย่างเป็นทางการต้องลงทะเบียนการฆ่าเป็น First Blood ในกรณีที่การฆ่าถูกปฏิเสธโดยเพื่อนร่วมทีมอาจไม่นับเป็น
                                First Blood (ไม่ว่าจะมีการลงทะเบียนเป็นรายการฆ่าในเคาน์เตอร์ฆ่าคนที่ออกอากาศ) ซึ่งในกรณีนี้จะไม่ถือว่าเป็น First
                                Blood เพื่อวัตถุประสงค์ในการระงับเดิมพัน เพื่อหลีกเลี่ยงข้อสงสัยตลาดการฆ่าทั้งหมดที่ไม่ใช่ "First Blood" จะถูกตัดสินตามเคาน์เตอร์ฆ่า
                                แต่การฆ่าที่ลงทะเบียนในเคาน์เตอร์ฆ่าจะนับเป็น First Blood เฉพาะเมื่อมีการประกาศเช่นนี้
                                <br /> ●สำหรับการเดิมพันบน Roshans ทีมที่ทำแต้มการตีครั้งสุดท้ายบน Roshan ตามที่กำหนดโดย API การออกอากาศหรือเกมถ้ามีจะถือได้ว่าเป็นการสังหาร
                                Roshan โดยไม่คำนึงถึงผู้เล่นที่เลือกพิทักษ์อมตะ
                                <br /> ●สำหรับการเดิมพันที่เกี่ยวข้องกับทีมต่อไปในการทำประตูหรือเฉพาะทีมที่ทำคะแนนได้มากที่สุดโดยเฉพาะอย่างยิ่งในกรณีที่มีการเสนอตัวเลือก
                                "ไม่ใช่" หรือ "ดึง" และเป็นผลลัพธ์ที่ชนะการเดิมพันในทีมใดทีมหนึ่งเป็นผู้แพ้ หากไม่มีการคัดเลือกและไม่มีทีมใดเป็นผู้ชนะการเดิมพันทั้งหมดในตลาดจะเป็นโมฆะและการคืนเงินเดิมพัน
                                <br /> ●ในกรณีที่ทีมใดยอมจำนนเดิมพันจะยืนและถูกตัดสินดังนี้
                                <br /> I. สำหรับการเดิมพันที่เกี่ยวข้องกับผู้ชนะแผนที่ทีมที่ชนะคือทีมที่ไม่ยอมแพ้
                                <br /> ครั้งที่สอง การเดิมพันที่เกี่ยวข้องกับ Roshans ค่ายทหารและการฆ่าจะตัดสินตามสถานการณ์ในขณะที่มีการยอมจำนน
                                <br /> III การเดิมพันที่เกี่ยวข้องกับเสาจะตัดสินราวกับว่าทีมที่ชนะได้ทำลายจำนวนที่ต่ำกว่าของอาคารเพิ่มเติมตามหลักวิชาที่ต้องการในการชนะเกมตามปกติจากตำแหน่งเมื่อมีการยอมจำนน
                                <br /> IV ตัวอย่างเช่นถ้าทีมที่ชนะได้ทำลายหอคอยชั้น 1 และอาคาร 1 ชั้นแล้วจะถือว่าได้ทำลายหอคอยอีก 3 แห่ง (รวมเจ็ดแห่ง)
                                เพราะต้องทำลายหอคอยอย่างน้อยหนึ่งชั้น 3 และ สองอาคารโบราณที่ได้รับรางวัลเกมปกติจากตำแหน่งที่</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 20}>
                            <p>Counter Strike: GO</p>
                            <p>●การเดิมพันแผนที่ส่วนใหญ่จะขึ้นอยู่กับจำนวนรอบที่กำหนด (โดยปกติจะดีที่สุด 30) ยกเว้นรอบพิเศษที่เล่นในกรณีที่มีการจับรางวัล
                                อย่างไรก็ตามหากผู้ชนะในแผนที่ได้รับการคัดเลือกโดยไม่ได้เลือก "วาด" ระบบจะตัดสินผลประโยชน์ของผู้ชนะโดยรวมของแผนที่รวมถึงเวลาพิเศษหากเล่น
                                <br /> ●ปืนกล: หมายถึงรอบแรกและสิบหกในแผนที่</p>
                        </div>
                    </div>
                    
               
                </Grid>
            </Grid>
            
        </div>
      );
    }
  }

  const mapStateToProps = (state) => {
    const { token } = state.auth;
    return {
        isAuthenticated: (token !== null && token !== undefined),
        error: state.auth.error,
        lang: state.language.lang,
        showAnnouncements: state.general.show_letou_announcements,
    }
}


BetRuleFourTh.propTypes = {
    classes: PropTypes.object.isRequired,
    callback: PropTypes.func,
};

export default withStyles(styles)(injectIntl(withRouter(connect(mapStateToProps, {
    show_letou_announcements
})(BetRuleFourTh))));