import React from 'react';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import { injectIntl } from 'react-intl';
import { withRouter } from 'react-router-dom';
import { connect } from 'react-redux';
import Typography from '@material-ui/core/Typography';

import Grid from '@material-ui/core/Grid';
import IconHeader from "../icon_header";
import InfoSelect from "../info_select";
import '../../css/help.css'

import {
    show_letou_announcements
} from '../../../actions';


const styles = theme => ({
   
    content : {
        display: 'flex',
        paddingRight: 400,
    },
    infoSelect : {
        paddingLeft: 300,
        display: 'flex',
        flexDirection: 'column',
    },
    aboutUsDetail : {
       fontSize: '14px',
    },
    helpCenterArticleColumn: {
        fontSize: '14px',
        listStyleType: 'none',
    }
})

export class FootballRules extends React.Component {
    
    getLabel(labelId) {
        const { formatMessage } = this.props.intl;
        return formatMessage({ id: labelId });
    }

    render() {
  
      const { classes } = this.props;
  
      return (
       
        <div className={classes.root}> 
            <IconHeader/>
            <Grid container className={classes.content}>
                <Grid item xs={5} className={classes.infoSelect}>
                    <InfoSelect/>
                </Grid>
            
                <Grid item xs={7} className={classes.detail}>
                    <div className="HelpCenterList">
                        <ul>
                            <li>
                                <a href="/for_member">บริการแก่สมาชิกใช้ >
                                    <i></i>
                                </a>
                            </li>
                            <li>
                                <a href="/for_member">กติกาเกมส์กีฬา >
                                    <i></i>
                                </a>
                            </li>
                        </ul>
                    </div>
                    <div id="HelperCenterDetail">
                    <h2>กฎเดิมพันฟุตบอล</h2>
                        <p>สำคัญ</p>
                        <p>※ทุกตลาด (ยกเว้นครึ่งเวลา, ครึ่งแรก, โอเวอร์ไทม์และการยิงลูกโทษ) เป็นระยะเวลาปกติเท่านั้น
                            <br /> ※หากการแข่งขันถูกขัดจังหวะและดำเนินการต่อภายใน 48 ชม. หลังจากการเตะเริ่มต้นการเดิมพันที่เปิดทั้งหมดจะตัดสินด้วยผลการแข่งขัน
                            มิเช่นนั้นการเดิมพันที่ยังไม่ได้กำหนดทั้งหมดถือเป็นโมฆะ
                            <br /> ※ปกติ 90 นาที: การแข่งขันขึ้นอยู่กับผลการแข่งขันเมื่อสิ้นสุดการแข่งขัน 90 นาทีตามที่กำหนดยกเว้นที่ระบุไว้เป็นอย่างอื่น
                            ซึ่งรวมถึงการบาดเจ็บใด ๆ หรือเวลาหยุดการแข่งขัน แต่ไม่รวมถึงเวลาพิเศษเวลาที่กำหนดสำหรับการยิงลูกจุดโทษหรือเป้าหมายสีทอง
                            <br
                            /> ※ บริษัท ให้ข้อมูล (เช่นพื้นดินที่เป็นกลาง, บัตรสีแดง, นาฬิกาจับเวลา, ข้อมูลทางสถิติ, วันที่เริ่ม, เป็นต้น) เป็นบริการและไม่รับผิดชอบใด
                            ๆ ลูกค้าเป็นผู้รับผิดชอบในการรับทราบข้อมูลที่ถูกต้องสำหรับการแข่งขันใด ๆ
                            <br /> ※สำหรับการเดิมพันแบบสดในระหว่างเกมเกี่ยวกับการดำเนินการที่ บริษัท ฯ ใช้ดุลพินิจ แต่เพียงผู้เดียวและใช้ดุลยพินิจโดยเด็ดขาดถือว่าเป็นอันตรายเมื่อคะแนนผลการปฏิบัติงานของทีมหรือผู้เล่นคนใดคนหนึ่งอาจได้รับผลกระทบ
                            หรือ "การเล่นที่อันตราย") บริษัท ขอสงวนสิทธิ์ในการระงับการยอมรับการเดิมพันและอาจยอมรับหรือปฏิเสธการเดิมพันหลังจากเล่นอันตราย
                            การดำเนินการอื่น ๆ ทั้งหมดในเกมถือว่าเป็นการเล่นที่ปลอดภัยและการเดิมพันจะดำเนินการต่อเพื่อรับการยอมรับ
                            <br /> ※สำหรับการวางเดิมพันแบบสดการวางเดิมพันจะได้รับอนุญาตภายใน 90 นาทีนอกเหนือจากเวลาการบาดเจ็บใด ๆ สำหรับเกมแบบเต็มเวลา
                            แต่ในช่วงห้านาทีที่ผ่านมาก่อนสิ้นนาทีแรก 85 นาทีหรือเวลาเล่นเกมปกติหลังจากเกม (ในเกมแล้วแต่ว่าใดที่ใช้ได้) การดำเนินการอื่นนอกเหนือจากที่กล่าวไว้ในส่วนนี้จะถือเป็น
                            Safe Play และทำให้เดิมพันที่รอดำเนินการทั้งหมดที่วางไว้อาจได้รับการพิจารณาเพื่อรับการยอมรับ: เล่นในหรือรอบบริเวณจุดโทษ
                            โทษ; และลูกฟรีคิกที่ บริษัท ถือว่าเป็นอันตราย (ความเป็นไปได้ของเป้าหมาย)
                            <br /> ※สำหรับการเดิมพันแบบสดการเดิมพันที่ค้างอยู่ทั้งหมดจะถูกปฏิเสธโดยอัตโนมัติในขณะที่ผู้ตัดสินสิ้นสุดการแข่งขันในครึ่งเวลาและ
                            / หรือเต็มเวลา</p>
                        <p>ตลาดใบเหลืองใบแดง</p>
                        <p>※ใบเหลืองนับเป็นไพ่ 1 ใบและใบแดงหรือสีเหลืองแดงเท่ากับ 2 จะไม่ถือว่าเป็นสีเหลืองที่ 2 สำหรับผู้เล่นคนใดคนหนึ่งซึ่งนำไปสู่ใบเหลืองใบเหลือง
                            เป็นผลให้ผู้เล่นคนหนึ่งไม่สามารถทำให้เกิดการ์ดได้มากกว่า 3 ใบ
                            <br /> ※การตัดสินจะทำตามหลักฐานที่มีอยู่ทั้งหมดของบัตรที่แสดงในระหว่างการเล่นปกติ 90 นาที
                            <br /> ※บัตรที่แสดงภายหลังการแข่งขันจะไม่ถูกพิจารณา
                            <br /> ※การ์ดสำหรับผู้เล่นที่ไม่ได้เป็นผู้เล่น (ผู้เล่นผู้จัดการทีมผู้เล่นที่อยู่ในม้านั่งที่ไม่ได้ถูกแทนที่) จะไม่ได้รับการพิจารณา</p>
                        <p>การนับแต้มใบเหลืองใบแดง</p>
                        <p>※ใบเหลืองนับเป็น 10 แต้มและใบแดงแดงหรือสีเหลืองเท่ากับ 25. ใบเหลืองที่ 2 สำหรับผู้เล่นคนใดคนหนึ่งซึ่งนำไปสู่ใบเหลืองใบเหลืองไม่ถือว่าเป็น
                            เป็นผลให้ผู้เล่นคนหนึ่งไม่สามารถทำให้มากกว่า 35 จุดการจอง
                            <br /> ※การชำระบัญชีจะทำตามหลักฐานที่มีอยู่ทั้งหมดสำหรับบัตรที่แสดงในระหว่างการเล่นปกติ 90 นาที
                            <br /> ※บัตรที่แสดงภายหลังการแข่งขันจะไม่ถูกพิจารณา
                            <br /> ※การ์ดสำหรับผู้เล่นที่ไม่ได้เป็นผู้เล่น (ผู้เล่นผู้จัดการทีมผู้เล่นที่อยู่ในม้านั่งที่ไม่ได้ถูกแทนที่) จะไม่ได้รับการพิจารณา</p>
                        <p>ตลาดลูกเตะมุม</p>
                        <p>※การได้รับคะแนนที่ได้รับ แต่ไม่ได้รับการพิจารณา</p>
                        <p>ประตูถัดถัดไป</p>
                        <p>※เป้าหมายของตัวเองจะไม่ได้รับการพิจารณาสำหรับเป้าหมายการชำระบัญชีเป้าหมายถัดไปและจะถูกเพิกเฉย
                            <br /> ※ผู้เล่นทุกคนที่เข้าร่วมการแข่งขันนับตั้งแต่เตะหรือก่อนหน้านั้นถือว่าเป็นนักวิ่ง
                            <br /> ※ผู้เล่นทุกคนที่กำลังเข้าร่วมอยู่ในรายการ หากด้วยเหตุผลใดก็ตามที่ผู้เล่นที่ไม่ได้ลงทะเบียนได้ทำประตูจะถือว่าเดิมพันทั้งหมดของผู้เล่นที่ลงทะเบียนอยู่
                            <br
                            /> ※ตลาดจะได้รับการตัดสินโดยอ้างอิงจากโทรทัศน์แทรกและสถิติที่จัดโดยสมาคมสื่อมวลชนยกเว้นกรณีที่มีหลักฐานชัดเจนว่าสถิติเหล่านี้ไม่ถูกต้อง
                        </p>
                        <p>ช่วงเวลาตลาด</p>
                        <p>※ตลาดจะได้รับการตัดสินตามเวลาเป้าหมายที่ทางทีวีประกาศ หากไม่สามารถใช้งานได้พิจารณาเวลาตามนาฬิกาจับคู่
                            <br /> ※การตัดสินเดิมพันจะขึ้นอยู่กับเวลาที่ลูกบอลข้ามเส้นและไม่ใช่เวลาเตะ
                        </p>
                        <p>กฎการชำระบัญชีและการยกเลิก</p>
                        <p>※หากตลาดยังคงเปิดขึ้นเมื่อเหตุการณ์ต่อไปนี้เกิดขึ้นแล้ว: เป้าหมายบัตรสีแดงหรือสีเหลืองแดงและการลงโทษเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                            <br
                            /> ※หากเปิดตลาดด้วยบัตรสีแดงที่ขาดหายไปหรือไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                            <br /> ※หากมีการเสนอราคาด้วยเวลาการแข่งขันที่ไม่ถูกต้อง (มากกว่า 5 นาที) เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                            <br /> ※หากมีการป้อนคะแนนที่ไม่ถูกต้องตลาดทั้งหมดจะถูกยกเลิกไปเมื่อมีการแสดงคะแนนที่ไม่ถูกต้อง
                            <br /> ※หากการแข่งขันถูกขัดจังหวะหรือเลื่อนออกไปและไม่สามารถดำเนินการต่อได้ภายใน 48 ชั่วโมงหลังจากวันที่เริ่มต้นการเดิมพันจะถือเป็นโมฆะ
                            <br
                            /> ※หากชื่อหรือหมวดหมู่ของทีมแสดงไม่ถูกต้องเราขอสงวนสิทธิ์ในการยกเลิกการเดิมพัน
                        </p>
                    </div>
                </Grid>
            </Grid>
            
        </div>
      );
    }
  }



  
  const mapStateToProps = (state) => {
    const { token } = state.auth;
    return {
        isAuthenticated: (token !== null && token !== undefined),
        error: state.auth.error,
        lang: state.language.lang,
        showAnnouncements: state.general.show_letou_announcements,
    }
}


FootballRules.propTypes = {
    classes: PropTypes.object.isRequired,
    callback: PropTypes.func,
};

export default withStyles(styles)(injectIntl(withRouter(connect(mapStateToProps, {
    show_letou_announcements
})(FootballRules))));