import React from 'react';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import { injectIntl } from 'react-intl';
import { withRouter } from 'react-router-dom';
import { connect } from 'react-redux';

import Grid from '@material-ui/core/Grid';
import IconHeader from "../icon_header";
import '../../css/help.css'

import {
    show_letou_announcements
} from '../../../actions';


const styles = theme => ({
   
    content : {
        display: 'flex',
        paddingRight: 400,
    },
    infoSelect : {
        paddingLeft: 300,
        display: 'flex',
        flexDirection: 'column',
    },
    aboutUsDetail : {
       fontSize: '14px',
    },
    helpCenterArticleColumn: {
        fontSize: '14px',
        listStyleType: 'none',
    }
})

export class LotteryRuleOneTh extends React.Component {
    constructor(props) {
        super(props);
        
        this.state = {
          hide: true,
          current: 1
        }
    }
    getLabel(labelId) {
        const { formatMessage } = this.props.intl;
        return formatMessage({ id: labelId });
    }

    onClick(index) {
        this.setState({
          hide: false,
          current: index
          
        })
      }
    
    render() {
  
      const { classes } = this.props;
      
      
      return (
       
        <div className={classes.root}> 
            <IconHeader/>
            <Grid container className={classes.content}>
                <Grid item xs={5} className={classes.infoSelect}>
                <div className="HelpCenterLeftNav">
                            <ul>
                                <li>
                                    <a href="/th/for_member">{this.getLabel('for-member')}</a>
                                </li>
                                <li>
                                    <a href="/th/for_partner">{this.getLabel('for-partner')}</a>
                                </li>
                            </ul>
                        </div>
                </Grid>
            
                <Grid item xs={7} className={classes.detail}>
                    <div className="HelpCenterList">
                        <ul>
                            <li>
                                <a href="/th/for_member">บริการแก่สมาชิกใช้  >
                                    <i></i>
                                </a>
                            </li>
                            <li>
                                <a href="/th/for_member">กติกาการเดิมพันล็อตเตอรี >
                                    <i></i>
                                </a>
                            </li>
                        </ul>
                    </div>
                    <div className="HelpCenterSmNav">
                        <ul>
                            <li className={this.state.current === 1 ? "Active" : ""} onClick={this.onClick.bind(this,1)} >
                                <a>Glossary</a>
                            </li>
                            <li className={this.state.current === 2 ? "Active" : ""} onClick={this.onClick.bind(this,2)} >
                                <a>ฮ่องกง ล็อตโต้</a>
                            </li>
                            <li className={this.state.current === 3 ? "Active" : ""} onClick={this.onClick.bind(this,3)} >
                                <a>ล็อตโต้สิงค์โปร</a>
                            </li>
                            <li className={this.state.current === 4 ? "Active" : ""} onClick={this.onClick.bind(this,4)} >
                                <a>ล็อตโต้จีน</a>
                            </li>
                            <li className={this.state.current === 5 ? "Active" : ""} onClick={this.onClick.bind(this,5)} >
                                <a>ล็อตโต้นิวซีแลนด์</a>
                            </li>
                            <li className={this.state.current === 6 ? "Active" : ""} onClick={this.onClick.bind(this,6)} >
                                <a>ล็อตโต้เยอรมัน</a>
                            </li>
                            <li className={this.state.current === 7 ? "Active" : ""} onClick={this.onClick.bind(this,7)} >
                                <a>ล็อตโต้อังกฤษ</a>
                            </li>
                            <li className={this.state.current === 8 ? "Active" : ""} onClick={this.onClick.bind(this,8)} >
                                <a>ล็อตโต้สเปน</a>
                            </li>
                            <li className={this.state.current === 9 ? "Active" : ""} onClick={this.onClick.bind(this,9)} >
                                <a>ล็อตโต้แอฟริกาใต้</a>
                            </li>
                            <li className={this.state.current === 10 ? "Active" : ""} onClick={this.onClick.bind(this,10)} >
                                <a>ล็อตโต้แคนนาดา</a>
                            </li>
                            <li className={this.state.current === 11 ? "Active" : ""} onClick={this.onClick.bind(this,11)} >
                                <a>อเมริกัน ล็อตโต้</a>
                            </li>
                        </ul>
                        <div className="ClearBoth"></div>
                    </div>
                    {/* <!-- please only edit HelperCenterDetail's contain --> */}
                    <div id="HelperCenterDetail">
                        <div className="centerDetail" hidden={this.state.current !== 1} >
                            <h2>Glossary</h2>
                            <h1>【หมายเลขพิเศษ】</h1>
                            <p>
                                หมายเลขพิเศษ เป็นวิธีการเล่นล็อตเตอรี่โดยมี 7 ลูกที่สุ่มจากชุดตัวเลข 49 ตัวซึ่งมีตั้งแต่ 1 ถึง 49 ผลการสุ่มตัวเลขจะเรียงตามลำดับจากลูกที่
                                1 ถึงลูกที่ 6 โดยมีลูกที่ 7 ที่เรียกกันว่า หมายเลขพิเศษ . ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันจะเหมือนกันกับหมายเลขที่คุณเดิมพัน.</p>
                            <h1>【หมายเลขทั่วไป/พิเศษ】</h1>
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6 (ไม่รวมกับหมายเลขพิเศษ).
                                บอลหมายเลขแรกเรียกว่า "normal 1 Special" และบอลหมายเลขลำดับที่สองเรียกว่า " normal 2 Special " และส่วนที่เหลืออาจอนุมานได้โดยการเปรียบเทียบ
                                .
                            </p>
                            <h1>【หมายเลขทั่วไป】</h1>
                            <p>
                                ผู้เล่นสามารถวางเดิมพันบนหมายเลขใด ๆ จากชุดของ 49 หมายเลขตั้งแต่ 1 ถึง 49. ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน
                                ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6 </p>
                            <h1>【เดิมพันแบบ2ทาง】</h1>
                            <p>การเล่นแบบ 2 ทางจะเป็นข้อกำหนดทั่วไปสำหรับการเดิมพันที่ ใหญ่/เล็ก/คี่/คู่</p>
                            <h1>【หมายเลขธรรมดา 1-6 】
                            </h1>
                            <p>ขั้นตอนการเล่นนี้จะเป็นการเดิมพันตามลำดับหมายเลขจากบอล 1 ถึงบอล 6 ที่นำมาใช้กับรูปแบบการเดิมพันแบบ "2 ทาง",ผู้เล่นจะชนะเดิมพันได้ก็ต่อเมื่อมีหมายเลขเดิมพันตรงกับหมายเลขที่ออกรางวัล.</p>
                            <h1>【เดิมพันแบบคอมโบ】</h1>
                            <p>
                                ผู้เล่นสามารถวางเดิมพันบอลหมายเลขได้มากกว่า 2 หมายเลข แบบ 2 hit all (แทง2เข้าหมด) และ 3 hit all(แทง3เข้าหมด)</p>
                            <h1>【แต้ม】</h1>
                            <p>ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม</p>
                            <h1>【สี】</h1>
                            <p>ผู้เล่นจะวางเดิมพันกับสี ที่มีตัวเลขเฉพาะต่าง ๆ</p>
                            <h1>【จักรราศี 】
                            </h1>
                            <p>จักรราศีเป็นวิธีการเล่นที่ใช้จักรราศีของปีปัจจุบันเพื่อให้สอดคล้องกับบอลหมายเลขที่ 1 ถึงลูกที่ 49 ถ้าปีปัจจุบันเป็น "งู"
                                มันจะเริ่มต้นจากปีงูและตามลำดับ 12 จักรราศี
                            </p>
                            <h1>【หมายเลขหลักสิบ/หลักหน่วย 】
                            </h1>
                            <p>หมายเลขในล็อตโต้มีตั้งแต่ 1 ถึง 49. ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3
                                หรือ 4. หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9.</p>
                            <h1>【การสุ่มจับหมายเลข】</h1>
                            <p>
                                ล็อตเตอรี่มีตัวเลขไว้สำหรับการจับผลฉลาก. แต่สำหรับบางประเทศที่ไม่มีการจับหมายเลข,วันที่ปัจจุบันจะใช้เป็นการจับหมายเลขแทน.</p>
                            <h1>【การคืนเงิน】</h1>
                            <p>อัตราการคืน= จำนวนเดิมพัน Odds (แล้วแต่อัตราค่าน้ำนั้นๆ), จะถูกคำนวนโดยฝ่ายจัดการความเสี่ยง.</p>
                            <h1>【อัตราแพ้/ชนะ】</h1>
                            <p>จะแสดงจำนวนเงินที่ชนะ / แพ้หลังจากการชำระบัญชีที่ผู้เล่นได้เดิมพันในล็อตเตอรี่ปัจจุบัน หากผลที่ได้คือการสูญเสียผู้เล่นจะเสียเงินเดิมพันและจะแสดง
                                ผลลบ หากผลที่ได้คือชนะจะแสดงเงินเดิมพันและผลกำไร] .
                            </p>
                            <h1>【Random Combo】</h1>
                            <p>การเล่นคอมโบแบบสุ่มเป็นหนึ่งในวิธีการเล่นของการเดิมพันแบบผสม เดิมพันแบบสุ่มจะสร้างชุดค่าผสมที่เป็นไปได้ทั้งหมดโดยอัตโนมัติจากตัวเลขที่ผู้เล่นเลือก
                                .
                            </p>
                            <h1>【Special Combo 1】</h1>
                            <p>
                                คำสั่งคอมโบพิเศษ 1 เป็นอีกหนึ่งวิธีการเล่นของคำสั่งผสม ผู้เล่นเลือกตัวเลขในแต่ละคอลัมน์และใช้ตัวเลขเหล่านี้รวมกันเป็นกลุ่ม
                                แต่ตัวเลขในคอลัมน์เดียวกันจะไม่ถูกรวมในกลุ่มเดียวกัน.</p>
                            <h1>【Special Combo 2】</h1>
                            <p>
                                คำสั่งผสมพิเศษ 2 เป็นอีกวิธีหนึ่งในการเลือกคำสั่งผสม ผู้เล่นจะเลือก "Special Number" และ "Random Number" และสร้างชุดค่าผสมตาม
                                "Special Number" ตัวอย่าง: ผู้เล่นเลือกหมายเลข 1 เป็นหมายเลขพิเศษและเลือก 2, 3 และ 4 เป็นตัวเลขสุ่ม การรวมกันนี้สามารถทำได้เฉพาะ
                                [1,2], [1,3] และ [1,4] ถ้าการเดิมพันของผู้เล่นแทงเข้า 2 ฮิต</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 2}>
                        <h2>ฮ่องกง ล็อตโต้</h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>ผลของหมายเลขปกติจะอยู่ที่บอล1-6และหมายเลขพิเศษจะอยู่ที่บอลหมายเลข7 ผู้เล่นจะชนะการเดิมพัน ก็ต่อเมื่อหมายเลขพิเศษที่ออกมา
                                ตรงกันกับหมายเลขที่ผู้เล่นได้วางเดิมพันเอาไว้.</p>
                            &nbsp;
                            <h1>【หมายเลขธรรมดา/พิเศษ 】
                            </h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่เลือกตรงกันกับเลขใดก็ได้จาก บอล 1 ถึงบอล 6</p>
                            &nbsp;
                            <h1>【การเดิมพันแบบคอมโบ้ 】
                            </h1>
                            &nbsp; •
                            <p>แทงเข้าหมด4ตัว(ฮิต4)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ จำนวนหมายเลขที่ผู้เล่นเลือกทั้งหมด 4 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ) •
                                <br />แทงเข้าหมด3ตัว(ฮิต3)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br />แทงเข้า2จาก3： •
                                <br /> √ แทงเข้า 2 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                •
                                <br /> √แทงเข้า 3 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br />แทงเข้าหมด2ตัว(ฮิต2)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลข 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ).
                                <br />แทงเข้า 2 หมายเลขพิเศษ
                                <br /> √แทงเข้า 2 : หมายเลขที่วางเดิมพันทั้งหมดเข้า 2 ตัวในการออกสลากหมายเลขธรรมดา .
                                <br /> √แทงหมายเลขพิเศษ : หมายเลขที่วางเดิมพันทั้งหมด ตรงกันกับหมายเลขธรรมดา 1ตัว และ หมายเลขพิเศษ 1 ตัว ที่ออกสลาก •
                                <br /> พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้
                            </p>
                            &nbsp;
                            <h1>【จักรราศี】</h1>
                            &nbsp;
                            <p>
                                จักรราศี คือ ขั้นต้อนการเล่นที่ใช้จักรราศีในปีปัจจุบันตรงกับหมายเลขจากบอล 1 ถึง บอลหมายเลข 49 •
                                <br />จักรราศีธรรมดา：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หนึ่งหมายเลขที่วางเดิมพันตรงกับหมายเลขที่ออกสลากตรงกันกับเลขของ จักรราศี
                                (ไม่รวมหมายเลขพิเศษ) ถ้าหมายเลขที่เดิมพันมีมากกว่า 1 หมายเลข ในจักรราศี โบนัส จะคิดเพิ่มให้อัตโนมัติ •
                                <br />จักรราศีพิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ผลของหมายเลขที่เลือกออกสลากในตำแหน่งเฉพาะในการเลือกหมายเลขในจักรราศี •
                                <br />หนึ่งจักรราศี：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ หมายเลขภายใต้จักรราศี ปรากฏอยู่ในโถบอลต่าง ๆ จาก โถบอลที่ 1 ถึงโถบอลที่ 6
                                ซึ่งจะไม่รวมกันกับบอลพิเศษแต่อย่างใด
                            </p>
                            &nbsp;
                            <h1>【การเดิมพันแบบ2ทาง】</h1>
                            &nbsp; •
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> -คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ" •
                                <br
                                /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมใหญ่ / เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลาก ทั้งหลักสิบและหลักหน่วย ถ้าผลรวมเท่ากับหรือมากกว่า
                                7 ก็จะเป็น "รวมใหญ่" ถ้าผลรวมเท่ากับหรือน้อยกว่า 6 จะเป็น รวมเล็ก; ถ้าตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -ผลรวมคี่ / คู่：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลากทั้งหลักสิบหลักหน่วย ถ้าผลรวมเป็นเลขคู่ มันก็จะออกเป็น
                                รวมคู่ ถ้าผลรวมเป็นเลขคี่ ก็จะออกมาเป็นรวมคี่ แต่ถ้าตัวเลขที่ออกสลากเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมของผลลัพธ์ใหญ่ / เล็ก：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกในขณะนั้น ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว
                                และ หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์ใหญ่ /เล็ก ซึ่งถ้าผลรวมกันเท่ากับหรือมากกว่า 175
                                จะเป็นผลรวมของผลลัพธ์ใหญ่ และถ้าผลรวมเท่ากับหรือน้อยกว่า 174 ก็จะเป็นผลรวมของผลลัพธฺ์ เล็ก •
                                <br /> - ผลรวมของผลลัพธ์คี่ / คู่：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกปัจจุบัน ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว และ
                                หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์คี่ / คู่ ถ้าผลรวมเป็นเลขคู่ก็จะเป็นผลรวมของผลลัพธ์
                                คู่; ถ้าผลรวมเป็นเลขคี่ก็จะเป็น ผลรวมของผลลัพธ์คี่
                            </p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป1ถึง6】</h1>
                            &nbsp;
                            <p>ขั้นตอนการเล่นนี้จะเป็นการเดิมพันตามลำดับหมายเลขจากบอล 1 ถึงบอล 6 ที่นำมาใช้กับรูปแบบการเดิมพันแบบ "2 ทาง", "สี", "หลักหน่วย"
                                และ "จักรราศี" •
                                <br /> - ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น
                                "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น 49 ผลจะเป็น "เสมอ" •
                                <br /> - คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ"
                                <br /> -สี：ผู้เล่นจะชนะเงินเดิมพันก็ต่อเมื่อ ผู้เล่นเดินพันตรงกับสีของตำแหน่งสีของลูกบอลที่ระบุไว้ • แดง：01,02,07,08,12,13,18,19,23,24,29,30,34,35,40,45,46
                                • น้ำเงิน：03,04,09,10,14,15,20,25,26,31,36,37,41,42,47,48 • เขียว：05,06,11,16,17,21,22,27,28,32,33,38,39,43,44,49 • •
                                <br /> - ผลรวม ใหญ่/เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับการรวมของตัวเลขหลักสิบและหลักหน่วยที่ออกสลาก ถ้าผลรวมออกมาเท่ากับหรือมากกว่า
                                7 จะออกมาเป็น "ผลรวมใหญ่" ถ้าผลรวมออกมาเท่ากับหรือน้อยกว่า 6 จะออกมาเป็น "ผลรวมเล็ก" ถ้าตัวเลขที่ออกมาเป็น 49 จะถือว่า
                                "เสมอ" •
                                <br /> - เลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นเลขจักรราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นจักรราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ"
                            </p>
                            &nbsp;
                            <h1>【สี】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะวางเดิมพันกับสี ที่มีตัวเลขเฉพาะต่าง ๆ. • แดง：01,02,07,08,12,13,18,19,23,24,29,30,34,35,40,45,46 • น้ำเงิน：03,04,09,10,14,15,20,25,26,31,36,37,41,42,47,48
                                • เขียว：05,06,11,16,17,21,22,27,28,32,33,38,39,43,44,49 • แดงใหญ่：29,30,34,35,40,45,46 • แดงเล็ก：01,02,07,08,12,13,18,19,23,24
                                • แดงคู่：01,07,13,19,23,29,35,45 • แดงคู่：02,08,12,18,24,30,34,40,46 • น้ำเงินใหญ่：25,26,31,36,37,41,42,47,48 • น้ำเงินเล็ก：03,04,09,10,14,15,20
                                • น้ำเงินคี่：03,09,15,25,31,37,41,47 • น้ำเงินคู่：04,10,14,20,26,36,42,48 • เขียวใหญ่：27,28,32,33,38,39,43,44 • เขียวเล็ก：05,06,11,16,17,21,22
                                • เขียวคี่：05,11,17,21,27,33,39,43 • เขียวคู่：06,16,22,28,32,38,44 • แดงใหญ่คี่：29,35,45 • แดงใหญ่คู่：30,34,40,46 • แดงเล็กคี่：01,07,13,19,23
                                • แดงเล็กคู่：02,08,12,18,24 • น้ำเงินใหญ่คี่：25,31,37,41,47 • น้ำเงินใหญ่คู่：26,36,42,48 • น้ำเงินเล็กคี่：03,09,15 •
                                น้ำเงินเล็กคู่：04,10,14,20 • เขียวใหญ่คี่：27,33,39,43 • เขียวใหญ่คู่：28,32,38,44 • เขียวเล็กคี่：05,11,17,21 • เขียวเล็กคู่：06,16,22
                                &nbsp;
                                <h1>【หมายเลขหลักสิบ/หลักหน่วย 】
                                </h1>
                                &nbsp; •
                                <p>-หลักสิบ：ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3 หรือ 4 •
                                    <br /> -หลักหน่วย：หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9 •
                                    <br /> -หลักสิบของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักสิบของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                    •
                                    <br /> -หลักหน่วยของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักหน่วยของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                    •
                                    <br /> หลักหน่วยของหมายเลขธรรมดา/พิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อผู้เล่นเดิมพันที่ ตัวเลขหลักหน่วยของหมายเลขใด ๆ ก็ได้
                                    ไม่ว่าจะเป็นหมายเลขธรรมดา หรือ หมายเลขพิเศษ ที่ตรงกับเลขที่ออกสลาก
                                </p>
                                &nbsp;
                                <h1>【แต้ม】</h1>
                                &nbsp;
                                <p> ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                    6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม </p>
                                    </p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 3}>
                        <h2>ล็อตโต้สิงค์โปร</h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน.</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            &nbsp;
                            <h1>【การเดิมพันแบบคอมโบ】</h1>
                            &nbsp;
                            <p>- แทงเข้าหมด4ตัว(ฮิต4)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ จำนวนหมายเลขที่ผู้เล่นเลือกทั้งหมด 4 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้าหมด3ตัว(ฮิต3)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> แทงเข้า2จาก3：
                                <br /> แทงเข้า2จาก2： แทงเข้า 2 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> √ แทงเข้า 3 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> - แทงเข้าหมด2ตัว(ฮิต2)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลข 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้า 2 หมายเลข：
                                <br /> √ แทงเข้า 2 : หมายเลขที่วางเดิมพันทั้งหมดเข้า 2 ตัวในการออกสลากหมายเลขธรรมดา . •
                                <br /> √แทงหมายเลขพิเศษ : หมายเลขที่วางเดิมพันทั้งหมด ตรงกันกับหมายเลขธรรมดา 1ตัว และ หมายเลขพิเศษ 1 ตัว ที่ออกสลาก •
                                <br /> -พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้
                            </p>
                            &nbsp;
                            <h1>【แบบราศี】</h1>
                            &nbsp;
                            <p> แบบราศี คือ ขั้นต้อนการเล่นที่ใช้ราศีในปีปัจจุบันตรงกับหมายเลขจากบอล 1 ถึง บอลหมายเลข 49 <br />ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หนึ่งหมายเลขที่วางเดิมพันตรงกับหมายเลขที่ออกสลากตรงกันกับเลขของ จักรราศี (ไม่รวมหมายเลขพิเศษ)
                            ถ้าหมายเลขที่เดิมพันมีมากกว่า 1 หมายเลข ในจักรราศี โบนัส จะคิดเพิ่มให้อัตโนมัติ
                            <br />แบบราศีพิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ผลของหมายเลขที่เลือกออกสลากในตำแหน่งเฉพาะในการเลือกหมายเลขในจราศี
                            <br />แบบหนึ่งราศี : ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ หมายเลขภายใต้จักรราศี ปรากฏอยู่ในโถบอลต่าง ๆ จาก โถบอลที่ 1 ถึงโถบอลที่ 6 ซึ่งจะไม่รวมกันกับบอลพิเศษแต่อย่างใด
                            </p>
                            &nbsp;
                            <h1>【การเดิมพันแบบสองทาง】</h1>
                            &nbsp; •
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> - คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ" •
                                <br
                                /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -ผลรวมใหญ่ / เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลาก ทั้งหลักสิบและหลักหน่วย ถ้าผลรวมเท่ากับหรือมากกว่า
                                7 ก็จะเป็น "รวมใหญ่" ถ้าผลรวมเท่ากับหรือน้อยกว่า 6 จะเป็น รวมเล็ก; ถ้าตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมคี่ / คู่：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลากทั้งหลักสิบหลักหน่วย ถ้าผลรวมเป็นเลขคู่ มันก็จะออกเป็น
                                รวมคู่ ถ้าผลรวมเป็นเลขคี่ ก็จะออกมาเป็นรวมคี่ แต่ถ้าตัวเลขที่ออกสลากเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมของผลลัพธ์ใหญ่ / เล็ก：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกในขณะนั้น ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว
                                และ หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์ใหญ่ /เล็ก ซึ่งถ้าผลรวมกันเท่ากับหรือมากกว่า 175
                                จะเป็นผลรวมของผลลัพธ์ใหญ่ และถ้าผลรวมเท่ากับหรือน้อยกว่า 174 ก็จะเป็นผลรวมของผลลัพธฺ์ เล็ก •
                                <br /> - ผลรวมของผลลัพธ์คี่ / คู่：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกปัจจุบัน ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว และ
                                หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์คี่ / คู่ ถ้าผลรวมเป็นเลขคู่ก็จะเป็นผลรวมของผลลัพธ์
                                คู่; ถ้าผลรวมเป็นเลขคี่ก็จะเป็น ผลรวมของผลลัพธ์คี่
                            </p>
                            &nbsp;
                            <h1>【หมายเลขหลักสิบ/หลักหน่วย 】
                            </h1>
                            &nbsp; •
                            <p>-หลักสิบ：ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3 หรือ 4 . •
                                <br /> - หลักหน่วย：หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9 •
                                <br /> -หลักสิบของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักสิบของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> - หลักหน่วยของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักหน่วยของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> หลักหน่วยของหมายเลขธรรมดา/พิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อผู้เล่นเดิมพันที่ ตัวเลขหลักหน่วยของหมายเลขใด ๆ ก็ได้ ไม่ว่าจะเป็นหมายเลขธรรมดา
                                หรือ หมายเลขพิเศษ ที่ตรงกับเลขที่ออกสลาก
                            </p>
                            &nbsp;
                            <h1>【แต้ม】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 4}>
                        <h2>ล็อตโต้จีน</h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>
                                ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน.</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 7 .
                            </p>
                            &nbsp;
                            <h1>【แบบ2ทาง】</h1>
                            &nbsp;
                            <p>แบบ2ทาง ในการเลือกเล่น ใหญ่/เล็ก/คี่/คู่.
                                <br /> - ใหญ่/เล็ก：สำหรับกลุ่มหมายเลขที่เท่ากับหรือมากกว่า16, เรียกว่า ""ใหญ่;"" สำหรับกลุ่มหมายเลขที่ต่ำกว่าหรือเท่ากับ15เรียกว่า""เล็ก."".
                                <br /> - คี่/คู่： ผลลัพธ์จะพิจารณาจากจำนวนที่เป็นเลขคี่หรือคู่
                                <br /> - หมายเลขหลักหน่วยใหญ่/เล็ก ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" </p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 5}>
                        <h2>ล็อตโต้นิวซีแลนด์</h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            &nbsp;
                            <h1>【แบบสองทาง】</h1>
                            &nbsp;
                            <p>แบบ2ทาง ในการเลือกเล่น ใหญ่/เล็ก/คี่/คู่.
                                <br />ใหญ่/เล็ก：สำหรับกลุ่มหมายเลขที่เท่ากับหรือมากกว่า21, เรียกว่า ""ใหญ่;"" สำหรับกลุ่มหมายเลขที่ต่ำกว่าหรือเท่ากับ20เรียกว่า""เล็ก.""
                                <br /> - ผลลัพธ์จะพิจารณาจากจำนวนที่เป็นเลขคี่หรือคู่
                                <br /> - มายเลขหลักหน่วยใหญ่/เล็ก ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" </p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 6}>
                        <h2>ล็อตโต้เยอรมัน</h2>
                            <h1>【หมายเลขพิเศษ】</h1>
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน</p>
                            <h1>【Normal Number】</h1>
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 7}>
                        <h2> ล็อตโต้อังกฤษ </h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน.</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            <h1>【การเดิมพันแบบคอมโบ】</h1>
                            &nbsp;
                            <p>- แทงเข้าหมด4ตัว(ฮิต4)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ จำนวนหมายเลขที่ผู้เล่นเลือกทั้งหมด 4 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้าหมด3ตัว(ฮิต3)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> แทงเข้า2จาก3：
                                <br /> แทงเข้า2จาก2： แทงเข้า 2 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> √ แทงเข้า 3 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> - แทงเข้าหมด2ตัว(ฮิต2)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลข 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้า 2 หมายเลข：
                                <br /> √ แทงเข้า 2 : หมายเลขที่วางเดิมพันทั้งหมดเข้า 2 ตัวในการออกสลากหมายเลขธรรมดา . •
                                <br /> √แทงหมายเลขพิเศษ : หมายเลขที่วางเดิมพันทั้งหมด ตรงกันกับหมายเลขธรรมดา 1ตัว และ หมายเลขพิเศษ 1 ตัว ที่ออกสลาก •
                                <br /> -พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้
                            </p>
                            &nbsp;
                            <h1>【แบบราศี】</h1>
                            &nbsp;
                            <p> แบบราศี คือ ขั้นต้อนการเล่นที่ใช้ราศีในปีปัจจุบันตรงกับหมายเลขจากบอล 1 ถึง บอลหมายเลข 49 <br />ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หนึ่งหมายเลขที่วางเดิมพันตรงกับหมายเลขที่ออกสลากตรงกันกับเลขของ จักรราศี (ไม่รวมหมายเลขพิเศษ)
                            ถ้าหมายเลขที่เดิมพันมีมากกว่า 1 หมายเลข ในจักรราศี โบนัส จะคิดเพิ่มให้อัตโนมัติ
                            <br />แบบราศีพิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ผลของหมายเลขที่เลือกออกสลากในตำแหน่งเฉพาะในการเลือกหมายเลขในจราศี
                            <br />แบบหนึ่งราศี : ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ หมายเลขภายใต้จักรราศี ปรากฏอยู่ในโถบอลต่าง ๆ จาก โถบอลที่ 1 ถึงโถบอลที่ 6 ซึ่งจะไม่รวมกันกับบอลพิเศษแต่อย่างใด
                            </p>
                            &nbsp;
                            <h1>【การเดิมพันแบบสองทาง】</h1>
                            &nbsp; •
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> - คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ" •
                                <br
                                /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -ผลรวมใหญ่ / เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลาก ทั้งหลักสิบและหลักหน่วย ถ้าผลรวมเท่ากับหรือมากกว่า
                                7 ก็จะเป็น "รวมใหญ่" ถ้าผลรวมเท่ากับหรือน้อยกว่า 6 จะเป็น รวมเล็ก; ถ้าตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมคี่ / คู่：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลากทั้งหลักสิบหลักหน่วย ถ้าผลรวมเป็นเลขคู่ มันก็จะออกเป็น
                                รวมคู่ ถ้าผลรวมเป็นเลขคี่ ก็จะออกมาเป็นรวมคี่ แต่ถ้าตัวเลขที่ออกสลากเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมของผลลัพธ์ใหญ่ / เล็ก：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกในขณะนั้น ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว
                                และ หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์ใหญ่ /เล็ก ซึ่งถ้าผลรวมกันเท่ากับหรือมากกว่า 175
                                จะเป็นผลรวมของผลลัพธ์ใหญ่ และถ้าผลรวมเท่ากับหรือน้อยกว่า 174 ก็จะเป็นผลรวมของผลลัพธฺ์ เล็ก •
                                <br /> - ผลรวมของผลลัพธ์คี่ / คู่：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกปัจจุบัน ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว และ
                                หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์คี่ / คู่ ถ้าผลรวมเป็นเลขคู่ก็จะเป็นผลรวมของผลลัพธ์
                                คู่; ถ้าผลรวมเป็นเลขคี่ก็จะเป็น ผลรวมของผลลัพธ์คี่
                            </p>
                            &nbsp;
                            <h1>【หมายเลขหลักสิบ/หลักหน่วย 】
                            </h1>
                            &nbsp; •
                            <p>-หลักสิบ：ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3 หรือ 4 . •
                                <br /> - หลักหน่วย：หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9 •
                                <br /> -หลักสิบของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักสิบของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> - หลักหน่วยของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักหน่วยของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> หลักหน่วยของหมายเลขธรรมดา/พิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อผู้เล่นเดิมพันที่ ตัวเลขหลักหน่วยของหมายเลขใด ๆ ก็ได้ ไม่ว่าจะเป็นหมายเลขธรรมดา
                                หรือ หมายเลขพิเศษ ที่ตรงกับเลขที่ออกสลาก
                            </p>
                            &nbsp;
                            <h1>【แต้ม】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 8}>
                        <h2>ล็อตโต้สเปน</h2>
                            <h1>【หมายเลขพิเศษ】</h1>
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน.</p>
                            <h1>【หมายเลขทั่วไป】</h1>
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            <h1>【การเดิมพันแบบคอมโบ】</h1>
                            <p>- แทงเข้าหมด4ตัว(ฮิต4)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ จำนวนหมายเลขที่ผู้เล่นเลือกทั้งหมด 4 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้าหมด3ตัว(ฮิต3)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> แทงเข้า2จาก3：
                                <br /> แทงเข้า2จาก2： แทงเข้า 2 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> √ แทงเข้า 3 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br
                                /> - แทงเข้าหมด2ตัว(ฮิต2)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลข 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br
                                /> -แทงเข้า 2 หมายเลข：
                                <br /> √ แทงเข้า 2 : หมายเลขที่วางเดิมพันทั้งหมดเข้า 2 ตัวในการออกสลากหมายเลขธรรมดา . •
                                <br /> √แทงหมายเลขพิเศษ : หมายเลขที่วางเดิมพันทั้งหมด ตรงกันกับหมายเลขธรรมดา 1ตัว และ หมายเลขพิเศษ 1 ตัว ที่ออกสลาก •
                                <br /> -พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้</p>
                            <h1>【จักรราศี】</h1>
                            <p>จักรราศีเป็นวิธีการเล่นที่ใช้จักรราศีของปีปัจจุบันให้สอดคล้องกับลูกบอลที่ 1 ถึงลูก 49 .
                                <br /> √ การกดหมายเลขพิเศษ: หมายเลขเดิมพันทั้งหมดจะถูกกดหมายเลขพิเศษ 1 หมายเลขและหมายเลขปกติ 1 หมายเลข
                                <br /> พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้.</p>
                            <h1>【การเดิมพันแบบสองทาง】</h1>
                            <p>&nbsp; •</p>
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> - คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ"
                                <br /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" &nbsp;</p>
                            <h1>【หมายเลขหลักสิบ/หลักหน่วย 】</h1>
                            <p>&nbsp; •</p>
                            <p>-หลักสิบ：ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3 หรือ 4 . •
                                <br /> - หลักหน่วย：หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9 •
                                <br /> -หลักสิบของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักสิบของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> - หลักหน่วยของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักหน่วยของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                • •
                                <br /> หลักหน่วยของหมายเลขธรรมดา/พิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อผู้เล่นเดิมพันที่ ตัวเลขหลักหน่วยของหมายเลขใด ๆ ก็ได้ ไม่ว่าจะเป็นหมายเลขธรรมดา
                                หรือ หมายเลขพิเศษ ที่ตรงกับเลขที่ออกสลาก</p>
                            <h1>【แต้ม】</h1>
                            <p>ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 9}>
                        <h2>ล็อตโต้แอฟริกาใต้</h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน.</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            &nbsp;
                            <h1>【การเดิมพันแบบคอมโบ】</h1>
                            &nbsp;
                            <p>- แทงเข้าหมด4ตัว(ฮิต4)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ จำนวนหมายเลขที่ผู้เล่นเลือกทั้งหมด 4 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้าหมด3ตัว(ฮิต3)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> แทงเข้า2จาก3：
                                <br /> แทงเข้า2จาก2： แทงเข้า 2 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> √ แทงเข้า 3 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> - แทงเข้าหมด2ตัว(ฮิต2)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลข 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้า 2 หมายเลข：
                                <br /> √ แทงเข้า 2 : หมายเลขที่วางเดิมพันทั้งหมดเข้า 2 ตัวในการออกสลากหมายเลขธรรมดา . •
                                <br /> √แทงหมายเลขพิเศษ : หมายเลขที่วางเดิมพันทั้งหมด ตรงกันกับหมายเลขธรรมดา 1ตัว และ หมายเลขพิเศษ 1 ตัว ที่ออกสลาก •
                                <br /> -พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้
                            </p>
                            &nbsp;
                            <h1>【แบบราศี】</h1>
                            &nbsp;
                            <p >แบบราศี คือ ขั้นต้อนการเล่นที่ใช้ราศีในปีปัจจุบันตรงกับหมายเลขจากบอล 1 ถึง บอลหมายเลข 49 <br />ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หนึ่งหมายเลขที่วางเดิมพันตรงกับหมายเลขที่ออกสลากตรงกันกับเลขของ จักรราศี (ไม่รวมหมายเลขพิเศษ)
                            ถ้าหมายเลขที่เดิมพันมีมากกว่า 1 หมายเลข ในจักรราศี โบนัส จะคิดเพิ่มให้อัตโนมัติ
                            <br />แบบราศีพิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ผลของหมายเลขที่เลือกออกสลากในตำแหน่งเฉพาะในการเลือกหมายเลขในจราศี
                            <br />แบบหนึ่งราศี : ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ หมายเลขภายใต้จักรราศี ปรากฏอยู่ในโถบอลต่าง ๆ จาก โถบอลที่ 1 ถึงโถบอลที่ 6 ซึ่งจะไม่รวมกันกับบอลพิเศษแต่อย่างใด
                            </p>
                            &nbsp;
                            <h1>【การเดิมพันแบบสองทาง】</h1>
                            &nbsp; •
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> - คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ" •
                                <br
                                /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -ผลรวมใหญ่ / เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลาก ทั้งหลักสิบและหลักหน่วย ถ้าผลรวมเท่ากับหรือมากกว่า
                                7 ก็จะเป็น "รวมใหญ่" ถ้าผลรวมเท่ากับหรือน้อยกว่า 6 จะเป็น รวมเล็ก; ถ้าตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมคี่ / คู่：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลากทั้งหลักสิบหลักหน่วย ถ้าผลรวมเป็นเลขคู่ มันก็จะออกเป็น
                                รวมคู่ ถ้าผลรวมเป็นเลขคี่ ก็จะออกมาเป็นรวมคี่ แต่ถ้าตัวเลขที่ออกสลากเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมของผลลัพธ์ใหญ่ / เล็ก：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกในขณะนั้น ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว
                                และ หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์ใหญ่ /เล็ก ซึ่งถ้าผลรวมกันเท่ากับหรือมากกว่า 175
                                จะเป็นผลรวมของผลลัพธ์ใหญ่ และถ้าผลรวมเท่ากับหรือน้อยกว่า 174 ก็จะเป็นผลรวมของผลลัพธฺ์ เล็ก •
                                <br /> - ผลรวมของผลลัพธ์คี่ / คู่：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกปัจจุบัน ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว และ
                                หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์คี่ / คู่ ถ้าผลรวมเป็นเลขคู่ก็จะเป็นผลรวมของผลลัพธ์
                                คู่; ถ้าผลรวมเป็นเลขคี่ก็จะเป็น ผลรวมของผลลัพธ์คี่
                            </p>
                            &nbsp;
                            <h1>【หมายเลขหลักสิบ/หลักหน่วย 】
                            </h1>
                            &nbsp; •
                            <p>-หลักสิบ：ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3 หรือ 4 . •
                                <br /> - หลักหน่วย：หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9 •
                                <br /> -หลักสิบของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักสิบของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> - หลักหน่วยของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักหน่วยของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> หลักหน่วยของหมายเลขธรรมดา/พิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อผู้เล่นเดิมพันที่ ตัวเลขหลักหน่วยของหมายเลขใด ๆ ก็ได้ ไม่ว่าจะเป็นหมายเลขธรรมดา
                                หรือ หมายเลขพิเศษ ที่ตรงกับเลขที่ออกสลาก
                            </p>
                            &nbsp;
                            <h1>【แต้ม】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 10}>
                        <h2>ล็อตโต้แคนนาดา</h2>
                            <h1>【หมายเลขพิเศษ】</h1>
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน.</p>
                            <h1>【หมายเลขทั่วไป】</h1>
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 6</p>
                            <h1>【การเดิมพันแบบคอมโบ】</h1>
                            <p>- แทงเข้าหมด4ตัว(ฮิต4)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ จำนวนหมายเลขที่ผู้เล่นเลือกทั้งหมด 4 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> -แทงเข้าหมด3ตัว(ฮิต3)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> แทงเข้า2จาก3：
                                <br /> แทงเข้า2จาก2： แทงเข้า 2 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก
                                6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br /> √ แทงเข้า 3 : ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ผู้เล่นเลือกทั้งหมด 3 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br
                                /> - แทงเข้าหมด2ตัว(ฮิต2)：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลข 2 ตัว ตรงกันกับหมายเลขที่ออกสลาก 6 ตัว(ไม่รวมกับหมายเลขพิเศษ)
                                <br
                                /> -แทงเข้า 2 หมายเลข：
                                <br /> √ แทงเข้า 2 : หมายเลขที่วางเดิมพันทั้งหมดเข้า 2 ตัวในการออกสลากหมายเลขธรรมดา . •
                                <br /> √แทงหมายเลขพิเศษ : หมายเลขที่วางเดิมพันทั้งหมด ตรงกันกับหมายเลขธรรมดา 1ตัว และ หมายเลขพิเศษ 1 ตัว ที่ออกสลาก •
                                <br /> -พาร์เลย์ พิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หมายเลขที่ออกสลากทั้ง 6 ตัว และ หมายพิเศษ 1 ตัวที่ออกสลากนั้น ตรงกันกับหมายเลขทั้งหมด
                                6 ตัว และหมายเลขพิเศษ 1 ตัว ที่ผู้เล่นได้วางเดิมพันเอาไว้</p>
                            <h1>【แบบราศี】</h1>
                            <p>&nbsp;
                                <p></p>แบบราศี 1="" 49="" br="">ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ หนึ่งหมายเลขที่วางเดิมพันตรงกับหมายเลขที่ออกสลากตรงกันกับเลขของ จักรราศี (ไม่รวมหมายเลขพิเศษ)
                                    ถ้าหมายเลขที่เดิมพันมีมากกว่า 1 หมายเลข ในจักรราศี โบนัส จะคิดเพิ่มให้อัตโนมัติ
                                    <br /> แบบราศีพิเศษ：ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ผลของหมายเลขที่เลือกออกสลากในตำแหน่งเฉพาะในการเลือกหมายเลขในจราศี
                                    <br
                                    /> แบบหนึ่งราศี : ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ หมายเลขภายใต้จักรราศี ปรากฏอยู่ในโถบอลต่าง ๆ จาก โถบอลที่ 1 ถึงโถบอลที่
                                    6 ซึ่งจะไม่รวมกันกับบอลพิเศษแต่อย่างใด
                            </p>
                            <h1>【การเดิมพันแบบสองทาง】</h1>
                            <p>&nbsp; •</p>
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> - คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ" •
                                <br
                                /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -ผลรวมใหญ่ / เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลาก ทั้งหลักสิบและหลักหน่วย ถ้าผลรวมเท่ากับหรือมากกว่า
                                7 ก็จะเป็น "รวมใหญ่" ถ้าผลรวมเท่ากับหรือน้อยกว่า 6 จะเป็น รวมเล็ก; ถ้าตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมคี่ / คู่：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลากทั้งหลักสิบหลักหน่วย ถ้าผลรวมเป็นเลขคู่ มันก็จะออกเป็น
                                รวมคู่ ถ้าผลรวมเป็นเลขคี่ ก็จะออกมาเป็นรวมคี่ แต่ถ้าตัวเลขที่ออกสลากเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมของผลลัพธ์ใหญ่ / เล็ก：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกในขณะนั้น ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว
                                และ หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์ใหญ่ /เล็ก ซึ่งถ้าผลรวมกันเท่ากับหรือมากกว่า 175
                                จะเป็นผลรวมของผลลัพธ์ใหญ่ และถ้าผลรวมเท่ากับหรือน้อยกว่า 174 ก็จะเป็นผลรวมของผลลัพธฺ์ เล็ก •
                                <br /> - ผลรวมของผลลัพธ์คี่ / คู่：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกปัจจุบัน ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว และ
                                หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์คี่ / คู่ ถ้าผลรวมเป็นเลขคู่ก็จะเป็นผลรวมของผลลัพธ์
                                คู่; ถ้าผลรวมเป็นเลขคี่ก็จะเป็น ผลรวมของผลลัพธ์คี่</p>
                            <h1>【หมายเลขหลักสิบ/หลักหน่วย 】</h1>
                            <p>&nbsp; •</p>
                            <p>-หลักสิบ：ผู้เล่นเดิมพันบนหลักสิบของตัวเลขที่เจาะจงเฉพาะ ซึ่งตัว้เลขหลักสิบสามารถเป็นได้ทั้ง 0,1,2,3 หรือ 4 . •
                                <br /> - หลักหน่วย：หลักหน่วยสามารถเป็นได้จาก 0 ถึง 9 •
                                <br /> -หลักสิบของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักสิบของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> - หลักหน่วยของหมายเลขพิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อ ผู้เล่นเดิมพันที่หมายเลขหลักหน่วยของหมายเลขพิเศษ ที่ตรงกับหมายเลขที่ออกสลาก
                                •
                                <br /> หลักหน่วยของหมายเลขธรรมดา/พิเศษ：ผู้เล่นจะชนะเดิมพันก็ต่อเมื่อผู้เล่นเดิมพันที่ ตัวเลขหลักหน่วยของหมายเลขใด ๆ ก็ได้ ไม่ว่าจะเป็นหมายเลขธรรมดา
                                หรือ หมายเลขพิเศษ ที่ตรงกับเลขที่ออกสลาก</p>
                            <h1>【แต้ม】</h1>
                            <p>ผู้เล่นจะทายผลของผลบอลแบบเจาะจง หรือ ผลบอลปกติที่จะปรากฎอยู่ในตำแหน่งต่าง ๆ ให้ตรงกับผลของช่วงที่หมายเลขที่ออกสลาก โดยผลรวมจะถูกแบ่งออกเป็น
                                6 ช่วง จาก 28 แต้มไปจนถึง 322 แต้ม</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 11}>
                            <h2> อเมริกัน ล็อตโต้
                            </h2>
                            &nbsp;
                            <h1>【หมายเลขพิเศษ】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะหากหมายเลขพิเศษที่ชนะอยู่ในปัจจุบันเหมือนกันกับหมายเลขที่ผู้เล่นเดิมพัน</p>
                            &nbsp;
                            <h1>【หมายเลขทั่วไป】</h1>
                            &nbsp;
                            <p>ผู้เล่นจะชนะการเดิมพันก็ต่อเมื่อ ตำแหน่งและหมายเลขที่ทำการเดิมพัน ตรงกันกับลำดับและตำแหน่งของบอล 1 ถึง บอล 7 .
                            </p>
                            &nbsp;
                            <h1>【การเดิมพันแบบ2ทาง】</h1>
                            &nbsp; •
                            <p>ใหญ่ / เล็ก：ถ้าจำนวนตัวเลขที่ออกสลากเท่ากับหรือมากกว่า 25 ผลออกมาจะเป็น "ใหญ่" แต่ถ้าเท่ากับหรือน้อยกว่า 24 จะเป็น "เล็ก"แต่ถ้าเลขที่ออกสลากเป็น
                                49 ผลจะเป็น "เสมอ" •
                                <br /> -คี่ / คู่：ผลลัพธํ์จะถูกกำหนดโดยตัวเลขไม่ว่าจะเป็นเลขคี่หรือเลขคู่ ถ้าตัวเลขที่ออกสลากมาเป็น 49 จะเป็น "เสมอ" •
                                <br
                                /> - หมายเลขหลักหน่วยใหญ่ / เล็ก：ถ้าตัวเลขหลักหน่วยมีค่าเท่ากับหรือมากกว่า 5 ผลจะเป็น "หลักหน่วยใหญ่"; ถ้าตัวเลขหลักหน่วยเท่ากับหรือน้อยกว่า
                                4 ก็จะเป็น "หลักหน่วยเล็ก" และถ้าเลขที่ออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - จักรราศี ใหญ่ / เล็ก：ตัวเลขจะเป็นราศีใหญ่ ถ้าตัวเลขที่ออกมาเป็น มะเมีย, มะแม,วอก, ระกา หรือ กุน ขณะเดียวกันมันจะเป็นราศีเล็ก
                                ถ้าเลขออกมาเป็น ปีชวด, ฉลู, เถาะ, มะโรง หรือ ปีมะเส็ง แต่ตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมใหญ่ / เล็ก：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลาก ทั้งหลักสิบและหลักหน่วย ถ้าผลรวมเท่ากับหรือมากกว่า
                                7 ก็จะเป็น "รวมใหญ่" ถ้าผลรวมเท่ากับหรือน้อยกว่า 6 จะเป็น รวมเล็ก; ถ้าตัวเลขออกมาเป็น 49 จะเป็น "เสมอ" •
                                <br /> -ผลรวมคี่ / คู่：การเดิมพันของผู้เล่นจะขึ้นอยู่กับผลรวมของตัวเลขที่ออกสลากทั้งหลักสิบหลักหน่วย ถ้าผลรวมเป็นเลขคู่ มันก็จะออกเป็น
                                รวมคู่ ถ้าผลรวมเป็นเลขคี่ ก็จะออกมาเป็นรวมคี่ แต่ถ้าตัวเลขที่ออกสลากเป็น 49 จะเป็น "เสมอ" •
                                <br /> - ผลรวมของผลลัพธ์ใหญ่ / เล็ก：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกในขณะนั้น ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว
                                และ หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์ใหญ่ /เล็ก ซึ่งถ้าผลรวมกันเท่ากับหรือมากกว่า 175
                                จะเป็นผลรวมของผลลัพธ์ใหญ่ และถ้าผลรวมเท่ากับหรือน้อยกว่า 174 ก็จะเป็นผลรวมของผลลัพธฺ์ เล็ก
                                <br /> - ผลรวมของผลลัพธ์คี่ / คู่：ผลลัพธ์จะขึ้นอยู่กับผลรวมของตัวเลข 7 ตัวที่ออกปัจจุบัน ซึ่งจะดูที่ หมายเลขธรรมดา 6 ตัว และ
                                หมายเลขพิเศษ 1 ตัวที่ออกสลาก ในการตรวจสอบว่าจะเป็นผลรวมของผลลัพธ์คี่ / คู่ ถ้าผลรวมเป็นเลขคู่ก็จะเป็นผลรวมของผลลัพธ์
                                คู่; ถ้าผลรวมเป็นเลขคี่ก็จะเป็น ผลรวมของผลลัพธ์คี่</p>
                            &nbsp;
                        </div>
                    </div>

                </Grid>
            </Grid>
            
        </div>
      );
    }
  }

  const mapStateToProps = (state) => {
    const { token } = state.auth;
    return {
        isAuthenticated: (token !== null && token !== undefined),
        error: state.auth.error,
        lang: state.language.lang,
        showAnnouncements: state.general.show_letou_announcements,
    }
}


LotteryRuleOneTh.propTypes = {
    classes: PropTypes.object.isRequired,
    callback: PropTypes.func,
};

export default withStyles(styles)(injectIntl(withRouter(connect(mapStateToProps, {
    show_letou_announcements
})(LotteryRuleOneTh))));