export const messages = {
    en: {
        'about-letou': 'About Letou',
        'become-partner': 'Become a Partner',
        'line-center': 'Line Center',
        'downloads-link': 'Downloads',
        'latest-announcement': 'Latest Announcement',
        'online-service': 'Online Service',
        'sign-up': 'Sign up',
        'sign-in': 'Sign in',
        'nav-sports': 'Sports',
        'nav-gaming': 'Gaming',
        'nav-live-casino': 'Live Casino',
        'nav-chess': 'Chess',
        'nav-lottery': 'Lottery',
        'nav-games': 'Games',
        'nav-offer': 'Offer',
        'letou-sports': 'Letou Sports',
        'international-sports': 'International Sports',
        'sabah-sports': 'Sabah Sports',
        'sports-tutorial': 'Sports Tutorial',
        'letou-esports': 'Letou E-Sports',
        'letou-esports-pro': 'Letou E-Sports Pro',
        'sabah-esports': 'Sabah E-Sports',
        'fried-golden': 'Fried Golden Flower',
        '21-oclock': "21 o'clock",
        'grab-cattle': 'Grab the Cattle',
        'texas-holdem': "Texas Hold'em",
        'games-lobby': 'Games Lobby',
        'nav-lotto': 'Lotto',
        'happy-color': 'Happy Color',
        'time-color': 'Time Color',
        'pick-up': 'PK Pick Up',
        'fast-3': 'Fast 3',
        'latest-offer': 'Latest Offer',
        'daily-discount': 'Daily Discount',
        // '':'',


        'help-title': '我们在此竭诚服务',
        "about-letou": '关于LETOU',
        "aboutUs-detail-text-one": 'LETOU成立于2004年，是亚洲首家提供现金制在线博彩服务的娱乐公司。',
        "aboutUs-detail-text-two": '多年来我们始终贯彻诚信为本，务实经营的理念，秉承用户至上的原则，拥有了大批来自世界各国的朋友。正是有了各位朋友的支持，我们不断发展壮大，一步步走到今天。LETOU热烈欢迎新朋友的加入，同时也希望得到老朋友的继续支持！我们的今天是各位新老朋友大力支持的结果，LETOU将继续努力，竭诚为广大朋友提供更好的游戏体验',
        "aboutUs-detail-text-three": 'LETOU全年365天，每天24小时为客户提供服务，用心为客户解决各种问题；LETOU每天提供500种不同类别的比赛赛事，涵盖世界范围内主要体育运动，包括足球、篮球、网球、棒球、桌球、高尔夫球等，同时提供数字游戏、虚拟游戏、休闲游戏以及在线真人娱乐场服务；LETOU是严格遵循菲律宾政府的要求，在政府财务管理当局的要求下指定存款、取款的专业公司，确保客户资金安全以及符合政府所规定的反洗钱法（AML）原则，最大程度地提供透明的财务环境，以供政府监管并确保客户利益；同时LETOU也积极呼吁，博彩只是一种娱乐消遣的方式，建议玩家拥有一个良好的游戏心态。',
        "aboutUs-detail-text-four": '用户至上一向是我们秉承的原则！长久以来，LETOU始终将用户放在第一位，未来我们将继续与朋友们一起，共创美好明天！',
        "statement" :'1.如果会员怀疑自己的资料被盗用，应立即通知本公司，并更改详细数据，以前的用户名称及密码将全部无效。\
        2.会员有责任确保自己的帐户及登入资料的保密性。以用户名称及密码进行的任何网上交易将被视为有效。\
        3.公布赔率时出现的任何打字错误或非故意人为失误，本公司保留改正错误和按正确赔率结算交易的权力。\
        4.您居住所在地的法律有可能规定网络交易不合法；若此情况属实，本公司将不会批准您使用付账卡进行交易。\
        5.每次登入时会员都应该核对自己的账户余额。如对余额有任何疑问，请在第一时间通知本公司。\
        6.一旦交易被接受，则不得取消或修改。\
        7.所有比赛的让球及赔率将不时浮动，交易时的赔率将以确认交易时之赔率为准。\
        8.进行过关交易时，每笔交易不能在同一场赛事中拣选超过一个以上的选择。\
        9.每笔最高交易金额按不同[场次]及[交易项目]及[会员账号]设定浮动。请各会员根据网站提示限额进行下注，任何团体或个人不得注册或拥有多个账号进行下注，如交易金额超过上述设定，本公司有权取消该团体或个人的所有交易。\
        10.所有比赛都必须在预定时间进行否则交易无效。若比赛在赛前被延期或取消，所有交易都被视为无效。\
        11.除滚球外，如果比赛提前举行，在比赛开打时间后所接受之交易均为无效。\
        12.如发现会员拥有多个帐户或使用非本人数据（包括亲属、友人个人资料），本公司有权无条件取消所有注单并关闭您的账户。本公司有权限制会员只保留其中一个账户。每位会员，包括同一家庭，同一住址，同一电子邮箱地址，同一借记卡／信用卡，同一个银行账户、同一I-Pay账号，同一台计算机（大学、团体、学校、公共图书馆、办公室等），同一IP，同一共享计算机（如学校，公共图书馆或工作场所）。\
        13.客户完全理解并接受LETOU对此协议进行的任何修改。LETOU可能在任何时候对此协议进行修改并会公布在会员进入的相关网页上。如果本公司对此协议进行较大的修改，我们会通过合适的方式通知您（比如在网站显眼位置发布修改信息，并会把修改内容贴上去）。阁下有责任经常检查相关条款与政策以确认您接受其内容，如果阁下继续使用本网站将被视为您接受相关条款与政策的修改。\
        14.所有在协议条款修改前的投注将适用于修改前的协议条款。所有在协议条款修改后的投注将适用新的协议条款。如果阁下不能接受相关修改，您应该停止使用本网站和／或关闭您应该停止使用本网站和／或关闭您的账户您的账户。\
        15.关于条款的应用是指您承诺不会因非法目的进入或使用我们网站的服务，软件和信息，您也需确保您的行为不会违反您当地的法律或不会违反您与LETOU间的协议。特别是（协议里所有其它附加声明和保证）您需确保您将履行以下协议。\
        16.阁下不是法律限制行为能力的个体；阁下已年满18岁，您的行为在您当地法律上是属合法的。\
        17.阁下的法定行为只能代表您个人，而不能代表其他人或其他公司。\
        18.阁下认同您参与我们的服务纯属自愿，须自行承担风险。\
        19.阁下并非嗜赌成性的人。\
        20.阁下不是LETOU员工，或您不是LETOU员工亲属。\
        21.阁下是LETOU员工（任何LETOU员工亲属），或前雇员（任何前雇员亲属），需已离职超过6个月。\
        22.阁下认同在使用我们服务时须提供给我们某些个人信息进行确认（包括关于支付方式的具体信息）。我们将遵循我们的隐私政策对您提供的信息进行管理和控制。\
        23.阁下须自行承担由博彩赢利产生的相关税收。\
        24.阁下使用我们网站只能出于个人用途。阁下只可出于个人娱乐而进行博彩投注。\
        25.您并非以下地区的居民：澳大利亚，比利时，丹麦包括格陵兰和法罗群岛，德国，希腊，香港，以色列，荷兰，菲律宾，新加坡，南非，西班牙，瑞士，台湾，土耳其，美国，意大利和法国，包含瓜德罗普岛，留尼汪岛，马提尼克岛，法属圭亚那，法属波利尼西亚，马约特岛，新喀里多尼亚，圣巴泰勒米，圣马丁岛，圣皮埃尔，密克隆群岛瓦利斯和富图纳群岛。\
        26.阁下认同并能承担因使用此服务而导致的亏损风险，LETOU对其损失不承担任何风险。\
        28.阁下不得通过使用LETOU账户从事非法活动，或允许他人使用您的账户从事任何违背您当地和我们法律的活动。\
        29.阁下承诺妥善保管好您的帐户和密码不允许其他人使用。如果您丢失或忘记您的帐户或密码，您须及时联系我们客服部门，我们将发送给您新的安全数据。\
        30.阁下有责任确保自己的帐户及登入数据的保密性，以用户名称及密码进行的任何网上博彩将被视为有效。\
        31.阁下在使用我们的服务，网站，设备，软件或相关信息时，您不得以任何方式妨碍其他会员享用我们提供的服务。\
        32.阁下不得以任何方式窃取其他会员的任何相关信息。\
        33.阁下不得上载或发布任何带有病毒的程序、文件或数据，影响我们网站设备、软件、服务等运作性能。\
        34.阁下不可试图以任何形式修改，反向编译，反向工程或反汇编我们的软件。\
        35.阁下不得使用任何设备，自动设备，软件，程序或其它方法（类似于前述的）妨碍或试图干预我们网站提供的服务，设备，软件，网址，信息或任何交易的正常运作，人工智能使用包括没有局限的外挂系统是严格禁止连接服务器.所有的客户服务操作必须是玩家通过使用我们的程序接口进行。\
        36.阁下不得在我们网站或设备上或对其他使用者发布任何关于骚扰、侮辱、诽谤、威胁、淫秽、及煽动种族不满的相关非法信息，或者任何构成或怂恿犯罪行为，或引起 民事责任事件等等相关违法信息。\
        37.阁下不得主动发起或参与针对LETOU展开的调查，竞猜，或大量发布连锁信件／垃圾邮件，兜售邮件等活动。\
        38.阁下不可以同时拥有多个账号，如发现客户拥有多个户口，公司有权取消其户口以及投注，本公司保留权利取消或关闭您的账户。本公司有权限制客户只保留其中一个户口。\
        39.阁下认同以上总条款的适用，并认同如果客户行为带有任何嫌疑或违规现象，LETOU有权未经事先通知或解释上报给相关同盟协会或当地官方。\
        40.阁下不得以任何无风险投注行为（如：打水投注，对冲投注等）或人工智能软件（如：机械软件）进行投注。如发现上述问题，LETOU将保留终止会员账号使用之权力。如有任何争议问题，LETOU有最终决定权。无论任何情形，就停止或更改服务或终止会员账户服务所可能产生之困扰、不便或损害，本服务对任何会员或第三人均不负任何责任。\
        在LETOU，我们在处理支付交易方面，一直保持严谨及专业。为了保障我们会员的利益，避免在多种提款方法中遇到欺诈的情况，我们有可能将会在会员首次大额提款时，需要获得其正确的身份；请留意，这些可能都需要使用传真机或扫描机。虽然这些程序并非理想，但是它们都能帮助我们实行严谨的安全控制，且为会员及本公司提供保障。我们处理任何投注账户提款前，必须经过核实检查，核查有关会员的身份证明，这是全部提款方法强制性的要求。若并未有提供，提款将不被处理。我们的客服人员将会联系您，跟进有关提款。请容许我们在3-7个工作日内检查数据，以及顺序核实，然后批准提款要求。\
        以下是所要求的资料：\
        √ 阁下需要提供有您照片的身份证，护照，户口簿或驾驶执照的副本给我们。副本上的照片必须清楚。（阁下将只需提供您的身份证明一次给我们，您便能够从您的账户不断提款。）\
        √ 事务历史记录证明银行账户及信用卡结算单副本反映最后一个转账到您LETOU帐户的成功存款记录。\
        √ 最近的（不超过三个月）银行账户及信用卡结算单副本。\
        √ 居住证明：1. 最近的（不超过三个月）水电费单副本。2. 银行账户及信用卡结算单副本反映您在LETOU注册的姓名以及地址。\
        \
        LETOU保留在任何时候关闭或冻结会员账号、降低会员账号投注限额的权利。',
        "general-rule" : '',
        "rule" : '',
        "condition" : '',
        "policy": ''

    },
    zh: {
        
    },
    vi: {},
    th: {}
};
