import React from 'react';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import { injectIntl } from 'react-intl';
import { withRouter } from 'react-router-dom';
import { connect } from 'react-redux';
import Typography from '@material-ui/core/Typography';

import Grid from '@material-ui/core/Grid';
import IconHeader from "../icon_header";
import InfoSelect from "../info_select";
import '../../css/help.css'

import {
    show_letou_announcements
} from '../../../actions';


const styles = theme => ({
   
    content : {
        display: 'flex',
        paddingRight: 400,
    },
    infoSelect : {
        paddingLeft: 300,
        display: 'flex',
        flexDirection: 'column',
    },
    aboutUsDetail : {
       fontSize: '14px',
    },
    helpCenterArticleColumn: {
        fontSize: '14px',
        listStyleType: 'none',
    }
})

export class MemberRuleFive extends React.Component {
    
    getLabel(labelId) {
        const { formatMessage } = this.props.intl;
        return formatMessage({ id: labelId });
    }

    render() {
  
      const { classes } = this.props;
  
      return (
       
        <div className={classes.root}> 
            <IconHeader/>
            <Grid container className={classes.content}>
                <Grid item xs={5} className={classes.infoSelect}>
                    <InfoSelect/>
                </Grid>
            
                <Grid item xs={7} className={classes.detail}>
                    <div class="HelpCenterList">
                        <ul>
                            <li>
                                <a href="/for_partner">สำหรับคู่ค้า  >
                                    <i></i>
                                </a>
                            </li>
                            <li>
                                <a href="/for_partner">แบ่งปันแพลน >
                                    <i></i>
                                </a>
                            </li>
                        </ul>
                    </div>
                    <div id="HelperCenterDetail">
                    <h2>คำถามที่พบบ่อยเกี่ยวกับโปรแกรมพันธมิตร</h2>
                        <p>โปรแกรมพันธมิตร Letou เป็นโปรแกรม co-marketing เรายินดีต้อนรับบุคคลและ บริษัท ที่มีช่องของตัวเองเพื่อโปรโมตแพลตฟอร์มเดิมพันออนไลน์ที่ได้รับการรับรองคุณภาพสูงของเรา
                            เข้าร่วมโปรแกรมพันธมิตร LETOU และเริ่มได้รับผลตอบแทนที่ร่ำรวยกับสมาชิกทุกคนที่คุณเชิญชวนให้เข้าร่วมการเดิมพันผลิตภัณฑ์หลากหลายประเภทของเราเช่น:
                            กีฬา, ตัวแทนจำหน่ายสด, RNG, Keno และ Hong Kong Lotto ยิ่งคุณมีสมาชิกมากเท่าใดคุณจะได้รับค่าคอมมิชชั่นมากขึ้นเท่านั้นและไม่มีข้อ
                            จำกัด ในเรื่องนี้ ร่วมเป็นหนึ่งใน บริษัท ชั้นนำของอุตสาหกรรมและได้รับค่าคอมมิชชั่นที่ไร้ขีด จำกัด</p>
                        <p>Letou Affiliate Program จะตอบแทนคุณด้วยค่าคอมมิชชั่นสูงโดยไม่มีค่าความเสี่ยงหรือค่าบริการโดยเพียงแค่เชิญสมาชิกใหม่มาเล่นในเว็บไซต์ของเรา</p>
                        <p>ถาม: ฉันจะเข้าร่วมโปรแกรมพันธมิตร LeTou ได้อย่างไร?</p>
                        <p>A: คลิก "ลงทะเบียน" และกรอกแบบฟอร์มการลงทะเบียนง่ายๆ โปรดอ่านและยอมรับข้อตกลงและเงื่อนไขทั้งหมดที่ระบุในข้อตกลง สำหรับรายละเอียดเพิ่มเติมกรุณาติดต่อผู้เชี่ยวชาญด้านการเป็นพันธมิตรของเราผ่าน
                            QQ (3309889296 306820689) หรือ Skype (swifind)</p>
                        <p>ถาม: ทำไมฉันจึงควรเป็นพันธมิตรของ Letou?</p>
                        <p>A:</p>
                        <p>1. รับรายได้สูงสุด 40% และคอมมิชชั่นจาก บริษัท ในเครือดาวน์ไลน์ไม่ จำกัด 10% บริษัท ในเครือสามารถเดิมพันในเว็บไซต์ของเราได้เช่นกันเพื่อรับความเป็นไปได้ในการชนะ</p>
                        <p>2. เราให้บริการธุรกรรมทางการเงินที่มีความปลอดภัยและข้อมูลสมาชิกที่ถูกต้องในเวลาจริงสำหรับการสังเกตการณ์ของพันธมิตร</p>
                        <p>3. เราให้บริการลูกค้าตลอด 24 ชั่วโมงทุกวันผ่านแอพพลิเคชันและช่องทางต่างๆเช่น Skype, QQ, WeChat, Hotline เป็นต้น</p>
                        <p>4. เรานำเสนอผลิตภัณฑ์ที่น่าตื่นเต้นเพื่อเพิ่มความพึงพอใจให้กับสมาชิกซึ่งรวมถึงแพลตฟอร์มกีฬาหลายคาสิโนสด 9 แห่งคาสิโน RNG
                            7 แห่งและ Keno ยอดนิยม 3 ประเภท</p>
                        <p>ถาม: มีค่าธรรมเนียมใดบ้างเพื่อเป็นพันธมิตรของ Letou?</p>
                        <p>A: โปรแกรม Affiliate ของ Letou เป็นบริการฟรีและง่ายมากที่จะเข้าร่วม เพียงแค่กรอกแบบฟอร์มพร้อมกับข้อมูลและส่ง</p>
                        <p>Q: ต้องการเข้าร่วมโปรแกรมพันธมิตรของ Letou คืออะไร?</p>
                        <p>ตอบ: เรายินดีต้อนรับบุคคลที่มีเครือข่ายทางสังคมมากมายการประชาสัมพันธ์ที่ยอดเยี่ยมและความสามารถในการโปรโมตเพื่อเข้าร่วมกับเรา
                            อ่านและยอมรับข้อตกลงโครงการพันธมิตรของ Letou และกรอกแบบฟอร์ม โปรดติดต่อผู้เชี่ยวชาญของเราผ่านทาง QQ หรือ Skype หลังจากที่ได้รับการยื่นและใบสมัครของคุณจะได้รับการยืนยันและดำเนินการภายใน
                            72 ชั่วโมง</p>
                        <p>Q: อะไรคือประโยชน์ของการเป็นพันธมิตรของ Letou?</p>
                        <p>A: ในฐานะพันธมิตรของ Letou คุณจะได้รับค่าคอมมิชชั่นสูงสุด 40% จากการบริจาคของสมาชิก บางครั้งเราจะพัฒนาและส่งเสริม Letou ทั่วทั้งตลาดเพื่อเพิ่มศักยภาพในการเป็นพันธมิตรของเราที่จะได้รับค่าคอมมิชชั่นมากขึ้น</p>
                        <p>ถาม: ฉันจะดูสถิติของฉันได้อย่างไร?</p>
                        <p>ตอบ: เข้าสู่ระบบของ Letou affiliate และคุณสามารถตรวจสอบกิจกรรมและรายงานการเดิมพันของสมาชิกรายวันได้ เนื้อหาของรายงานประกอบด้วยสถานะการพนันกำไรขาดทุนการทำธุรกรรมการวิเคราะห์ข้อมูล
                            ฯลฯ ซึ่งระบุไว้อย่างละเอียด</p>
                        <p>Q: วันที่เผยแพร่และเรียกเก็บเงินค่านายหน้า</p>
                        <p>ตอบ: การตั้งถิ่นฐานของเดือนก่อนหน้าจะมีการกำหนดวันที่ 5-9 ของทุกเดือน บริษัท ในเครือจะสามารถยื่นขอถอนเงินในวันที่ 20 ของแต่ละเดือน</p>
                        <p>Q: อะไรคือการลงทะเบียนใหม่?</p>
                        <p>ตอบ: ลงทะเบียนครั้งแรกในแพลตฟอร์ม Letou ซึ่งจะฝากเงินผ่านช่องทางของธนาคารโดย Letou</p>
                        <p>Q: อะไรคือสมาชิกใหม่ที่ถูกต้อง?</p>
                        <p>ตอบ: สมาชิกที่ลงทะเบียนผ่านทางลิงค์พันธมิตรหรือรหัส Affiliate และทำการฝากเงินครั้งแรกจะกลายเป็นสมาชิกใหม่ที่ถูกต้องของ Affiliate</p>
                        <p>ถาม: สมาชิกใหม่จะถูกติดแท็กให้กับบัญชี Affiliate ของฉันอย่างไร?</p>
                        <p>ตอบ: สมาชิกใหม่จะถูกติดแท็กรหัสพันธมิตรของคุณ</p>
                        <p>Q: ฉันจะใส่ใจอะไรเมื่อเชิญสมาชิก?</p>
                        <p>A:</p>
                        <p>1. การลงทะเบียนสมาชิกใหม่ต้องทำหลังจากวันที่เริ่มต้นของคุณมีผลบังคับใช้</p>
                        <p>2. สมาชิกใหม่ต้องมีบัญชี Letou ที่ถูกต้องเท่านั้น</p>
                        <p>3. การหมุนเวียนบัญชีสมาชิกที่เป็นสมาชิกของ Affiliate จะไม่รวมอยู่ในค่านายหน้า</p>
                        <p>4. สมาชิกใหม่ต้องไม่เป็นสมาชิกของ Affiliate คนอื่น</p>
                        <p>ถาม: ฉันสามารถลงทะเบียนบัญชีสมาชิกของฉันเองภายใต้บัญชี Affiliate ของฉันได้หรือไม่?</p>
                        <p>A: บัญชี Affiliate ไม่ได้รับอนุญาตให้ทำธุรกรรมและเดิมพันกิจกรรม บริษัท ในเครือสามารถลงทะเบียนบัญชีสมาชิกเพื่อการพนันได้ แต่ต้องไม่จดทะเบียนเป็นสมาชิกของเครือข่าย
                            การประพฤติมิชอบอาจทำให้บัญชีพันธมิตรถูกยกเลิก</p>
                        <p>Q: ฉันมีสมาชิกใหม่ 10 คน แต่มีเพียง 2 คนที่วางเดิมพันภายในหนึ่งเดือนเท่านั้นฉันมีสิทธิ์ได้รับค่าคอมมิชชั่นหรือไม่?</p>
                        <p>A: เงื่อนไข 2 ข้อเพื่อให้มีสิทธิ์ได้รับค่านายหน้าในเดือนใดเดือนหนึ่ง:</p>
                        <p>1. สมาชิกที่ใช้งานอย่างน้อย 6 คน</p>
                        <p>2. คู่ค้าต้องรักษายอดเงินคงเหลือของบัญชี 100CNY เพื่อขอถอนเงิน Letou จะยอมรับการถอนเงินหาก บริษัท ในเครือทำกำไรและตรงกับความต้องการของเดือนใด
                            ๆ อย่างไรก็ตามการสูญเสียใด ๆ จะถูกหักออกจากค่าคอมมิชชั่น</p>
                        <p>ถาม: ถ้าบัญชีพันธมิตรของฉันมียอดคงเหลือติดลบ</p>
                        <p>ตอบ: ยอดคงเหลือเชิงลบจะแสดงในบัญชีของคุณเมื่อสมาชิกของคุณชนะมากกว่าขาดทุน ยอดคงเหลือติดลบรายวันจะหักออกจากเงินทุนหมุนเวียนปัจจุบันของคุณจนกว่ายอดคงเหลือจะเป็นบวก
                            (คุณมีสิทธิ์ถอนเงินเมื่อยอดเงินในบัญชีของคุณมากกว่า 100 หยวน)</p>
                        <p>ถาม: เหตุใดจึงต้องระงับบัญชี</p>
                        <p>A:</p>
                        <p>1. บริษัท ในเครือที่ไม่สามารถดูแลสมาชิกอย่างน้อย 6 รายต่อเดือนภายใน 3 เดือนขึ้นไป Letou จะแจ้งให้คุณทราบผ่าน QQ หรือ Skype
                            ถ้าคุณไม่สามารถตอบสนองความต้องการในการติดตาม 2-3 เดือนถัดไปได้</p>
                        <p>2. เราไม่สามารถติดต่อ บริษัท ในเครือกับข้อมูลทั้งหมดที่มีให้ในกระบวนการแก้ไขปัญหาของสมาชิก</p>
                        <p>3. การประพฤติปฏิบัติผิดต่อสิทธิและหน้าที่ในการเป็นพันธมิตรของ Letou</p>
                        <p>ถาม: ฉันสามารถโฆษณาบนช่องของฉันเพื่อพัฒนาเครือข่ายพันธมิตรได้หรือไม่?</p>
                        <p>A: ใช่ ในฐานะพันธมิตรอย่างเป็นทางการของ Letou คุณอาจโฆษณาช่องของคุณเองเพื่อโปรโมตแผนสมาชิกโดยไม่มีการประพฤติผิดต่อสิทธิ์และภาระผูกพันของ
                            Affiliate</p>
                        <p>ถาม: ฉันสามารถเข้าร่วมโปรแกรมพันธมิตรของ Letou ได้หรือไม่ถ้าฉันอยู่นอกสหราชอาณาจักร?</p>
                        <p>A: ใช่ Letou ยินดีต้อนรับ บริษัท ในเครือจากทั่วทุกมุมโลกยกเว้นฮ่องกงฟิลิปปินส์และสิงคโปร์</p>
                        <p>ถาม: มีข้อ จำกัด ในพื้นที่อยู่อาศัยของผู้เล่นของฉันหรือไม่?</p>
                        <p>ตอบ: Letou มุ่งเน้นการพัฒนาธุรกิจกับ บริษัท ในเครือที่มีผู้เล่นจากจีนแผ่นดินใหญ่</p>
                        <p>คำถาม: ข้อ จำกัด ใด ๆ ในประเทศที่พำนักถาวรของฉัน?</p>
                        <p>ตอบ: LETOU ยินดีต้อนรับ บริษัท ในเครือจากทั่วโลก เราไม่มีข้อ จำกัด สำหรับประเทศที่อยู่ถาวรของ บริษัท ในเครือ หากคุณมีข้อสงสัยหรือต้องการความช่วยเหลือโปรดติดต่อผู้เชี่ยวชาญด้านเครือข่ายของเราผ่าน
                            QQ (3309889296 &amp; 306820689) หรือ Skype (swifind) เรายินดีที่จะให้บริการคุณเสมอ</p>
                    </div>

                </Grid>
            </Grid>
            
        </div>
      );
    }
  }

  const mapStateToProps = (state) => {
    const { token } = state.auth;
    return {
        isAuthenticated: (token !== null && token !== undefined),
        error: state.auth.error,
        lang: state.language.lang,
        showAnnouncements: state.general.show_letou_announcements,
    }
}


MemberRuleFive.propTypes = {
    classes: PropTypes.object.isRequired,
    callback: PropTypes.func,
};

export default withStyles(styles)(injectIntl(withRouter(connect(mapStateToProps, {
    show_letou_announcements
})(MemberRuleFive))));