import React from 'react';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import { injectIntl } from 'react-intl';
import { withRouter } from 'react-router-dom';
import { connect } from 'react-redux';

import Grid from '@material-ui/core/Grid';
import IconHeader from "../../icon_header";
import '../../../css/help.css'

import { show_letou_announcements} from '../../../../actions';


const styles = theme => ({
   
    content: {
        display: 'flex',
        paddingRight: 400,
        [theme.breakpoints.down('md')]: {
            paddingRight: 2,
            flexDirection: 'column'
         
        },
       
    },
    infoSelect: {
        paddingLeft: 300,
        display: 'flex',
        [theme.breakpoints.down('md')]: {
            display: 'none' 
        }
    },
    detail: {
        fontSize: '14px',
        color: '#666666',
        fontFamily: 'Microsoft YaHei'
    },
 
    mobile: {
        display: 'none',
        [theme.breakpoints.down('md')]: {
            display: 'flex',
            flexDirection: 'row'
         
        }
    },
    mainCont: {
        paddingLeft: 20,
        paddingRight: 20
    },
    helpCenterArticleColumn: {
        fontSize: '14px',
        listStyleType: 'none',
    }
})

export class BetRuleThreeTh extends React.Component {
    constructor(props) {
        super(props);
        
        this.state = {
          hide: true,
          current: 1
        }
    }
    getLabel(labelId) {
        const { formatMessage } = this.props.intl;
        return formatMessage({ id: labelId });
    }

    onClick(index, e) {
        e.preventDefault()
        this.setState({
          hide: false,
          current: index
          
        })
    }
    
    render() {
  
      const { classes } = this.props;
      
      
      return (
       
        <div className={classes.root}> 
            <IconHeader/>
            <Grid container className={classes.content}>
                <Grid item md={5} className={classes.infoSelect}>
                    <div className="HelpCenterLeftNav">
                            <ul>
                                <li>
                                    <a href="/th/for_member">{this.getLabel('for-member')}</a>
                                </li>
                                <li>
                                    <a href="/th/for_partner">{this.getLabel('for-partner')}</a>
                                </li>
                            </ul>
                        </div>
                </Grid>
            
                <Grid item md={7} xs={12} className={classes.mainCont}>
                        <div className={classes.mobile}>
                            <div className="HelpCenter">
                                <ul >
                                    <li className="Active">
                                        <a href="/zh/for_member">{this.getLabel('for-member')}</a>
                                    </li>
                                    <li>
                                        <a href="/zh/for_partner">{this.getLabel('for-partner')}</a>
                                    </li>
                                </ul>
                            </div>
                        </div>
                    <div className="HelpCenterList">
                        <ul>
                            <li>
                                <a href="/th/for_member">บริการแก่สมาชิกใช้  >
                                    <i></i>
                                </a>
                            </li>
                            <li>
                                <a href="/th/for_member">กติกาเกมส์กีฬา >
                                    <i></i>
                                </a>
                            </li>
                        </ul>
                    </div>
                  
                    <div className="HelpCenterSmNav">
                        <ul>
                            <li className={this.state.current === 1 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(1, e);}}>แฮนดิแคปเอเชีย</a>
                            </li>
                            <li className={this.state.current === 2 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(2, e);}}>ผลสกอร์ที่ถูกต้อง</a>
                            </li>
                            <li className={this.state.current === 3 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(3, e);}}>การนับผลชนะ</a>
                            </li>
                            <li className={this.state.current === 4 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(4, e);}}>ครึ่งเวลา/เต็มเวลา</a>
                            </li>
                            <li className={this.state.current === 5 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(5, e);}}>การชนะเดิมพันในเวลา</a>
                            </li>
                            <li className={this.state.current === 6 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(6, e);}}>Next</a>
                            </li>
                            <li className={this.state.current === 7 ? "Active" : ""} >
                                <a href="/" onClick={(e) => {this.onClick(7, e);}}>ประตูจากผู้เล่น</a>
                            </li>
                        </ul>
                        <div className="ClearBoth"></div>
                    </div>

                    <div id="HelperCenterDetail" className={classes.detail}>
                        <div className="centerDetail" hidden={this.state.current !== 1}>
                        <p>แฮนดิแคปเอเชีย</p>
                            <p>แฮนดิแค็ปเอเชีย (รวมถึงการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>มีสองทางเลือกสำหรับทีมที่บ้านและทีมเยือนหากการแข่งขันถูกเล่นที่สถานที่กลางทีมบ้านและทีมเยือนที่มีความแตกต่างบนหน้าจอแสดงผลเป็นพื้นฐาน
                                เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> แฮนดิแค็ป 0 บอล</p>
                            <p>ถ้าทั้งสองทีมชนะด้วยคะแนนใด ๆ (ทีมที่ชนะ) จะถูกตัดสินว่าเป็นผู้ชนะ ในกรณีที่มีการวางเดิมพันทั้งหมดถือเป็นโมฆะและจะได้รับเงินคืน</p>
                            <p>
                                <br /> แฮนดิแค็ปไลน์ 0, 0.5 บอล</p>
                            <p>ทีมที่ให้ 0, 0.5 ลูกเริ่มต้น:
                                <br /> - ชนะด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - วาด - ครึ่งหนึ่งของเงินเดิมพันจะถูกคืนให้กับการเลือกนี้ ส่วนอีกครึ่งหนึ่งของเงินเดิมพันถูกจัดให้เป็นผู้แพ้
                                <br /> - แพ้คะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกเป็นผู้แพ้</p>
                            <p>ทีมที่ได้รับ 0, 0.5 ลูกเริ่มต้น:
                                <br /> - ชนะด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - วาด - ครึ่งเดิมพันจะตัดสินในราคาของการเลือกที่เลือก อีกครึ่งหนึ่งได้รับเงินคืนให้กับลูกค้า
                                <br /> - แพ้คะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกเป็นผู้แพ้</p>
                            <p>
                                <br /> แฮนดิแคป 0.5 บอล</p>
                            <p>ทีมที่เริ่มต้นลูก 0.5:
                                <br /> - ชนะด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - วาด - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> - แพ้คะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ทีมที่ได้รับลูกบอล 0.5 ลูกขึ้น:
                                <br /> - ชนะด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - วาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้คะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>
                                <br /> แฮนดิแค็ปไลน์ 0.5.1 บอล</p>
                            <p>ทีมที่เริ่มเล่นลูก 0.5.1:
                                <br /> - ชนะ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - ชนะได้เท่ากับ 1 - ครึ่งเดิมพันจะตัดสินตามราคาของการเลือกที่เลือก อีกครึ่งหนึ่งได้รับเงินคืนให้กับลูกค้า
                                <br /> - วาดหรือแพ้โดยแต้มใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ทีมที่ได้รับลูกบอล 0.5.1 เริ่มต้น:
                                <br /> - วาดหรือชนะด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 1 - ครึ่งหนึ่งของจำนวนเงินที่ได้รับคืนให้กับลูกค้า อีกครึ่งหนึ่งถูกจัดประเภทเป็นผู้แพ้
                                <br /> - แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>
                                <br /> แฮนดิแค็ปไลน์ 1 บอล</p>
                            <p>ทีมที่ให้ลูกเริ่มต้นอย่างเต็มรูปแบบ:
                                <br /> - ชนะ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - ชนะตามตรง 1 - การเดิมพันทั้งหมดในการเลือกนี้ถือเป็นโมฆะและคืนให้กับลูกค้า
                                <br /> - วาดหรือแพ้ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ทีมที่ได้รับลูกบอลเต็มรูปแบบเริ่มต้น:
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 1 แต้ม - การเดิมพันทั้งหมดในการเลือกนี้ถือเป็นโมฆะและคืนให้กับลูกค้า
                                <br /> - แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 2}>
                        <p>Asian Total</p>
                            <p>Asian Total (รวมการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิก เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>บรรทัดแรก 1</p>
                            <p>เส้นชัยเหนือ 1
                                <br /> เดิมพันชนะหากมีสองประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                                <br /> หากมีเป้าหมายอย่างใดอย่างหนึ่งแล้วเงินเดิมพันจะถูกส่งกลับ
                                <br /> เดิมพันแพ้หากเกมไม่มีการให้คะแนน
                            </p>
                            <p>บรรทัดเป้าหมายต่ำกว่า 1
                                <br /> เดิมพันชนะหากเกมโดยไม่ได้ให้คะแนน
                                <br /> หากมีเป้าหมายอย่างใดอย่างหนึ่งแล้วเงินเดิมพันจะถูกส่งกลับ
                                <br /> เดิมพันแพ้ถ้ามีสองประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                            </p>
                            <p>
                                <br /> บรรทัดที่ 1 / 1.5</p>
                            <p>เส้นชัยเหนือ 1 / 1.5
                                <br /> เดิมพันชนะหากมีสองประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                                <br /> หากมีเป้าหมายอย่างน้อยครึ่งหนึ่งจะได้รับการคืนและครึ่งหนึ่งจะหายไป
                                <br /> เดิมพันแพ้หากเกมไม่มีการให้คะแนน
                            </p>
                            <p>เส้นประตูต่ำกว่า 1 / 1.5
                                <br /> เดิมพันชนะหากเกมโดยไม่ได้ให้คะแนน
                                <br /> หากมีเป้าหมายอย่างน้อยครึ่งหนึ่งของการเดิมพันจะชนะและครึ่งหนึ่งจะได้รับการส่งคืน
                                <br /> เดิมพันแพ้ถ้ามีสองประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                            </p>
                            <p>
                                <br /> เส้นประตู 1.5</p>
                            <p>เส้นชัยเหนือ 1.5
                                <br /> เดิมพันชนะหากมีสองประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                                <br /> เดิมพันแพ้ถ้ามี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน</p>
                            <p>เส้นประตูต่ำกว่า 1.5
                                <br /> เดิมพันชนะหากมี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน
                                <br /> เดิมพันแพ้ถ้ามีสองประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                            </p>
                            <p>
                                <br /> เป้าหมาย 1.5 / 2.0</p>
                            <p>เส้นชัยเหนือ 1.5 / 2
                                <br /> เดิมพันชนะหากมี 3 ประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                                <br /> หากมีสองเป้าหมายครึ่งหนึ่งของการเดิมพันจะชนะและครึ่งหนึ่งจะได้รับการส่งคืน
                                <br /> เดิมพันแพ้ถ้ามี 0, 1 หรือ 2 ประตูที่ทำแต้มได้ในการแข่งขัน</p>
                            <p>เส้นประตูต่ำกว่า 1.5 / 2
                                <br /> เดิมพันชนะหากมี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน
                                <br /> หากมีสองเป้าหมายครึ่งหนึ่งของการเดิมพันจะถูกส่งกลับและครึ่งหนึ่งจะหายไป
                                <br /> เดิมพันแพ้ถ้ามี 3 ประตูขึ้นไปในการแข่งขัน</p>
                            <p>
                                <br /> บรรทัดที่ 2</p>
                            <p>เส้นชัยเหนือ 2
                                <br /> เดิมพันจะชนะถ้ามี 3 ประตูหรือมากกว่านั้นในการแข่งขัน
                                <br /> หากมีเป้าหมายสองอย่างที่มีการส่งคืนเงินเดิมพัน
                                <br /> เดิมพันแพ้ถ้ามี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน</p>
                            <p>บรรทัดเป้าหมายต่ำกว่า 2
                                <br /> เดิมพันชนะหากมี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน
                                <br /> หากมีเป้าหมายสองอย่างที่มีการส่งคืนเงินเดิมพัน
                                <br /> เดิมพันแพ้ถ้ามี 3 ประตูขึ้นไปในการแข่งขัน</p>
                            <p>
                                <br /> บรรทัดที่ 2 / 2.5</p>
                            <p>เส้นชัยเหนือเส้น 2/2
                                <br /> เดิมพันชนะหากมี 3 ประตูหรือมากกว่าที่ทำประตูได้ในการแข่งขัน
                                <br /> หากมีสองเป้าหมายครึ่งหนึ่งของการเดิมพันจะถูกส่งกลับและครึ่งหนึ่งจะหายไป
                                <br /> เดิมพันแพ้ถ้ามี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน</p>
                            <p>เส้นประตูต่ำกว่า 2 / 2.5
                                <br /> เดิมพันชนะหากมี 0 หรือ 1 ประตูที่ทำแต้มได้ในการแข่งขัน
                                <br /> หากมีสองเป้าหมายครึ่งหนึ่งของการเดิมพันจะชนะและครึ่งหนึ่งจะได้รับการส่งคืน
                                <br /> เดิมพันแพ้ถ้ามี 3 ประตูขึ้นไปในการแข่งขัน</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 3}>
                        <p>European Handicap</p>
                            <p>แฮนดิแคปยุโรป (รวมถึงการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>มีสามทางเลือกสำหรับทีมที่บ้านเสมอและทีมเยือนถ้าการแข่งขันถูกเล่นในสถานที่ที่เป็นกลางทีมบ้านและทีมเยือนที่มีความแตกต่างบนจอแสดงผลเป็นพื้นฐาน
                                เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> แฮนดิแค็ปไลน์ 1 บอล - ทีมที่เริ่มเล่นบอล 1 ลูก</p>
                            <p>เดิมพันทีมชนะ:
                                <br /> ชนะโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 0: 1, แพ้ทีมในบ้าน, แพ้เดิมพัน
                                <br /> ผลการแข่งขัน 1: 0 - 1: 1, เสมอ, การเดิมพันแพ้
                                <br /> ผลการแข่งขัน 2: 0 - 2: 1 ชนะทีมในบ้านเดิมพันที่จะชนะ</p>
                            <p>
                                <br /> การวางเดิมพัน:
                            </p>
                            <p>-Win โดยตรง 1 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 0: 1, แพ้ทีมในบ้าน, แพ้เดิมพัน
                                <br /> ผลการแข่งขัน 1: 0 - 1: 1, เสมอ, เดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 2: 0 - 2: 1 ชนะทีมในบ้านเดิมพันเสีย</p>
                            <p>
                                <br /> เดิมพันชนะทีม:
                            </p>
                            <p>- เสียหรือแพ้โดยการเดิมพันใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 0: 1, แพ้ทีมในบ้าน, เดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 1: 0 - 1: 1, เสมอ, การเดิมพันแพ้
                                <br /> ผลการแข่งขัน 2: 0 - 2: 1 ชนะทีมในบ้านเดิมพันเสีย
                                <br /> Handicap Line 1 Ball - ทีมที่ได้รับการเริ่มต้นลูกบอลเต็มรูปแบบ</p>
                            <p>เดิมพันทีมชนะ:
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 1: 0 ชนะทีมในบ้านเดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 0: 1 - 1: 1, เสมอ, การเดิมพันแพ้
                                <br /> ผลการแข่งขัน 0: 2 - 1: 2, แพ้ทีมในบ้าน, แพ้เดิมพัน</p>
                            <p>
                                <br /> เดิมพันชนะทีม:
                            </p>
                            <p>- เล็งตรง 1 - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะโดยคะแนนใด ๆ หรือเสียโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 1: 0 ชนะทีมในบ้านเดิมพันเสีย
                                <br /> ผลการแข่งขัน 0: 1 - 1: 1, เสมอ, เดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 0: 2 - 1: 2, แพ้ทีมในบ้าน, แพ้เดิมพัน</p>
                            <p>
                                <br /> การวางเดิมพัน:
                            </p>
                            <p>- แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 1: 0 ชนะทีมในบ้านเดิมพันเสีย
                                <br /> ผลการแข่งขัน 0: 1 - 1: 1, เสมอ, การเดิมพันแพ้
                                <br /> ผลการแข่งขัน 0: 2 - 1: 2, แพ้ทีมในบ้าน, เดิมพันที่จะชนะ</p>
                            <p>
                                <br /> แฮนดิแค็ปไลน์ 2 บอล - ทีมที่เริ่มเล่นบอล 2 ลูก</p>
                            <p>เดิมพันทีมชนะ:
                                <br /> ชนะโดย 3 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 0: 2, แพ้ทีมในบ้าน, แพ้เดิมพัน
                                <br /> ผลการแข่งขัน 2: 0 - 2: 2, การเดิมพัน, การเดิมพัน
                                <br /> ผลการแข่งขัน 3: 0 - 3: 2 ชนะทีมในบ้านเดิมพันที่จะชนะ</p>
                            <p>
                                <br /> การวางเดิมพัน:
                            </p>
                            <p>-Win โดยตรง 2 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw หรือแพ้ด้วยคะแนนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 0: 2, แพ้ทีมในบ้าน, แพ้เดิมพัน
                                <br /> ผลการแข่งขัน 2: 0 - 2: 2, เสมอ, เดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 3: 0 - 3: 2 ชนะทีมในบ้านเดิมพันเสีย</p>
                            <p>
                                <br /> เดิมพันชนะทีม:
                            </p>
                            <p>- เสียหรือแพ้โดยการเดิมพันใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะโดย 3 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 0: 2, แพ้ทีมในบ้าน, เดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 2: 0 - 2: 2, การเดิมพัน, การเดิมพัน
                                <br /> ผลการแข่งขัน 3: 0 - 3: 2 ชนะทีมในบ้านเดิมพันเสีย</p>
                            <p>
                                <br /> Handicap Line 2 Ball - ทีมที่ได้รับการเริ่มต้นบอล 2 ครั้ง</p>
                            <p>เดิมพันทีมชนะ:
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 2: 0 ชนะทีมในบ้านเดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 0: 2 - 2: 2, การเดิมพัน, การเดิมพัน
                                <br /> ผลการแข่งขัน 0: 3 - 2: 3 ทีมแพ้ในบ้านเสียเงินเดิมพัน</p>
                            <p>
                                <br /> เดิมพันชนะทีม:
                            </p>
                            <p>-Lose โดยตรง 2 - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> ชนะด้วยคะแนนใด ๆ หรือเสียโดย 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 2: 0 ชนะทีมในบ้านเดิมพันเสีย
                                <br /> ผลการแข่งขัน 0: 2 - 2: 2, วาด, เดิมพันที่จะชนะ
                                <br /> ผลการแข่งขัน 0: 3 - 2: 3 ทีมแพ้ในบ้านเสียเงินเดิมพัน</p>
                            <p>
                                <br /> การวางเดิมพัน:
                            </p>
                            <p>- แพ้ 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - ชนะด้วยคะแนนหรือวาด - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                            <p>ตัวอย่าง:
                                <br /> ผลการแข่งขัน 0: 0 - 2: 0 ชนะทีมในบ้านเดิมพันเสีย
                                <br /> ผลการแข่งขัน 0: 2 - 2: 2, การเดิมพัน, การเดิมพัน
                                <br /> ผลการแข่งขัน 0: 3 - 2: 3, แพ้ทีมในบ้าน, เดิมพันที่จะชนะ</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 4}>
                        <p>ตลาดทั่วไป</p>
                            <p>โอกาสคู่ (รวมเงินเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>ทายผลสุดท้ายด้วยโอกาสคู่ สามารถเลือกเดิมพันได้:</p>
                            <p>1 หรือ 2 - หากผลที่ได้คือบ้านหรือนอกบ้านการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ</p>
                            <p>1 หรือ X - หากผลที่ได้คือบ้านหรือวาดแล้วการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ</p>
                            <p>X หรือ 2 - หากผลที่ได้คือการจับสลากหรือออกไปการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ</p>
                            <p>กำไรที่ได้รับ</p>
                            <p>ในช่วงเวลาทั้งเกมทั้งสองด้านเมื่อจบคะแนนสุดท้ายสถิติตามความแตกต่างระหว่างจำนวนคะแนนที่ทำแต้มโดยทีมที่ชนะและจำนวนคะแนนที่ทำแต้มโดยทีมที่แพ้
                                สามารถเลือกเดิมพันได้:
                            </p>
                            <p>เดิมพันทีมบ้านชนะและชนะคะแนนมากกว่า 2 คะแนน (ไม่รวม 2)</p>
                            <p>เดิมพันทีมบ้านชนะและชนะคะแนน 2 คะแนน</p>
                            <p>เดิมพันทีมบ้านชนะและชนะคะแนน 1 คะแนน</p>
                            <p>ทั้งสองทีมผูก</p>
                            <p>เดิมพันชนะไปและชนะคะแนนมากกว่า 2 คะแนน (ไม่รวม 2)</p>
                            <p>เดิมพันชนะไปชนะและชนะคะแนน 2 คะแนน</p>
                            <p>เดิมพันชนะไปชนะและชนะคะแนน 1 คะแนน</p>
                            <p>ครึ่งเวลา / เต็มเวลา</p>
                            <p>ครึ่งเวลา / เต็มเวลาหมายถึงการเดิมพันเพื่อคาดการณ์ผลการแข่งขันครึ่งเวลาและผลการแข่งขันเต็มเวลาของการแข่งขัน สามารถเลือกเดิมพันได้:</p>
                            <p>ทีมเจ้าบ้าน / ทีมเจ้าบ้าน: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ</p>
                            <p>ทีมเจ้าบ้าน / เสมอ: ทีมเจ้าบ้านชนะในช่วงพักครึ่งและจบเกมทั้งสองทีมเสมอ</p>
                            <p>ทีมเจ้าบ้าน / ทีมเยือน: ทีมที่บ้านชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ</p>
                            <p>วาด / ทีมเจ้าบ้าน: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเจ้าบ้านชนะ</p>
                            <p>วาด / วาด: ทั้งสองทีมผูกในช่วงพักครึ่งและจบเกมทั้งสองทีมผูก</p>
                            <p>ทีมวาดภาพ / นอกทีม: ทั้งสองทีมเสมอกันในช่วงพักครึ่งและจบเกมที่ทีมเยือนชนะ</p>
                            <p>ทีมเยือน / ทีมเจ้าบ้าน: ทีมเยือนชนะครึ่งหลังและจบเกมที่ทีมเจ้าบ้านชนะ</p>
                            <p>ทีมเยือน / ทีมเยือน: ทีมเยือนชนะครึ่งหลังและจบเกมทั้งสองทีมเสมอ</p>
                            <p>ทีมเยือน / ทีมเยือน: ทีมเยือนชนะในช่วงพักครึ่งและจบเกมทีมเยือนชนะ</p>
                            <p>ผลสกอร์ (รวม)</p>
                            <p>จำนวนรวมของเป้าหมายที่เกมทั้งสองทีมบวกการคำนวณทั้งหมด ตัวเลือกเดิมพันคือเป้าหมาย 0-1, 2-3 ประตู 4-5 ประตูและ 6 ประตูและอื่น
                                ๆ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ประตูรวม (เดิมพันครึ่งหลัง / ครึ่งหลัง)</p>
                            <p>จำนวนประตูทั้งหมดครึ่งเกมทั้งสองทีมบวกกับการคำนวณทั้งหมด สามารถเลือกวางเดิมพันได้: ไม่มีเป้าหมาย 1 ประตู 2 ประตูและอื่น
                                ๆ</p>
                            <p>สกอร์เจ้าบ้าน / ทีมเยือน</p>
                            <p>ตัดสินโดยเป้าหมายทั้งหมดของทีมบ้าน / นอก สามารถเลือกเดิมพันได้: ไม่มีเป้าหมาย 1goal, 2goals, 3goals และอื่น ๆ เล่น 90
                                นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>เป้าหมายทั้งหมด (ตรง)</p>
                            <p>จำนวนรวมของเป้าหมายที่เกมทั้งสองทีมบวกการคำนวณทั้งหมด ตัวเลือกเดิมพันคือ 1, 2, 3, 4, 5 และ 6 เป้าหมายและอื่น ๆ เล่น 90
                                นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ผลรวม (รวมเงินเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>การเดิมพันที่กำหนดโดยจำนวนรวมของคะแนนในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ยอดรวมเจ้าบ้าน / ทีมเยือน (รวมการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>ทำนายคะแนนสุดท้ายของทีม หากทีมที่บ้าน / ทีมเยือนทำแต้มได้มากกว่าโอเวอร์ / อันเดอร์ไลน์ที่กำหนดไว้ล่วงหน้า ถ้าคะแนนของทีมบ้านเกิด
                                / นอกทีมมีค่าน้อยกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>คี่ / คู่ (รวมการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>เป้าหมายที่แปลกและไม่เท่ากันหมายถึงการแข่งขันทีมสุดท้ายผลรวมคะแนนรวมในการตัดสินเดิมพัน เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ทีมเยือน / นอกบ้าน / นอกบ้าน</p>
                            <p>ตัดสินโดยเป้าหมายทั้งหมดของทีมบ้าน / นอก เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>เสมอเดิมพัน (รวมการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>หากผลการแข่งขันรอบสุดท้ายหลังจากเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการเดิมพันการเดิมพันทั้งหมดจะได้รับการคืนเงิน</p>
                            <p>การแข่งขันจะตัดสินอย่างไร?</p>
                            <p>ทีมทำนายบ้านหรือทีมเยือนชนะ; และในเวลาปกติหรือค่าล่วงเวลาหรือโทษที่จะชนะเกม</p>
                            <p>คะแนนที่ถูกต้อง (รวมการเดิมพันครึ่งแรก / ครึ่งหลัง)</p>
                            <p>คะแนนที่ถูกต้องหมายถึงการเดิมพันเพื่อทำนายคะแนนสุดท้ายเมื่อสิ้นสุดการแข่งขันเต็มเวลา ตัวเลือก "อื่น ๆ " บ่งชี้ว่าถ้าผลของตัวเลือกที่ไม่ใช่ด้านในออกตัวเลือก
                                "อื่น ๆ " จะชนะ เฉพาะเวลาปกติการทำงานล่วงเวลาและการยิงลูกโทษเท่านั้นไม่นับรวม เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ครึ่งเวลา / คะแนนเต็มเวลาที่ถูกต้อง</p>
                            <p>ครึ่งหลัง / Fulltime Score ที่ถูกต้องหมายถึงการเดิมพันเพื่อทำนายคะแนนครึ่งเวลาและคะแนนเต็มเวลา เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>Matchbet และ Totals (รวมเดิมพันครึ่งแรก)</p>
                            <p>Matchbet และ Total หมายถึงการเดิมพันทั้งสองทำนายว่าการแข่งขันจะส่งผลให้ชนะในบ้านหรือชนะไปหรือเสมอหรือไม่ และจำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของเหตุการณ์จะเกินหรือต่ำกว่า</p>
                            <p>มีตัวเลือกการเดิมพันดังต่อไปนี้:</p>
                            <p>เดิมพันเยือนและชนะ - เดิมพันจะชนะถ้าทีมเยือนชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>Draw &amp; Over - เดิมพันจะชนะถ้าผลการแข่งขันที่เกิดขึ้นในการวาดและเป้าหมายทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>บ้านและหลัง - เดิมพันชนะหากทีมเจ้าบ้านชนะและประตูรวมอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>การเดิมพันและระหว่างการเดิมพันจะชนะถ้าทีมเยือนชนะและประตูรวมอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>วาดและใต้ - เดิมพันจะชนะหากผลการแข่งขันที่ได้รับในการวาดและเป้าหมายทั้งหมดอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>บ้านและที่อยู่ต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า</p>
                            <p>ทั้งสองทีมทำคะแนน</p>
                            <p>ทั้งสองทีมทำแต้มได้ การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว</p>
                            <p>ช่วงทดรอบแรก 10 นาที</p>
                            <p>ทำนายเป้าหมายแรกของเกมช่วงนาที เวลาที่บาดเจ็บนับเป็นนาที 45/90 ระยะเวลาของช่วงเวลา: 10 นาที หากเวลาดังกล่าวไม่ปรากฏขึ้นตามรายการโทรทัศน์ที่มีช่วงเวลา
                                สามารถเลือกเดิมพันได้:
                            </p>
                            <p>00:00 - 10:00 น</p>
                            <p>10:01 - 20:00 น</p>
                            <p>20:01 - 30:00 น</p>
                            <p>30:01 - 40:00 น</p>
                            <p>40:01 - 50:00 น</p>
                            <p>50:01 - 60:00 น</p>
                            <p>60:01 - 70:00 น</p>
                            <p>70:01 - 80:00 น</p>
                            <p>80:01 - 90:00 นาทีไม่มีเป้าหมาย</p>
                            <p>ช่วงทดรอบแรก 15 นาที</p>
                            <p>ทำนายเป้าหมายแรกของเกมช่วงนาที จำนวนครั้งที่บาดเจ็บเป็นนาที 45/90 ระยะเวลาของช่วงเวลา: 15 นาที หากเวลาดังกล่าวไม่ปรากฏขึ้นตามรายการโทรทัศน์ที่มีช่วงเวลา
                                สามารถเลือกเดิมพันได้:
                            </p>
                            <p>00:00 - 15:00 น</p>
                            <p>16:00 - 30:00 น</p>
                            <p>31.00 น. - 45.00 น</p>
                            <p>46:00 - 60:00 น</p>
                            <p>61:00 - 75:00 น</p>
                            <p>76:00 - 90:00 น</p>
                            <p>ไม่มีเป้าหมาย</p>
                            <p>หากการแข่งขันหลังจากที่ทำประตูแรกแล้วการเดิมพันทั้งหมดจะถูกต้อง</p>
                            <p>หากการแข่งขันก่อนที่ประตูแรกจะยกเลิกการเดิมพันทั้งหมดจะถือเป็นโมฆะ</p>
                            <p>หน้าแรกไม่มีเดิมพัน</p>
                            <p>เกมทำนายคือการเสมอกันหรือชนะไปทีม หากทีมในบ้านชนะการเดิมพันทั้งหมดถือเป็นโมฆะ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ไม่มีเดิมพัน</p>
                            <p>เกมทำนายคือการดึงหรือชนะทีมในบ้าน หากทีมเยือนชนะการเดิมพันทั้งหมดถือเป็นโมฆะ</p>
                            <p>เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>Matchflow</p>
                            <p>ทำนายเป้าหมายแรกของทีมและผลสุดท้าย สามารถเลือกเดิมพันได้:</p>
                            <p>ทีมแรกชนะก่อนและทีมบ้านชนะ</p>
                            <p>ทีมแรกทำแต้มได้ก่อนเสมอ</p>
                            <p>ทีมแรกทำประตูแรกและทีมเยือนชนะ</p>
                            <p>ทีมเยือนทำประตูแรกและทีมบ้านชนะ</p>
                            <p>ทีมเยือนได้คะแนนเป็นอันดับแรกและเสมอกัน</p>
                            <p>ทีมเยือนทำประตูแรกและทีมเยือนที่จะชนะ</p>
                            <p>ทีมใดทำสกอร์ได้</p>
                            <p>การคาดการณ์คะแนนของทีม สามารถเลือกเดิมพันได้: เฉพาะบ้านเดี่ยวเท่านั้นทั้งสองทีมหรือไม่มีเลย เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>Matchbet และทั้งสองทีมทำประตู (รวมเดิมพันครึ่งแรก)</p>
                            <p>Matchbet และทั้งสองทีมทำสกอร์หมายถึงการเดิมพันทั้งทำนาย: ทีมใดชนะเวลาปกติและทั้งสองทีมจะทำประตูได้อย่างน้อยหนึ่งประตู
                                เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ทั้งสองทีมทำสกอร์และผลรวม</p>
                            <p>ทั้งสองทีมทำสกอร์และผลรวมหมายถึงการเดิมพันทั้งสองทำนาย: ทั้งสองทีมจะได้ประตูอย่างน้อยหนึ่งประตูและคะแนนสุดท้ายจะมากหรือน้อยกว่าเส้นรวมที่กำหนดหลังจากเวลาปกติ
                                เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ทุกครั้งที่ทำประตู</p>
                            <p>เดิมพันที่ผู้เล่นทำประตูในเกม เป้าหมายของตัวเองไม่นับ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>ผู้ทำประตูสุดท้าย</p>
                            <p>การเดิมพันที่ผู้เล่นทำประตูสุดท้าย เป้าหมายของตัวเองไม่นับ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>10 นาทีแรก -3 วิธี</p>
                            <p>1X2 (3way), เดิมพันที่ทีมชนะ การเดิมพันมีเพียง 1-10 นาทีเท่านั้น</p>
                            <p>1: ถ้าทีมบ้านชนะเดิมพันตัวเลือกนี้จะชนะ</p>
                            <p>X: ถ้าทั้งสองทีมเสมอกันเดิมพันตัวเลือกจะชนะ</p>
                            <p>2: ถ้าทีมเยือนชนะเดิมพันตัวเลือกจะชนะ</p>
                            </div>
                        <div className="centerDetail" hidden={this.state.current !== 5}>
                        <p>ตลาดการเตะมุม</p>
                            <p>เตะมุมรวม (รวมเดิมพันครึ่งแรก)</p>
                            <p>มุมรวมหมายถึงการเดิมพันที่กำหนดโดยจำนวนรวมของมุมในผลสุดท้ายของการแข่งขัน เล่น 90 นาทีเท่านั้นไม่มีเวลาเพิ่มพิเศษ ถ้ามุมรวมมากกว่าเส้นแบ่งเหนือ
                                / ใต้เส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง ถ้ามุมรวมน้อยกว่าเส้นสูงกว่าหรือต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้</p>
                            <p>
                                <br /> มุม คี่ / คู่ (รวมเดิมพันครึ่งแรก)</p>
                            <p>คานและแม้แต่คี่ถูกกำหนดโดยทีมผลการแข่งขันรอบสุดท้ายบวกมุมรวมเพื่อพิจารณาการเดิมพัน เล่น 90 นาทีเท่านั้นไม่มีเวลาเพิ่มพิเศษ
                                แปลกและแม้กระทั่งหมายถึงการเดิมพันผลการแข่งขันในช่วงครึ่งแรกจากครึ่งมุมแรกที่จะตัดสิน
                            </p>
                            <p>
                                <br /> มุมรวม (รวม)</p>
                            <p>จำนวนรวมของมุมเกมทั้งสองทีมรวมทั้งการคำนวณทั้งหมด ตัวเลือกเดิมพันคือลูก 0-8 ลูก 9-11 และลูก 12 ตัวขึ้นไป เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> ครึ่งแรก - มุมรวม (รวม)</p>
                            <p>จำนวนรวมของมุมเกมทั้งสองทีมรวมทั้งการคำนวณทั้งหมด ตัวเลือกการเดิมพันคือลูก 0-4 ลูก 5-6 ลูกและลูกบอลเจ็ดลูกและอีกมากมาย
                                ผลการตัดสินจะถูกตัดสินโดยรวมในครึ่งเวลา</p>
                            <p>
                                <br /> ทีมเยือน / ทีมเยือนจำนวนมุม</p>
                            <p>เดิมพันทีมเยือน / ทีมเยือนชนะจำนวนรวมของการเตะมุม ตัวเลือกเดิมพันคือลูกบอล 0-2 ลูกบอล 3-4 ลูก 5-6 ลูกและลูกบอลเจ็ดลูกและอีกมากมาย
                                เล่น 90 นาทีเท่านั้นไม่มีเวลาเพิ่มพิเศษ</p>
                            <p>
                                <br /> ครึ่งแรก - ทีมเจ้าบ้าน / ทีมเยือนจำนวนมุม</p>
                            <p>เดิมพันทีมเยือน / ทีมเยือนชนะจำนวนรวมของการเตะมุม ตัวเลือกเดิมพันคือลูก 0-1, 2 ลูก, 3 ลูกและ 4 ลูกและอื่น ๆ ผลการตัดสินจะถูกตัดสินโดยรวมในครึ่งเวลา</p>
                            <p>
                                <br /> Matchbet มุม (รวมเดิมพันครึ่งแรก)</p>
                            <p>เดิมพันว่าทีมใดจะได้มุมมากที่สุดระหว่างเกมในการเล่นปกติ ตัวเลือกการเดิมพันคือทีมบ้านทีมเยือนและเสมอกัน หากการแข่งขันถูกเล่นในสถานที่ที่เป็นกลางทีมแรกที่ถือว่าเป็นทีมแรกในการเดิมพัน
                                เล่น 90 นาทีเท่านั้นไม่มีเวลาเพิ่มพิเศษ</p>
                            <p>
                                <br /> แฮนดิแค็ปตัดเชือก (รวมครึ่งแรก)</p>
                            <p>มีสองทางเลือกสำหรับทีมที่บ้านและทีมเยือนหากการแข่งขันถูกเล่นที่สถานที่กลางทีมบ้านและทีมเยือนที่มีความแตกต่างบนหน้าจอแสดงผลเป็นพื้นฐาน
                                เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>แฮนดิแคปไลน์ 0.5 ลูก
                                <br /> ทีมที่เริ่มต้นลูก 0.5:
                                <br /> - ชนะโดยจำนวนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> - เลสตามหมายเลขใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> ทีมที่ได้รับลูกบอล 0.5 ลูกขึ้น:
                                <br /> - ชนะโดยจำนวนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - เลสตามหมายเลขใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> แฮนดิแค็ปไลน์มุม 1.5 ลูก</p>
                            <p>ทีมที่ให้ลูกเริ่มต้น 1.5 ลูก:
                                <br /> ชนะโดย 2 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> - เลสตามหมายเลขใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> ทีมที่ได้รับลูกบอล 1.5 ลูกขึ้น:
                                <br /> - ชนะโดยจำนวนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 2 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> แฮนดิแค็ปไลน์มุม 2.5 ลูก</p>
                            <p>ทีมที่ให้ลูกบอล 2.5 ลูกขึ้น:
                                <br /> ชนะโดย 3 หรือมากกว่า - เดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> - เลสตามหมายเลขใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้
                                <br /> ทีมที่ได้รับลูกบอล 2.5 ลูกขึ้น:
                                <br /> - ชนะโดยจำนวนใด ๆ - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> -Draw - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้ชนะ
                                <br /> - แพ้ 3 หรือมากกว่า - การเดิมพันทั้งหมดในการเลือกนี้เป็นผู้แพ้</p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 6}>
                        <p>ตลาดการโดนใบเหลือง-แดง</p>
                            <p>จำนวนรวมของการโดนใบเหลือง-แดง (รวมการเดิมพันครึ่งแรก)</p>
                            <p>การเดิมพันที่กำหนดโดยจำนวนการจองในผลสุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นเกิน / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลชนะจะอยู่ภายใต้ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> จำนวนรวมของการโดนใบเหลือง-แดง (รวมการเดิมพันครึ่งแรก)</p>
                            <p>การเดิมพันที่กำหนดโดยจำนวนคะแนนสะสมทั้งหมดในผลลัพธ์สุดท้ายของการแข่งขัน หากผลรวมเกินกว่าเส้นสูงกว่า / ต่ำกว่าเส้นที่กำหนดไว้แล้วผลที่ชนะจะจบลง
                                หากผลรวมต่ำกว่าเส้นแบ่งเหนือ / ใต้เส้นที่กำหนดไว้ล่วงหน้าผลการชนะจะอยู่ภายใต้การเล่น 90 นาทีเท่านั้นการต่อเวลาพิเศษและการลงโทษไม่นับ</p>
                            <p>
                                <br /> จำนวนการโดนใบเหลือง-แดง Home / Away</p>
                            <p>เดิมพันทีมบ้านหรือทีมเยือนจะได้รับไพ่ป๊อกจำนวนมาก สามารถเดิมพันตัวเลือกคือ: 0-1, 2, 3, และ 4 และอื่น ๆ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> ครึ่งแรก - จำนวนการโดนใบเหลือง-แดง เจ้าบ้าน / ทีมเยือน</p>
                            <p>เดิมพันทีมบ้านหรือทีมเยือนในครึ่งแรกจะมีกี่ใบโทษ สามารถเดิมพันตัวเลือกคือ: 0, 1, 2, 3 และอื่น ๆ</p>
                            <p>
                                <br /> ทีมแรกที่โดนใบเหลือง-แดง(รวมเดิมพันครึ่งแรก)
                            </p>
                            <p>เดิมพันที่ทีมได้รับโทษทัณฑ์แรกในการเล่นปกติหรือครึ่งแรก สามารถเดิมพันตัวเลือกคือ: บ้านห่างและไม่มี</p>
                            <p>
                                <br /> การเดิมพันแบบแมทช์ (รวมเดิมพันครึ่งแรก)</p>
                            <p>เดิมพันว่าทีมใดจะได้รับการจองมากที่สุด สามารถเดิมพันตัวเลือกคือ: บ้านห่างและไม่มี</p>
                            <p>
                                <br /> คะแนนสะสมรวม
                            </p>
                            <p>จำนวนรวมของคะแนนสะสมสำหรับทั้งสองทีมในช่วงเวลาปกติ สามารถเลือกเดิมพันได้: 0-30, 31-45, 46-60, 61-75 และ 76 ขึ้นไป เล่น
                                90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ
                            </p>
                            <p>
                                <br /> ครึ่งแรก - คะแนนสะสมรวม</p>
                            <p>จำนวนรวมของคะแนนการจองสำหรับทั้งสองทีมในช่วงครึ่งแรก สามารถเลือกเดิมพันได้: 0-10, 11-25, 26-40 และ 41 ขึ้นไป</p>
                            <p>
                                <br /> การโดนใบเหลือง-แดงที่แน่นอน (รวมเดิมพันครึ่งแรก)</p>
                            <p>เดิมพันจำนวนที่แน่นอนของการจองทั้งหมดสำหรับทั้งสองทีมที่กำหนดในระหว่างการแข่งขัน เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ
                                การเดิมพันครึ่งแรกจะพิจารณาจากผลของครึ่งแรก
                            </p>
                        </div>
                        <div className="centerDetail" hidden={this.state.current !== 7}>
                        <p>ตลาดในการเล่น</p>
                            <p>ในการเล่น - 3-way (เฉพาะ OT เท่านั้น)</p>
                            <p>1X2 (3way), เดิมพันที่ทีมชนะ การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - ล่วงเวลาครึ่งแรกครึ่งทาง</p>
                            <p>1X2 (3way), เดิมพันที่ทีมชนะ การเดิมพันมีเฉพาะการทำงานล่วงเวลาครึ่งแรกเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - รวม (OT เท่านั้น!)</p>
                            <p>ยอดรวมถูกกำหนดโดยคะแนนทัวร์นาเมนท์เพื่อพิจารณาการเดิมพัน การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - ใครชนะในส่วนที่เหลือของการแข่งขัน (OT เท่านั้น!)?</p>
                            <p>การเดิมพันจะได้รับการยอมรับหลังจากการตัดสินเดิมพัน, เวลาที่เหลืออยู่ในการให้คะแนนการแข่งขันจะมีผลเหนือกว่า ในการเดิมพันใด
                                ๆ ที่ได้รับการยอมรับก่อนที่ลูกบอลจะไม่นับ สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและเสมอกัน การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - แฮนดิแค็ทในเอเชียทำงานล่วงเวลา</p>
                            <p>การเดิมพันทั้งหมดในตลาดเอเชียแฮนดิแคปอินแกรมจะตัดสินตามเส้นคะแนนสำหรับส่วนที่เหลือของเกม / ครึ่งหลังการวางเดิมพันเช่น
                                เป้าหมายใด ๆ ก่อนวางเดิมพันจะถูกเพิกเฉยเพื่อจุดประสงค์ในการชำระบัญชี การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - แฮนดิแคปเอเชียล่วงเวลาครึ่งแรก</p>
                            <p>การเดิมพันทั้งหมดในตลาดเอเชียแฮนดิแคปอินแกรมจะตัดสินตามเส้นคะแนนสำหรับส่วนที่เหลือของเกม / ครึ่งหลังการวางเดิมพันเช่น
                                เป้าหมายใด ๆ ก่อนวางเดิมพันจะถูกเพิกเฉยเพื่อจุดประสงค์ในการชำระบัญชี การเดิมพันมีเฉพาะการทำงานล่วงเวลาครึ่งแรกเท่านั้น</p>
                            <p>
                                <br /> In-Play - ทีมใดจะชนะการยิงลูกโทษ</p>
                            <p>เดิมพันทีมที่ชนะการลงโทษ สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือน</p>
                            <p>
                                <br /> ในการเล่น - ประตูต่อไป</p>
                            <p>การเดิมพันเริ่มจากช่วงเวลาที่ทีมไปถึงเป้าหมายถัดไป สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและไม่มีเป้าหมาย เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> ในการเล่น - ประตูต่อไป (เฉพาะ OT เท่านั้น)</p>
                            <p>การเดิมพันเริ่มจากช่วงเวลาที่ทีมไปถึงเป้าหมายถัดไป สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและไม่มีเป้าหมาย การเดิมพันมีเฉพาะการทำงานล่วงเวลาเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - ประตูต่อไป (การลงโทษการลงโทษ)</p>
                            <p>การเดิมพันเริ่มจากช่วงเวลาที่ทีมไปถึงเป้าหมายถัดไป สามารถเดิมพันตัวเลือกคือทีมบ้านทีมเยือนและไม่มีเป้าหมาย การเดิมพันจะมีการยิงลูกโทษเท่านั้น</p>
                            <p>
                                <br /> ในการเล่น - จะมีการทำประตูเกิดขึ้นเมื่อไหร่</p>
                            <p>เดิมพันเริ่มจากช่วงเวลาเป้าหมายถัดไปของเวลา สามารถเดิมพันได้ตั้งแต่เวลา 00:00 น. - 15:00 น. 16:00 น. - 30:00 น. 31:00
                                น. - 45:00 น. 46:00 - 60:00 น. 61:00 - 75:00 น. 76:00 - 90 : 00 นาทีไม่มีเป้าหมาย</p>
                            <p>
                                <br /> In-Play - รวม เตะมุม ทีมเยือน / เจ้าบ้าน (รวมเดิมพันครึ่งแรก)</p>
                            <p>มุมทั้งหมดถูกกำหนดโดยมุมของเหตุการณ์เพื่อพิจารณาเดิมพัน คุณสามารถเดิมพันทีมบ้านหรือทีมเยือนได้ เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ
                                การเดิมพันช่วงพักครึ่งหมายถึงผลการแข่งขันที่กำหนดโดยอีเกิ้ล
                            </p>
                            <p>
                                <br /> In-Play - Bookingbet</p>
                            <p>1X2 (3way), เดิมพันที่ทีมจะชนะการเดิมพัน เล่น 90 นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ</p>
                            <p>
                                <br /> In-Play - การโดนใบเหลือง-แดง เจ้าบ้าน / นอกทีม (รวมเดิมพันครึ่งแรก)</p>
                            <p>ทีมสำรอง / ทีมเยือนได้รับการกำหนดโดยการจองการแข่งขันเพื่อตัดสินเดิมพัน คุณสามารถเดิมพันทีมบ้านหรือทีมเยือนได้ เล่น 90
                                นาทีเท่านั้นพิเศษเวลาและการลงโทษไม่นับ การเดิมพันช่วงพักครึ่งหมายถึงผลการแข่งขันที่กำหนดโดยครึ่งเวลา
                            </p>
                        </div>
                    </div>
                    
               
                </Grid>
            </Grid>
            
        </div>
      );
    }
  }

  const mapStateToProps = (state) => {
    const { token } = state.auth;
    return {
        isAuthenticated: (token !== null && token !== undefined),
        error: state.auth.error,
        lang: state.language.lang,
        showAnnouncements: state.general.show_letou_announcements,
    }
}


BetRuleThreeTh.propTypes = {
    classes: PropTypes.object.isRequired,
    callback: PropTypes.func,
};

export default withStyles(styles)(injectIntl(withRouter(connect(mapStateToProps, {
    show_letou_announcements
})(BetRuleThreeTh))));