import React from 'react';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import { injectIntl } from 'react-intl';
import { withRouter } from 'react-router-dom';
import { connect } from 'react-redux';

import Grid from '@material-ui/core/Grid';
import IconHeader from "../../icon_header";
import '../../../css/help.css'

import { show_letou_announcements} from '../../../../actions';


const styles = theme => ({
   
    content : {
        display: 'flex',
        paddingRight: 400,
    },
    infoSelect : {
        paddingLeft: 300,
        display: 'flex',
        flexDirection: 'column',
    },
    aboutUsDetail : {
       fontSize: '14px',
    },
    helpCenterArticleColumn: {
        fontSize: '14px',
        listStyleType: 'none',
    }
})

export class GeneralRulesTh extends React.Component {
    
    getLabel(labelId) {
        const { formatMessage } = this.props.intl;
        return formatMessage({ id: labelId });
    }

    render() {
  
      const { classes } = this.props;
  
      return (
       
        <div className={classes.root}> 
            <IconHeader/>
            <Grid container className={classes.content}>
                <Grid item xs={5} className={classes.infoSelect}>
                <div className="HelpCenterLeftNav">
                            <ul>
                                <li>
                                    <a href="/th/for_member">{this.getLabel('for-member')}</a>
                                </li>
                                <li>
                                    <a href="/th/for_partner">{this.getLabel('for-partner')}</a>
                                </li>
                            </ul>
                        </div>
                </Grid>
            
                <Grid item xs={7} className={classes.detail}>
                    <div className="HelpCenterList">
                    <ul>
                            <li>
                                <a href="/th/for_member">บริการแก่สมาชิกใช้  >
                                    <i></i>
                                </a>
                            </li>
                            <li>
                                <a href="/th/for_member">กติกากีฬา OW Sports Rules >
                                    <i></i>
                                </a>
                            </li>
                        </ul>
                    </div>
                    <div id="HelperCenterDetail">
                        <h2>2. ศูนย์ช่วยเหลือสมาชิกวิธีการวางเดิมพันและให้กฎกติกาการเดิมพันกีฬา (กฎการเดิมพัน) </h2>
                        <p>
                            <br /> ทั่วไป
                            <br /> 2.1.1
                            <br /> Outright
                            <br /> 2.1.1.1
                            <br /> หมายถึงการเดิมพันผู้ชนะการแข่งขันการแข่งขันหรือการแข่งขัน
                            <br /> 2.1.1.2
                            <br /> การวางเดิมพันอย่างถูกต้องหมายถึงการเดิมพันคู่แข่งที่เติมในที่ที่กำหนดในการแข่งขันการแข่งขันกีฬา จำนวนสถานที่ที่จ่ายเป็นผู้ชนะจะระบุไว้ในชื่อในตลาดเดิมพัน.
                            <br /> 2.1.1.3
                            <br /> หากนักกีฬา / ผู้เล่นไม่ได้เข้าร่วมการแข่งขันการแข่งขันหรือการแข่งขันการเดิมพันที่สมบูรณ์แบบของผู้แข่งขัน / ผู้เล่นนั้นจะเป็นโมฆะ.
                            <br /> 2.1.1.4
                            <br /> หากมีผู้ชนะสองคนหรือมากกว่าหรือมีผลได้เสียเท่ากัน "Dead Heat"อัตราต่อรองการจ่ายเงินจะถูกหารด้วยจำนวนของผู้ชนะเงินเดิมพันจะถูก
                            แบ่งตามสัดส่วนเท่าๆกัน
                            <br /> นี่เป็นตัวอย่างสำหรับ ENGLISH PREMIER LEAGUE ผู้ทำประตูสูงสุดมีผู้ทำประตูสูงสุด 2 รายซึ่งแสดงตัวอย่างการคำนวณอัตราการจ่าย
                            <br /> การจ่ายเงินจะเป็น: เดิมพัน / ผู้ชนะ x (odds-1) = การจ่ายเงิน (หากผู้ทำประตูสูงสุดมีผู้เล่นมากกว่า 2 คน = จำนวนหุ้น
                            / จำนวนคน)
                            <br /> ตัวอย่างเช่น:
                            <br /> ภาษาอังกฤษ LEAGUE ระดับพรีเมียร์ - ผู้เล่น Goalscorer ยอดเยี่ยม
                            <br /> Dimitar Berbatov 1.40
                            <br /> Carlos Tevez 3.50
                            <br /> ถ้าฉันวางเดิมพัน 100 ที่ Dimitar Berbatovwith odds 1.40.
                            <br /> ถ้าผู้ทำประตูสูงสุดมี 2 คน
                            <br /> การจ่ายเงินของฉันจะเป็น: = เดิมพัน 100/2 x (ราคาต่อหน่วย - 1) = 20
                            <br /> ถ้าฉันวางเดิมพัน 100 ที่ Carlos Tevez ด้วยอัตราเดิมพัน 3.50
                            <br /> ถ้าผู้ทำประตูสูงสุดมี 2 คน
                            <br /> การจ่ายเงินของฉันจะเป็น: = เดิมพัน 100/2 x (ราคาต่อหน่วย - 1) = 125
                            <br /> 2.1.1.5
                            <br /> คำว่า "ผู้เล่นอื่นใด" (ทีมอื่น ๆ ) หมายถึงคู่แข่งทั้งหมดที่ไม่ได้ตั้งชื่อในตลาด
                            <br /> 2.1.2
                            <br /> Moneyline
                            <br /> 2.1.2.1
                            <br /> Moneyline หมายถึงการเดิมพันกับคู่แข่งหรือทีมหนึ่งคนเพื่อเอาชนะผู้แข่งขันอีกรายหนึ่งในการแข่งขันหรือวางเดิมพันที่สูงขึ้นในการแข่งขัน
                            กฎของ Moneyline ที่เหลืออยู่ในกฎการเดิมพันของเหตุการณ์เฉพาะ
                            <br /> 2.1.2.2
                            <br /> คำว่า "ฟิลด์" หมายถึงคู่แข่งทั้งหมดที่ไม่ใช่คู่แข่งที่มีชื่ออยู่ใน Moneyline ตรง
                            <br /> 2.1.3
                            <br /> แฮนดิแคป (HDP), แฮนดิแค็ปครึ่งแรกและแฮนดิแค็ปครึ่งหลัง
                            <br />2.1.3.1
                            <br /> แฮนดิแค็ปหมายถึงแต้มต่อ เช่นเมื่อผู้แข่งขันหรือทีมได้รับแต้มต่อ(มีผลนำห่างก่อนการแข่งขันจะเริ่มต้น)ผู้ชนะคือ คู่แข่งขัน
                            หรือทีมที่มีคะแนนดีกว่าหลังจากรวมแฮนดิแคปที่ระบุในผลการแข่งขัน กฏแฮนดิแคปที่เหลือระบุอยู่ในกฏกติกาการเดิมพันแต่ละรายการ
                            <br /> 2.1.3.2
                            <br /> แฮนดิแค็ปครึ่งแรกหมายถึงแต้มต่อสำหรับคู่แข่งขัน หรือ ทีม ในครึ่งแรกของการแข่งขัน
                            <br /> 2.1.3.3
                            <br /> แฮนดิแค็ปครึ่งหลังหมายถึงแต้มต่อสำหรับคู่แข่งขัน หรือ ทีม ในครึ่งหลังของการแข่งขัน.
                            <br /> 2.1.4
                            <br /> สูง / ต่ำกว่า (OU), สูง/ ต่ำครึ่งแรก สูง / ต่ำ เต็มเวลา
                            <br /> 2.1.4.1
                            <br /> การเดิมพันสูง / ต่ำหมายถึงการเดิมพันที่กำหนดโดยจำนวนคะแนนทั้งหมด (เป้าหมายเกมส์ ฯลฯ ) ในผลการแข่งขันที่ผ่านมา หากผลรวมเกินกว่าสูงกว่าหรือต่ำกว่าที่กำหนดไว้
                            หากผลรวมต่ำกว่าเส้นแบ่งช่วงการเล่นสูง/ ต่ำกว่าที่กำหนดไว้.
                            <br /> 2.1.4.2
                            <br /> สูงต่ำครึ่งแรก หมายถึง การเดิมพันที่กำหนดโดยผลคะแนนรวมทั้งหมดของครึ่งเวลาแรก(ประตู/แต้ม/อื่นๆ)ในผลการตัดสินสุดท้ายของเหตุการณ์
                            หากผลรวมมากกว่า สูง/ต่ำ ที่กำหนดไว้ล่วงหน้า ผลชนะคือสูง หากผลรวมน้อยกว่า สูง/ต่ำที่กำหนดไว้ล่วงหน้า ผลชนะคือต่ำ
                            <br /> 2.1.4.3
                            <br /> สูง/ต่ำเต็มเวลา หมายถึง การเดิมพันที่กำหนดโดยผลคะแนนรวมทั้งหมดของการแข่งขันเต็มเวลา(ประตู/แต้ม/อื่นๆ)ในผลการตัดสินสุดท้ายของเหตุการณ์
                            หากผลรวมมากกว่า สูง/ต่ำ ที่กำหนดไว้ล่วงหน้า ผลชนะคือสูง หากผลรวมน้อยกว่า สูง/ต่ำที่กำหนดไว้ล่วงหน้า ผลชนะคือต่ำ
                            <br /> 2.1.5
                            <br /> Odd/Even (OE), ครึ่งแรก Odd/Even & เต็มเวลา Odd/Even
                            <br /> 2.1.5.1
                            <br /> Odd/Even หมายถึง การเดิมพันแบบทายผลรวมของจำนวน(goals, games etc)ซึ่งผลการแข่งขันจะเป็น คู่ หรือ คี่.
                            <br /> 2.1.5.2
                            <br /> คี่/คู่ ครึ่งเวลาแรก หมายถึงการเดิมพันที่กำหนดโดยจำนวนรวมครึ่งแรกของการแข่งขันเป็นจำนวนคี่หรือคู่
                            <br /> 2.1.5.3
                            <br /> คี่/คู่ เต็มเวลาหมายถึงการเดิมพันที่กำหนดโดยจำนวนรวมทั้งหมดของการแข่งขันเป็นจำนวนคี่หรือคู่
                            <br /> 2.1.5.4
                            <br /> การเดิมพันครึ่งแรกจะถือเป็นโมฆะหากเหตุการณ์ถูกยกเลิกก่อนหมดครึ่งแรก แต่ถ้าเหตุการณ์ถูกยกเลิกหลังจากครึ่งแรกการเดิมพันครึ่งแรกทั้งหมดจะมีผล
                            <br /> 2.1.6
                            <br /> ทีมเดียว คี่/คู่
                            <br /> 2.1.6.1
                            <br /> ทีมเดียว คี่ / คู่ ไม่ดีหมายถึงการเดิมพันสกอร์เต็มเวลา ของทีมนั้นๆ ในการแข่งขันจะจบลงเป็นจำนวนเลข คี่หรือคู่
                            <br /> 2.1.6.2
                            <br /> การเพิ่มเวลา/ต่อเวลาใด ๆ ในการแข่งขันจะไม่ถูกนับรวม ยกเว้นกีฬา บาสเก็ตบอล
                            <br /> 2.1.7
                            <br /> ทีมการแข่งขัน ครึ่งเวลา/ เต็มเวลา คี่ / คู่
                            <br /> 2.1.7.1
                            <br /> การเดิมพันเวลาครึ่งแรก / เต็มเวลา คี่/ คู่หมายถึงการเดิมพันเพื่อคาดการณ์ว่าผลการแข่งขันครึ่งเวลาและผลการแข่งขันแบบเต็มเวลาของการแข่งขันเป็นแบบคี่หรือคู่ตามลำดับ
                            คี่-คี่/คู่-คู่/คี่หรือ คู่/คู่
                            <br/> 2.1.7.2
                            <br /> มีสี่ตัวเลือกเพื่อเดิมพัน:
                            <br />*คี่ / คี่
                            <br /> *คี่ / คู่
                            <br /> *คู่/คี่
                            <br /> *คู่/คู่
                            <br /> 2.1.7.3
                            <br /> สำหรับประเภทการเดิมพันนี้กการเพิ่มเวลา/ต่อเวลาใด ๆ ในการแข่งขันจะไม่ถูกนับรวมกับการแข่งขันเต็มเวลา.
                            <br /> 2.1.8
                            <br /> บอลชุด
                            <br /> 2.1.8.1
                            <br /> บอลชุด หมายถึงการเดิมพันตั้งแต่2รายการขึ้นไป ใน1การวางเดิมพัน(บิล)หากทุกรายการเดิมพันชนะ บิลจะถูกพิจารณาเป็นบิลชนะ
                            และได้รับการจ่ายเงินตามจำนวนอัตราเดิมพันทั้งสองรายการ หากมี 1 รายการ (หรือมากกว่า)เป็นรายการที่แพ้ การวางเดิมนั้นจะถูกพิจารณาเป็น
                            บิลเสีย หรือ หากมี 1 รายการ หรือมากกว่า เป็นรายการที่มีการเปลี่ยนแปลงหรือเลื่อนการแข่งขัน อัตราเดิมพันในรายการนั้นจะนับอัตราการต่อรองเป็น1.00
                            .
                            <br /> 2.1.8.2
                            <br /> ระหว่างเดิมพันบอลชุดสด ถ้าการเดิมพันใด ๆ ในการเลือกถูกปฏิเสธจากนั้น บอลชุดจะไม่ถูกเดิมพัน br /> 2.1.8.3
                            <br /> โปรดดูที่ "Help" ในหน้าเดิมพัน บอลชุดสำหรับรายละเอียดเพิ่มเติม
                            <br /> 2.1.8.4
                            <br /> Trixie เป็นการวางเดิมพันแบบพาร์เลย์ 3 ทีม ในเหตุการณ์ที่แตกต่างกัน 4 รายการ ซึ่งมีชุด 2 ทีม 3รายการ และ ชุด3ทีม1
                            รายการ ซึ่งจะต้อง ชนะอย่างน้อย 2 ทีมจึงจะได้รับเงินรางวัล หากทั้ง 3 รายการนั้นชนะจะได้รับการจ่ายเงินเป็น 2เท่า หากรายการเดิมพันใดรายการหนึ่ง
                            หรือมากกว่า 1 รายการมีการเปลี่ยนแปลงหรือเลื่อนการแข่งขัน ราคาต่อรองจะปรับเป็น 1.00.
                            <br /> 2.1.8.5
                            <br /> การเดิมพันแบบ yankeeครอบคลุมการเดิมพัน ซึ่งประกอบด้วย 4 ตัวเลือกจากการแข่งขันที่ ต่างกัน ประกอบด้วย11ชุดการเดิมพัน.ชุด2ทีม
                            6 รายการ.ชุด3ทีม4รายการ หาก2รายการที่เลือกนั้นมีผลชนะจะมีการจ่ายเงินรางวัล 2 เท่า หากมีการชนะ มากกว่า3 รายการจะมีการคูณจำนวน2
                            เท่าก่อนจากนั้นจะมีการคูณเพิ่มอีก 1 เท่า หากมีการชนะทั้ง4 รายการ จะได้รับ6เท่า หากรายการเดิมพันใดรายการหนึ่ง หรือมากกว่า
                            1 รายการ มีการเปลี่ยนแปลงหรือเลื่อนการแข่งขันราคาต่อรองจะปรับเป็น 1
                            <br /> 2.1.8.6
                            <br /> แบบ Canadianประกอบไปด้วย 26 การเดิมพัน ประกอบไปด้วย 5 ตัวเลือกจากประเภทการเดิมพันต่างๆ การเดิมพันสองเท่า 10 รายการ
                            การเดิมพัน3เท่า 10 รายการ การเดิมพัน4เท่า 5 รายการและการเดิมพัน5เท่า 1 รายการ หาก2รายการที่เลือกนั้นมีผลชนะ จะมีการจ่ายเงินรางวัล
                            2เท่า หากมีการชนะ 4 รายการ จะได้รับ6 เท่าของชุด 2ทีม 4เท่าของชุด3ทีม และ1เท่าของชุด 5 ทีม หากรายการเดิมพันรายการใดรายการหนึ่งมีการเลื่อนการแข่งขัน
                            หรือมีการเปลี่ยนแปลง ราคาต่อรองจะปรับเป็น 1.
                            <br /> 2.1.8.7
                            <br /> แบบ heinz ครอบคลุมการเดิมพัน57รายการเดิมพัน ซึ่งประกอบไปด้วย 6 ตัวเลือกจากการแข่งขันที่ต่างกัน ชุดการเดิมพัน ,ชุด2ทีม
                            15 รายการ,ชุด3ทีม20รายการ,ชุด4ทีม 15 รายการ,ชุด 5ทีม 6 รายการ ,และชุด6ทีม 1 รายการ หาก2 รายการที่เลือกนั้นมีผลชนะจะมีการจ่ายเงินรางวัล
                            2เท่า หากมีการชนะ 5 รายการจะมีการจ่ายเงิน 10 เท่า หากมีการชนะทั้ง 6 รายการ จะมีการจ่ายเงินรางวัล 15 เท่าของชุด 2
                            ทีม,20เท่าของชุด3ทีม ,15เท่าของชุด4ทีม,6เท่าของชุด5ทีม และ 1เท่าของชุด6ทีม หากมีรายการใดเปลี่ยนแปลงหรือเลื่อนการแข่งขัน
                            อัตราต่อรองจะปรับเป็น 1.
                            <br /> 2.1.8.8
                            <br /> ซุปเปอร์แฮนซ์ ครอบคลุมการเดิมพันแบบหลายประเภทการเดิมพัน ซึ่งประกอบไปด้วย 7 ตัวเลือกจากการแข่งขันที่ต่างกัน ประกอบไปด้วย120ชุดการเดิมพัน
                            ชุด2ทีม21รายการ ชุด3ทีม 35รายการ ชุด4ทีม 35 รายการ ชุด5 ทีม21 รายการ ชุด6 ทีม7รายการและชุด7ทีม 1รายการ หาก2 รายการที่เลือกนั้นมีผลชนะจะมีการจ่ายเงินรางวัลเป็น
                            2เท่า หากมีการชนะ 6รายการ จะได้รับ 15เท่า หากมีการชนะทั้ง7รายการ จะได้รับ 21เท่าของชุด2ทีม 35เท่าของชุด 3ทีม 15เท่าของชุด4ทีม
                            21 เท่าของชุด5 ทีม7เท่าของชุด6ทีมและ1เท่าของชุด7ทีม หากการเดิมพันรายการใดมีการเปลี่ยนแปลงหรือเลื่อนการแข่งขันอัตราต่อรองจะปรับเป็น
                            1.
                            <br /> 2.1.8.9
                            <br /> Goliath รอบคลุมการเดิมพันแบบหลายประเภทการเดิมพัน ซึ่งประกอบไปด้วย 8 ตัวเลือกจากการแข่งขันที่ต่างกัน ประกอบไปด้วย247ชุดการเดิมพัน
                            ชุด2ทีม28รายการ ชุด3ทีม 56รายการ ชุด4ทีม 70รายการ ชุด5 ทีม56 รายการ ชุด6 ที28รายการ ชุด7ทีม 8รายการและชุด8ทีม 1รายการ
                            หาก2 รายการที่เลือกนั้นมีผลชนะจะมีการจ่ายเงินรางวัลเป็น 2เท่า หากมีการชนะ 7รายการ จะได้รับ21เท่า หากมีการชนะทั้ง8รายการ
                            จะได้รับ 21เท่าของชุด2ทีม 35เท่าของชุด 3ทีม 35เท่าของชุด4ทีม 21 เท่าของชุด5 ทีม7เท่าของชุด6ทีมและ1เท่าของชุด7ทีม
                            หากมีการชนะทั้ง8ทีมจะได้รับ 28เท่าของชุด2ทีม 56เท่าของชุด 3ทีม 70เท่าของชุด4ทีม 56 เท่าของชุด5 ทีม28เท่าของชุด6ทีม
                            8เท่าของชุด7ทีมและ1เท่าของชุด 8ทีม หากการเดิมพันรายการใดมีการเปลี่ยนแปลงหรือเลื่อนการแข่งขันอัตราต่อรองจะปรับเป็น
                            1
                            <br /> 2.1.8.10
                            <br /> LIVE ไม่ได้มีให้เลือกสำหรับ Trixie, Yankee, Canadian, Heinz, Super Heinz และ Goliath
                            <br /> 2.1.8.11
                            <br /> โปรดดูที่ไอคอน "" ในเมนูเดิมพันในหน้าการเดิมพันแบบผสมเพื่อดูรายละเอียดเพิ่มเติม
                            <br /> 2.1.9
                            <br /> การเดิมพันสดที่กำลังแข่งขัน
                            <br /> 2.1.9.1
                            <br /> การเดิมพัน ("สด") จะใช้ได้เฉพาะกับกีฬาที่ผู้ดำเนินการกำหนดให้เป็นตลาดการพนันสดและเฉพาะในส่วนที่เกี่ยวกับการแข่งขันที่ระบุว่าเป็น
                            "สด" หรือ "เดิมพันสด" หรือโดยการลงชื่อเข้าใช้ LIVE ในรายการกิจกรรมหรือ ในไฟล์พิเศษชื่อ "LIVE" บนเว็บไซต์
                            <br /> 2.1.9.2
                            <br /> การเดิมพันแบบ In Ining ("Live") คือที่ซึ่งผู้ใช้ปลายทางได้รับอนุญาตให้วางเดิมพันระหว่างการแข่งขันหรือเหตุการณ์ต่อเนื่องจนถึงเวลาดังกล่าวเมื่อโอเปอเรเตอร์ยุติการเดิมพันในการแข่งขันหรือเหตุการณ์นั้น
                            <br /> 2.1.9.3
                            <br /> ในการเดิมพันแบบ In Running ("Live") การเดิมพันแฮนดิแคปในเอเชียจะมีการแสดงระบบการให้คะแนนสองประเภทในเว็บไซต์:
                            <br /> ตำแหน่งปัจจุบันหรือผลลัพธ์ที่ได้รับการปรับปรุงและแสดงผล ("การให้คะแนนแบบ A") การตัดสินเดิมพันจะพิจารณาจากผลคะแนนสุดท้าย
                            (รวมถึงแต้มต่อ) ในตอนท้ายของการแข่งขันหรือการวางเดิมพันช่วงเวลา (ขึ้นอยู่กับลักษณะของการเดิมพัน) โดยหักคะแนนปัจจุบัน
                            ณ เวลาที่วางและการยอมรับ ของการเดิมพัน
                            <br /> หากคะแนนหรือผลการแข่งขันในปัจจุบันไม่แสดงผลและจะให้คะแนน 0-0 หรือผลการแข่งขัน ("การให้คะแนนแบบ B") การตัดสินเดิมพันจะพิจารณาจากผลคะแนนสุดท้าย
                            (รวมถึงแต้มต่อ) ในตอนท้ายของการแข่งขันหรือเดิมพันช่วงเวลา (ขึ้นอยู่กับลักษณะของการเดิมพัน) ผู้ใช้ปลายทางควรตรวจสอบสถานะการจับคู่ก่อนที่จะวางเดิมพันของตน
                            <br /> 2.1.9.4
                            <br /> ตลาดที่เลือกขึ้นอยู่กับประเภทเฉพาะกีฬาอาจได้รับการเสนอเพื่อการพนันโดยขึ้นอยู่กับดุลพินิจของ Operator ผู้ดำเนินการไม่รับทราบหรือยอมรับความรับผิดใด
                            ๆ หากไม่สามารถทำได้ เพื่อวางเดิมพันหรือหากการปรับปรุงคะแนนไม่ถูกต้อง เป็นคะแนนหรือผลการแข่งขันที่แสดงข้อสรุปของการแข่งขันที่ถูกต้อง.
                            <br /> 2.1.9.5
                            <br /> ตลอดเวลาเป็นความรับผิดชอบของผู้ใช้ที่จะต้องตระหนักถึงคะแนนและขอแนะนำให้ตรวจสอบสถานะการจับคู่ก่อนวางเดิมพันของคุณ.
                            <br /> 2.1.9.6
                            <br /> เว้นแต่จะมีการกำหนดไว้เป็นอย่างอื่นในกฎกติกากีฬาเฉพาะเจาะจงข้อมูลสถิติหรือบทความด้านบรรณาธิการ( e.g. scores, timers
                            or results) ที่แสดงบนเว็บไซต์ในระหว่างสถานการณ์ในเกม In Running ("Live") เป็นข้อมูลทั่วไปสำหรับ สำหรับการเดิมพัน.
                            <br /> 2.1.9.7
                            <br /> เช่นเดียวกับการเดิมพันที่ไม่ใช่แบบสดผู้ชนะของกิจกรรมจะได้รับการพิจารณาในตอนท้ายของการแข่งขัน การประท้วงการอุทธรณ์หรือการตัดสินที่เปลี่ยนแปลงจะไม่ได้รับการยอมรับสำหรับการวางเดิมพันและการเปลี่ยนแปลงต่อไปของผลการแข่งขันจะไม่ส่งผลกระทบต่อผลของการเดิมพัน
                            <br /> 2.1.9.8
                            <br /> ผู้ดำเนินการขอสงวนสิทธิ์ในการระงับตลาดหรือไม่ยอมรับการเดิมพันได้ตลอดเวลาโดยไม่ต้องแจ้งให้ทราบล่วงหน้า เมื่อตลาดถูกระงับการเดิมพันใด
                            ๆ ที่วางไว้สำหรับตลาดนั้น แต่ก่อนที่จะได้รับการยอมรับจากผู้ดำเนินการอาจถูกปฏิเสธตามดุลพินิจของผู้ดำเนินการ การเดิมพันใด
                            ๆ ที่ได้รับการยอมรับก่อนที่จะมีการระงับหรือยุติการเล่นในตลาดแบบสดจะมีขึ้นในขณะที่การเดิมพันใด ๆ ที่วางเดิมพันหลังจากการเดิมพันแบบสดสิ้นสุดลงแล้วจะไม่ได้รับการยอมรับเว้นเสียแต่ว่ามีการกำหนดไว้เป็นอย่างอื่นในกฏกติกาเฉพาะกีฬา
                            <br /> 2.1.9.9
                            <br /> ในระหว่างการวางเดิมพัน ("สด") เงื่อนไขการวางเดิมพันการวางเดิมพันจะถูกเก็บไว้ในโหมดรอดำเนินการระหว่างช่วงเวลาที่มีความเสี่ยง
                            / อันตรายสูงเฉพาะเจาะจงในการจับคู่ การเดิมพันดังกล่าวจะระบุเป็น "รอดำเนินการ" ในแต่ละใบวางเดิมพันจนถึงเวลาดังกล่าวเมื่อผู้เล่นยอมรับหรือปฏิเสธการเดิมพัน
                            ความเสี่ยงสูง / ช่วงเวลาที่เป็นอันตรายหมายถึง:
                            <br /> เตะมุม;
                            <br /> จุดโทษ
                            <br /> ฟรีคิกที่ได้รับจากการโจมตีทีมที่อยู่ใกล้เขตโทษของฝ่ายตรงข้าม
                            <br /> โยนให้กับทีมที่โจมตีบริเวณพื้นที่โทษของฝ่ายตรงข้าม
                            <br /> เมื่อใดก็ตามที่ทีมอยู่ในสถานการณ์การให้คะแนนที่อาจเกิดขึ้นเช่นเดียวกับในโหมดโจมตีที่ใช้งาน
                            <br /> 2.1.9.10
                            <br /> การเดิมพันทั้งหมดในเอเชียนแฮนดิแค็ปและโอเวอร์ / อันที่อยู่ในโหมดรอดำเนินการ (นอกเหนือจากการเดิมพันในการเดิมพันแบบรวม,
                            ลูกเตะมุมทั้งหมด, ผลรวมทั้งหมด, การเปลี่ยนตัวรวมและ / หรือการเดิมพันที่ไม่มีผลต่อผลรวมของการแข่งขัน) จะถูกยกเลิก
                            หากข้อใดข้อหนึ่งต่อไปนี้เกิดขึ้น:
                            <br /> ลูกยิงที่เป็นประตู
                            <br /> ผู้เล่นถูกเปลี่ยนออก
                            <br /> 2.1.9.11
                            <br /> อาจมีการยอมรับเดิมพันอื่น ๆ ทั้งหมดเช่นการโดนใบเหลืองใบแดงการเปลี่ยนตัวและ / หรือการเดิมพันที่ไม่มีผลต่อผลการแข่งขันโดยรวมตามดุลพินิจของผู้ดำเนินการ
                            <br /> 2.1.9.12
                            <br /> ผู้ดำเนินการขึ้นอยู่กับดุลยพินิจของตน แต่เพียงผู้เดียวกำหนดเวลาที่มีการทำประตูหรือจุดใด ๆ การอ้างอิงเกี่ยวกับเวลาของเป้าหมายหรือคะแนนที่ได้ระบุไว้ในเว็บไซต์สโมสร
                            / เว็บไซต์อย่างเป็นทางการเว็บไซต์สื่อหรือเว็บไซต์ "live score" อาจได้รับการพิจารณาเพื่อเป็นแนวทาง แต่จะไม่มีผลผูกพันกับโอเปอเรเตอร์ในการกำหนดเวลา
                            <br /> 2.1.9.13
                            <br /> ในกรณีที่ผู้ดำเนินการมีเหตุผลที่จะเชื่อหรือสงสัยว่ามีการวางเดิมพันสดหลังจากผลการแข่งขันถ่ายทอดสดเป็นที่ทราบกันดีอยู่แล้วหรือถ้าความล่าช้าในการออกอากาศทางโทรทัศน์ที่
                            "อยู่" ทำให้มีการเดิมพันสดในราคาที่ไม่ถูกต้องหลังจากที่ผู้เข้าร่วมที่เลือกได้รับ (ซึ่งจะพิจารณาตามดุลพินิจของ Operator)
                            ผู้ดำเนินการจะมีสิทธิ์ในการถือว่าการเดิมพันเป็นโมฆะโดยไม่ต้องระบุเหตุผลใด ๆ
                            <br /> 2.1.9.14
                            <br /> ในกรณีที่เกิดความผิดปกติทางเทคนิครวมถึงการขัดข้องของเว็บไซต์หรือการหยุดทำงาน,ดีเลย์ทั้งนี้โอเปอเรเตอร์จะทำการปรับปรุงคะแนน,แต้มต่อผู้ดำเนินการขอสงวนสิทธิ์ในการยกเลิกเดิมพันที่ค้างอยู่ทั้งหมด
                            ในเวลาที่เกิดเหตุการณ์
                            <br /> 2.1.9.15
                            <br /> สำหรับการเดิมพันแบบสดให้ใช้กฎทั่วไปเกี่ยวกับการประเมินผลลัพธ์ ในกรณีที่การถ่ายทอดสดถูกขัดจังหวะในระหว่างการเล่นซึ่งทำให้เหตุการณ์ถูกเลื่อนออกหรือยกเลิกการเดิมพันใด
                            ๆ ที่เกิดขึ้นในเหตุการณ์ที่เลื่อนออกหรือยกเลิกไปซึ่งไม่ได้เริ่มต้นใหม่ภายใน 12 ชั่วโมงนับจากเวลาเริ่มต้นของเหตุการณ์
                            (ยกเว้นกรณีที่ระบุไว้โดยเฉพาะในรายการ 'กฎการเดิมพัน) จะถือเป็นโมฆะ ข้อยกเว้นจะต้องเป็นสำหรับการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไขก่อนการหยุดชะงักการเล่นจริง
                            ในกรณีดังกล่าวการเดิมพันดังกล่าวจะมีผลบังคับใช้
                            <br />
                            <br /> กลับสู่ด้านบน
                            <br /> 2.2
                            <br /> ประเภทเดิมพันฟุตบอล
                            <br /> 2.2.1
                            <br /> เว้นเสียแต่ว่าจะระบุไว้เป็นอย่างอื่นผลการแข่งขันประเภทการเดิมพันฟุตบอลหมายถึงผลแพ้ชนะ เสมอ เต็มเวลา (รวมถึงเวลาหยุดการแข่งขันที่เพิ่มโดยผู้ตัดสิน)
                            เวลาพิเศษไม่นับ
                            <br /> 2.2.2
                            <br /> 1X2, 1 ครึ่งหลัง 1X2 & 1/2 ครึ่ง 1X2
                            <br /> 2.2.2.1
                            <br /> 1X2 หมายถึงการเดิมพันหนึ่งในสามผลชนะที่เป็นไปได้สำหรับการแข่งขัน 1 หมายถึงทีมที่เป็นอันดับแรก (โดยปกติทีมเจ้าบ้าน);
                            X หมายถึงเกมที่เกิดการเสมอ; 2 หมายถึงทีมที่มีชื่อเป็นที่สอง (โดยปกติทีมเยือน)
                            <br /> 2.2.2.2
                            <br /> ครึ่งหลัง 1X2 หมายถึงการเดิมพันหนึ่งในสามผลชนะที่เป็นไปได้ในครึ่งแรกของการแข่งขัน 1 หมายถึงทีมที่เป็นอันดับแรก (โดยปกติทีมเจ้าบ้าน);
                            X หมายถึงเกมที่เกิดการเสมอ; 2 หมายถึงทีมที่มีชื่อเป็นที่สอง (โดยปกติทีมเยือน)
                            <br /> 2.2.2.3
                            <br /> ครึ่งหลัง 1X2 หมายถึงการเดิมพันหนึ่งในสามผลชนะที่เป็นไปได้ซึ่งนับเฉพาะครึ่งหลังของการแข่งขัน 1 หมายถึงทีมที่เป็นอันดับแรก
                            (โดยปกติทีมเจ้าบ้าน); X หมายถึงเกมที่เกิดการเสมอ; 2 หมายถึงทีมที่มีชื่อเป็นที่สอง (โดยปกติทีมเยือน) (โดยปกติทีมเยือน)
                            <br />2.2.2.4
                            <br /> สิบนาทีแรก 1X2
                            <br /> 2.2.2.4.1.
                            <br /> สิบนาทีแรก 1X2 หมายถึงการเดิมพันเพื่อคาดการณ์ผลลัพธ์ที่เป็นไปได้สามอย่างใน 10 นาทีแรกในเวลาปกติของการแข่งขัน
                            <br /> 2.2.3
                            <br /> การทำนายผลการแข่งขัน
                            <br /> 2.2.3.1
                            <br /> การทำนายผลการแข่งขันหมายถึงการเดิมพันเพื่อทำนายคะแนนสุดท้ายเมื่อสิ้นสุดการแข่งขันเต็มเวลา
                            <br /> 2.2.3.2
                            <br /> การทำนายผลการแข่งขันในการชนะ "AOS" หมายถึงทีมที่เลือกจะต้องชนะคะแนนที่ไม่ได้อยู่ในรายการที่เลือก
                            <br /> 2.2.3.3
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.4
                            <br /> ประตูรวม, ประตูรวมครึ่งแรกและประตูรวมที่สอง
                            <br /> 2.2.4.1
                            <br /> หมายรวมหมายถึงการเดิมพันโดยพิจารณาจากผลรวมของจำนวนประตูที่ทำประตูได้ในกิจกรรม
                            <br /> 2.2.4.2
                            <br /> ครึ่งหลังรวมหมายถึงการเดิมพันที่กำหนดโดยผลรวมของจำนวนประตูที่ทำประตูในครึ่งแรกของการแข่งขัน
                            <br /> 2.2.4.3
                            <br /> รวมประตูแรกกับประตูรวมครึ่งหลัง
                            <br /> 2.2.4.3.1.
                            <br /> รวมประตูหมายถึงการเดิมพันเพื่อทำนายจำนวนประตูทั้งหมดที่ได้จากทั้งสองทีมในครึ่งแรกเทียบกับจำนวนประตูทั้งหมดที่ทำประตูได้โดยทั้งสองทีมในช่วงครึ่งหลังของการแข่งขัน
                            <br /> 2.2.4.3.2.
                            <br /> ทีมแรกครึ่งหลังรวมประตูกับทีมเจ้าบ้านครึ่งหลังผลรวมประตูหมายถึงการเดิมพันเพื่อทำนายจำนวนประตูทั้งหมดที่ได้โดยทีมในบ้านในช่วงครึ่งแรกเทียบกับจำนวนประตูที่ทีมได้ยิงทั้งหมดในช่วงครึ่งหลังของเกม
                            <br/> 2.2.4.3.3.
                            <br /> ทีมเยือนครึ่งแรกรวมประตูกับทีมเยือนครึ่งเวลาที่สองรวมประตูหมายถึงการเดิมพันเพื่อทำนายจำนวนประตูทั้งหมดที่ทำได้โดยทีมเยือนในครึ่งแรกเทียบกับจำนวนประตูทั้งหมดที่ทำได้โดยทีมเยือนในครึ่งหลังของแมตช์
                            <br/> 2.2.4.3.4
                            <br /> ครึ่งหลังผลรวมหมายถึงการเดิมพันพิจารณาจากผลรวมของจำนวนประตูที่ทำประตูได้ในช่วงครึ่งหลังของการแข่งขัน
                            <br />2.2.4.5
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.5
                            <br /> ครึ่งเวลา / เต็มเวลา (HT.FT)
                            <br /> 2.2.5.1
                            <br /> Half-time / Full-time หมายถึงการเดิมพันเพื่อทำนายทั้งผลการแข่งขันครึ่งเวลาและผลการแข่งขันเต็มเวลาของการแข่งขัน (เพิ่มเวลาพิเศษ)
                            ต่อไปนี้เกี่ยวกับตลาดนี้จะหมายถึง: H หมายถึงทีมที่มีชื่อคนแรก (โดยปกติทีมเจ้าบ้าน) D หมายถึงการวาด; หมายถึงทีมที่มีชื่อเป็นอันดับสอง
                            (โดยปกติทีมเยือน)
                            <br /> 2.2.5.2
                            <br /> ตัวอย่าง - HA หมายความว่าทีมที่มีชื่อแรก (หน้าแรก) จะเป็นผู้นำในครึ่งเวลาและทีมที่สองที่มีชื่อ (ทีมเยือน) จะเป็นผู้นำในแบบเต็มเวลา
                            <br /> 2.2.6
                            <br /> เป้าหมายแรก / เป้าหมายสุดท้ายและครึ่งแรกของครึ่งแรก / เป้าหมายสุดท้าย
                            <br /> 2.2.6.1
                            <br /> ประตูแรก / ประตูสุดท้ายหมายถึงการเดิมพันว่าทีมทีมใดจะทำประตูแรกหรือประตูสุดท้ายในการแข่งขัน ในส่วนของตลาดนี้จะหมายถึง:
                            HF หมายถึงทีมที่มีชื่อคนแรก (มักจะเป็นทีมเจ้าบ้าน) ทำประตูแรก HL หมายถึงทีมที่มีชื่อคนแรกที่ทำประตูสุดท้าย AF หมายถึงทีมที่มีชื่อคนที่สอง
                            (มักจะเป็นทีมเยือน) ทำประตูแรก AL หมายถึงทีมที่มีชื่อคนที่สองที่ทำประตูสุดท้าย NG หมายถึงไม่มีเป้าหมายที่ได้คะแนนในระหว่างการแข่งขัน
                            <br /> 2.2.6.2
                            <br /> ลูกแรกของครึ่งแรก / ประตูสุดท้าย หมายถึงการเดิมพันว่าทีมทีมใดจะได้ประตูแรกหรือประตูสุดท้ายในช่วงครึ่งแรกของการแข่งขัน
                            ในส่วนจะหมายถึง: HF หมายถึงทีมที่มีชื่อคนแรก (โดยปกติทีมเจ้าบ้าน) ทำประตูแรก HL หมายถึงทีมที่มีชื่อคนแรกที่ทำประตูสุดท้าย
                            AF หมายถึงทีมที่มีชื่อคนที่สอง (โดยปกติทีมเยือน) ทำประตูแรก AL หมายถึงทีมที่มีชื่อคนที่สองที่ทำประตูสุดท้าย NG หมายถึงไม่มีเป้าหมายที่ได้คะแนนในระหว่างการแข่งขัน
                            <br /> 2.2.6.3
                            <br /> หากเป็นการทำเข้าประตูตัวเองจะให้เครดิตเป็นฝ่ายตรงข้าม
                            <br /> 2.2.6.4
                            <br /> หากมีการยกเลิกแมตซ์หลังจากมีการทำประตูแล้วการเดิมพันทั้งหมด (และไม่มีประตู) จะมีผลกับประตูสุดท้ายของการแข่งนั้นการเดิมพันจะเป็นโมฆะ
                            หากเหตุการณ์ถูกยกเลิกโดยไม่มีประตูใด ๆการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 2.2.7
                            <br /> ทีมใดที่จะเขี่ยลูกเริ่มเล่น
                            <br /> 2.2.7.1
                            <br /> ทีมใดที่จะKick offหมายถึงการเดิมพันว่าทีมใดจะเริ่มการแข่งขัน
                            <br /> 2.2.7.2
                            <br /> หากรายการถูกยกเลิกหรือปิดรายการหลังจากมีการเตะ(แข่งขัน)แล้วการเดิมพันทั้งหมดยังคงมีผลอยู่.
                            <br /> 2.2.8
                            <br /> Home Team Total vs. Away Team Total
                            <br /> 2.2.8.1
                            <br /> Home Team Total Goal vs. Away Team Total Goal
                            <br /> 2.2.8.1.1.
                            <br /> ผลประตูทีมเหย้าทั้งหมดเทียบกับทีมเยือนผลรวมหมายถึงการเดิมพันเพื่อทำนายจำนวนประตูที่ได้ทั้งหมดโดยทีมเจ้าบ้านเมื่อเทียบกับจำนวนประตูที่ได้ทั้งหมดโดยทีมเยือนสำหรับการแข่งขันในลีกที่เฉพาะเจาะจงที่เล่นในวันหนึ่ง
                            ๆ.
                            <br /> 2.2.8.2
                            <br /> Home Team Total Corner vs. Away Team Total Corner
                            <br /> 2.2.8.2.1.
                            <br /> จำนวนลูกเตะมุมทีมเหย้ากับทีมเยือนหมายถึงการเดิมพันเพื่อทำนายจำนวนเตะมุมทั้งหมดที่ทีมบ้านทำกับจำนวนลูกเตะมุมทั้งหมดที่เกิดขึ้นกับทีมเยือนสำหรับการแข่งขันในลีกที่เฉพาะเจาะจงที่เล่นในวันใดวันหนึ่ง.
                            <br /> 2.2.8.3
                            <br /> Home Team Total Booking vs. Away Team Total Booking
                            <br /> 2.2.8.3.1.
                            <br /> การเดิมพันจำนวนใบเหลือ-แดงทั้งหมดของทีมเจ้าบ้านกับทีมเยือนหมายความว่าการเดิมพันจะทำนายจำนวนรวมของการแจกใบเหลือง-แดงที่ได้รับโดยทีมที่บ้านกับทีมเยือนสำหรับการแข่งขันในลีกหรือการแข่งขันที่เฉพาะเจาะจงในวันหนึ่ง.
                            <br /> 2.2.8.4
                            <br /> Home refers to the first named team and Away refers to the second named team.
                            <br /> 2.2.8.5
                            <br /> รายการเดิมพันรายการใดรายการหนึ่งมีการเลื่อนการแข่งขัน หรือมีการเปลี่ยนแปลงการเดิมพันจะเป็นโมฆะ.
                            <br /> 2.2.9
                            <br /> Single Team Over/Under & Single Team 1st Half Over/Under
                            <br /> 2.2.9.1
                            <br /> ทีมสูงกว่าหรือต่ำกว่าหมายถึงทีมที่ระบุในการแข่งขัน
                            <br /> 2.2.9.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.9.3
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.10
                            <br /> มุมแรก, มุมครึ่งแรกและมุมแรกครึ่งหลัง
                            <br /> 2.2.10.1
                            <br /> ลูกเตะมุมที่ได้ แต่ยังไม่ได้เตะจะยังไม่นับ
                            <br /> 2.2.10.2
                            <br /> จำนวนมุม
                            <br /> 2.2.10.2.1
                            <br /> แฮนดิแค็ป
                            <br /> 2.2.10.2.1.1
                            <br /> แฮนดิแค็ปหมายถึงการเดิมพันว่าทีมใดจะได้มุมมากที่สุดระหว่างการแข่งขันที่รวมแฮนดิแคป
                            <br /> 2.2.10.2.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.10.2.2
                            <br /> สูง /ต่ำ
                            <br /> 2.2.10.2.2.1
                            <br /> สูง / ต่ำหมายถึงการเดิมพันจำนวนลูกเตะมุมทั้งหมดที่เกิดขึ้นระหว่างทั้งสองทีมระหว่างการแข่งขัน
                            <br /> 2.2.10.2.2.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ.
                            <br /> 2.2.10.2.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.10.3
                            <br /> มุมแรก
                            <br /> 2.2.10.3.1
                            <br /> First Coner หมายถึงการเดิมพันว่าทีมใดจะได้ลูกเตะมุมแรกในการแข่งขัน
                            <br /> 2.2.10.3.2
                            <br /> 1st Half First Corner หมายถึงการเดิมพันว่าทีมใดจะได้ลูกเตะมุมแรกในการแข่งขันครึ่งแรก.
                            <br /> 2.2.10.3.3
                            <br /> 2nd Half First Coner หมายถึงการเดิมพันว่าทีมใดจะได้ลูกเตะมุมแรกในการแข่งขันครึ่งหลัง.
                            <br /> 2.2.10.3.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว.
                            <br /> 2.2.10.4
                            <br /> Last Corner & First Half Last Corner
                            <br /> 2.2.10.4.1
                            <br /> Last Corner หมายถึงการเดิมพันว่าทีมใดจะได้ลูกเตะมุมลูกสุดท้ายในการแข่งขัน.
                            <br /> 2.2.10.4.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.10.4.3
                            <br /> First Half Last Corner’s การเดิมพันจะถือเป็นโมฆะถ้าการแข่งขันถูกยกเลิกในช่วงครึ่งแรกของการแข่งขัน First Half Last
                            Corner’s จะยังคงมีผลถ้าการแข่งขันถูกยกเลิกในช่วงครึ่งหลังของการแข่งขัน.
                            <br /> 2.2.10.5
                            <br /> ลูกเตะมุมลูกถัดไป
                            <br /> 2.2.10.5.1
                            <br /> ลูกเตะมุมลูกถัดไป หมายถึงการทำนายว่าทีมไหนจะเป็นคนได้ลูกเตะมุมถัดไปของการแข่งขัน.
                            <br /> 2.2.10.5.2
                            <br /> การเดิมพันทั้งหมดถือว่าถูกต้องหากได้เตะมุมไปแล้ว.
                            <br /> 2.2.11
                            <br /> จำนวนรวมของใบเหลืองใบแดง
                            <br /> 2.2.11.1
                            <br /> ใบเหลืองนับเป็นหนึ่งและใบแดงนับเป็นสองแต้ม จำนวนคะแนนสูงสุดที่ผู้เล่นสามารถได้รับในระหว่างการแข่งขันคือสาม (หนึ่งสำหรับสีเหลืองและสองสำหรับสีแดง,
                            ใบเหลืองที่สองไม่นับ)
                            <br /> 2.2.11.2
                            <br /> ใบแดงใบเหลืองที่แสดงให้กับผู้ที่ไม่ได้เป็นผู้เล่น (ผู้จัดการโค้ช ฯลฯ ) ไม่นับรวม
                            <br /> 2.2.11.3
                            <br /> จำนวนการโดนใบ เหลืองแดงทั้งหมด
                            <br /> 2.2.11.3.1
                            <br /> แฮนดิแค็ป
                            <br /> 2.2.11.3.1.1
                            <br /> แฮนดิแคปหมายถึงการเดิมพันว่าทีมใดจะได้รับใบเหลือง แดง มากที่สุดในระหว่างการแข่งขันที่รวมแฮนดิแคปใด ๆ
                            <br /> 2.2.11.3.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.11.3.2
                            <br /> Over/Under
                            <br /> 2.2.11.3.2.1
                            <br /> สูง / ต่ำหมายถึงการเดิมพันจำนวนรวมของใบเหลืองแดงที่ทีมทั้งสองได้รับในระหว่างการแข่งขัน
                            <br /> 2.2.11.3.2.2
                            <br /> ถ้าผลรวมเกินกว่าเส้นของ OU ผลลัพธ์ที่จะเป็น สูง ถ้าผลรวมน้อยกว่าเส้น OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.11.3.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.11.4
                            <br /> การจองครั้งแรก
                            <br /> 2.2.11.4.1
                            <br /> การเดิมพันครั้งแรกหมายถึงการเดิมพันว่าทีมใดจะได้รับใบครั้งแรก (สีเหลืองหรือสีแดง) ในการแข่งขัน
                            <br /> 2.2.11.4.2
                            <br /> หากผู้เล่นตั้งแต่ 2 คนขึ้นไปได้รับใบเหลืองหรือแดงสำหรับเหตุการณ์เดียวกันผู้เล่นที่ได้แสดงใบแรกจากผู้ตัดสินจะถือว่าเป็นผู้ชนะ
                            <br /> 2.2.11.4.3
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากได้รับไพ่ใบแรกแล้วการเดิมพันทั้งหมดจะสมบูรณ์ หากการแข่งขันถูกยกเลิกก่อนออกบัตรแรกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br />2.2.11.5
                            <br /> การโดนใบเหลืองหรือแดงครั้งสุดท้าย
                            <br /> 2.2.11.5.1
                            <br /> Last Booking หมายถึงการเดิมพันว่าทีมไหนจะถูกใบเหลืองหรือแดงใบสุดท้ายในการแข่งขัน.
                            <br /> 2.2.11.5.2
                            <br /> หากผู้เล่นตั้งแต่ 2 คนขึ้นไปได้รับใบเหลืองหรือแดงสำหรับเหตุการณ์เดียวกันจากนั้นผู้เล่นที่ได้รับการแสดงใบสุดท้ายโดยผู้ตัดสินจะถือว่าเป็นผู้ชนะ.
                            <br /> 2.2.11.5.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.12
                            <br /> Offsides
                            <br /> 2.2.12.1
                            <br /> Number of Offside
                            <br /> 2.2.12.1.1
                            <br /> Handicap
                            <br /> 2.2.12.1.1.1
                            <br /> Handicap หมายถึงการวางเดิมพันในทีมใดจะถูกจับ offside จำนวนครั้งมากที่สุดในระหว่างการแข่งขันบวกกับ อัตราhandicapsด้วย.
                            <br /> 2.2.12.1.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.12.1.2
                            <br /> Over/Under
                            <br /> 2.2.12.1.2.1
                            <br /> Over/Under หมายถึงการวางเดิมพัน จำนวนครั้งoffside ในระหว่างการแข่งขัน.
                            <br /> 2.2.12.1.2.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ.
                            <br /> 2.2.12.1.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.12.2
                            <br /> First Offside
                            <br /> 2.2.12.2.1
                            <br /> First Offside หมายถึงการเดิมพันว่าทีมใดจะเป็นฝ่ายล้ำหน้าในการแข่งขันครั้งแรก
                            <br /> 2.2.12.2.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากการตัดสินล้ำหน้าครั้งแรกการเดิมพันทั้งหมดจะสมบูรณ์ หากการแข่งขันถูกยกเลิกก่อนการตัดสินล้ำหน้าครั้งแรกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.12.3
                            <br /> Offside ครั้งสุดท้าย
                            <br /> 2.2.12.3.1
                            <br /> ลูกล้ำหน้าครั้งสุดท้ายหมายถึงการเดิมพันว่าทีมใดจะเป็นฝ่ายล้ำหน้าครั้งสุดท้ายในการแข่งขัน
                            <br /> 2.2.12.3.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.13
                            <br /> การเปลี่ยนตัว
                            <br /> 2.2.13.1
                            <br /> จำนวนการเปลี่ยนตัว
                            <br /> 2.2.13.1.1
                            <br /> แฮนดิแค็ป
                            <br /> 2.2.13.1.1.1
                            <br /> แฮนดิแค็ปหมายถึงการเดิมพันว่าทีมใดที่เปลี่ยนตัวผู้เล่นได้มากที่สุดในระหว่างการแข่งขันซึ่งรวมถึงแฮนดิแคป
                            <br /> 2.2.13.1.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.13.1.2
                            <br /> สูง/ต่ำ
                            <br /> 2.2.13.1.2.1
                            <br /> สูง / ต่ำหมายถึงการเดิมพันจำนวนการเปลี่ยนตัวทั้งหมดระหว่างการแข่งขัน
                            <br /> 2.2.13.1.2.2
                            <br /> ถ้าผลรวมเกินกว่าเส้นของ OU ผลลัพธ์ที่ได้จะสูงกว่า ถ้าผลรวมน้อยกว่าเส้น OU ผลชนะจะอยู่ภายใต้
                            <br /> 2.2.13.1.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.13.2
                            <br /> First Substitution
                            <br /> 2.2.13.2.1
                            <br /> First Substitution หมายถึงการเดิมพันว่าทีมไหนจะเป็นฝ่ายเปลี่ยนตัวผู้เล่นก่อนระหว่างการแข่งขัน.
                            <br /> 2.2.13.2.2
                            <br /> หากมีการเปลี่ยนตัวพร้อมกัน2คนหรือมากกว่า จะถือว่าหมายเลขแรกที่โชว์บนบอร์ดเปลี่ยนตัวเป็นผู้ชนะ.
                            <br /> 2.2.13.2.3
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากการเปลี่ยนตัวครั้งแรกการเดิมพันทั้งหมดจะสมบูรณ์ หากการแข่งขันถูกยกเลิกก่อนการเปลี่ยนตัวครั้งแรกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.13.3
                            <br /> Last Substitution
                            <br /> 2.2.13.3.1
                            <br /> Last Substitution หมายถึงการเดิมพันว่าฝ่ายไหนจะเป็นผู้ที่เปลี่ยนตัวคนสุดท้ายของการแข่งขัน.
                            <br /> 2.2.13.3.2
                            <br /> หากมีการเปลี่ยนตัวพร้อมกัน2คนหรือมากกว่า จะถือว่าหมายเลขแรกที่โชว์บนบอร์ดเปลี่ยนตัวเป็นผู้ชนะ.
                            <br /> 2.2.13.3.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.14
                            <br /> Clean Sheets
                            <br /> 2.2.14.1
                            <br /> Clean Sheets หมายถึงการเดิมพันว่าทีมไหนจะไม่เสียประตูเลยระหว่างการแข่งขัน.
                            <br /> Few options as below:
                            <br /> Home Clean Sheet :ใน90นาทีทีมเจ้าบ้านจะต้องไม่ถูกทีมเยือนทำประตูได้. ยกตัวอย่าง, ผลการแข่งขันต้อง 0-0, 1-0, 2-0
                            & อย่างไรก็ตามหากทีมเยือนไม่สามารถทำประตูได้คุณจะชนะเดิมพัน
                            <br /> Home No Clean Sheet : ใน90นาทีทีมเจ้าบ้านจะต้องถูกทีมเยือนทำประตูได้. ยกตัวอย่าง, ผลการแข่งขันต้อง 0-1, 1-1, 2-1
                            & อย่างไรก็ตามหากทีมเยือนสามารถทำประตูได้คุณจะชนะเดิมพัน
                            <br /> Away Clean Sheet: ในการแข่งขัน 90 'ทีมเจ้าบ้านจะต้องไม่มีประตูใด ๆ ตัวอย่างเช่นผลเป็น 0-0, 0-1, 0-2 & ฯลฯ => ตราบเท่าที่ทีมเจ้าบ้านไม่มีประตูแล้วคุณจะชนะการเดิมพัน
                            <br /> Away No Clean Sheet: ในการแข่งขัน 90 'เจ้าบ้าน ต้อง ได้ประตู ตัวอย่างเช่นผลที่ได้คือ 1-0, 1-1, 1-2 & ฯลฯ => ตราบเท่าที่ทีมเจ้าบ้านมีประตูแล้วคุณจะชนะการเดิมพัน
                            <br /> การเดิมพันแบบ Home Yes Home No Away Yes Away No
                            <br /> Betting Type Meaning Home team ต้องไม่เสียประตู Home team ต้องเสียประตู Away team ต้องไม่เสียประตู Away team ต้องเสียประตู
                            <br /> การชนะเดิมพันแบบ Away team - NO goal Away team - HAVE a goal Home - NO goal Home - HAVE a goal
                            <br /> Lose the bet Away team - HAVE a goal Away team - NO goal Home team HAVE a goal Home No Goal - NO goal
                            <br /> 2.2.14.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.15
                            <br /> Penalties
                            <br /> 2.2.15.1
                            <br /> Penalties หมายถึงการเดิมพันการมีการเตะลูกโทษระหว่างการแข่งขัน
                            <br /> 2.2.15.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากได้รับลูกโทษแล้วการเดิมพันทั้งหมดยังคงมีผล
                            <br /> 2.2.15.3
                            <br /> หากการแข่งขันถูกยกเลิกก่อนที่ได้รับลูกโทษและดำเนินการแล้วการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.16
                            <br /> การยิงลูกโทษ
                            <br /> 2.2.16.1
                            <br /> การยิงลูกโทษหมายถึงการเดิมพันว่าทีมใดจะชนะการยิงลูกโทษ
                            <br /> 2.2.16.2
                            <br /> ในการเดิมพันแต้มต่อผลรวมการลงโทษทั้งหมดที่เกิดขึ้นในการยิงรวมถึงการเสียประตูอย่างกระทันหัน
                            <br /> ผลการแข่งขันที่สูง / ต่ำ การเดิมพันจะรวมเฉพาะลูกโทษ 10 ลูก ในการยิงประตูและไม่รวมถึง sudden death
                            <br /> 2.2.17
                            <br /> แฟนตาซีลีก
                            <br /> 2.2.17.1
                            <br />br /> Fantasy matches คือการจับคู่ทีมการแข่งขันจากต่างลีค.
                            <br /> 2.2.17.2
                            <br /> ทั้งหมดมีไว้เพื่อจุดประสงค์ในการอ้างอิงเท่านั้น
                            <br /> 2.2.18
                            <br /> เฉพาะ 15 นาที สูง/ต่ำ (OU)
                            <br /> 2.2.18.1
                            <br /> เฉพาะ 15 นาที (OU) หมายถึงการเดิมพันโดยจำนวนคะแนนทั้งหมด (goals, corners, games, cards etc.) เมื่อสิ้นสุดทุกๆ 15
                            นาที [ช่วงเวลา] ของการแข่งขัน
                            <br /> 2.2.18.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.18.3
                            <br /> ตัวอย่างเช่น
                            <br /> OU 15 นาที
                            <br /> 00: 00-15: 00 OU: จำนวนประตูทั้งหมดที่จะได้จาก 00:00 ถึง 15:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            15
                            <br /> OU นาทีที่ 30
                            <br /> 15: 01-30: 00 OU: : จำนวนประตูทั้งหมดที่จะได้จาก 15:01 ถึง 30:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            30
                            <br /> OU นาที 45
                            <br /> 30: 01- 45:00 OU: จำนวนประตูทั้งหมดที่จะได้จาก 30:01 - 45:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            45
                            <br /> OU นาทีที่ 60
                            <br /> 45: 01-60: 00 OU:จำนวนประตูทั้งหมดที่จะได้จาก 45:01 ถึง 60:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            60
                            <br /> OU นาทีที่ 75
                            <br /> 60: 01-75: 00 OU: จำนวนประตูทั้งหมดที่จะได้จาก 60:01 ถึง 75:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่ 75
                            <br /> 90 นาที OU
                            <br /> 75: 01- 90:00 OU: จำนวนประตูทั้งหมดที่จะได้จาก 75:01 ถึง 90:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่ 90
                            <br /> 2.2.18.4
                            <br />สำหรับเวลา OU เฉพาะ 15 นาทีการเดิมพันจะตัดสินตามเวลาที่แน่นอนของการทำประตู (ลูกที่ข้ามเส้นประตู) จำนวนมุม (มุมที่ถ่าย)
                            และการเดิมพันทั้งหมด (บัตรที่ได้รับจากผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ในนาฬิกา ตามที่เผยแพร่ในการถ่ายทอดสด
                            <br /> 2.2.18.5
                            <br /> หากการแข่งขันถูกระงับหรือยกเลิกการเล่นการวางเดิมพันใน OU เฉพาะ 15 นาทีที่ยังไม่เสร็จจะถือว่าเป็นโมฆะ หาก OU เฉพาะ
                            15 นาทีที่กำหนดเสร็จสมบูรณ์แล้วการเดิมพันจะมีผลสมบูรณ์
                            <br /> 2.2.18.6
                            <br /> ในช่วงสองนาทีสุดท้ายของการเดิมพันแบบ O / U เฉพาะ 15 นาทีการดำเนินการใด ๆ ที่ไม่ใช่เสียงเรียกเข้าที่ระบุไว้ในที่นี้จะถือว่าเป็นการเล่นแบบปลอดภัยและการเดิมพันที่ค้างอยู่ทั้งหมดอาจถือได้ว่าเป็นที่ยอมรับ:
                            เป้าหมายการลงโทษและ บัตรสีแดง
                            <br /> 2.2.18.7
                            <br /> สำหรับช่วงเวลา 30: 01-45: 00 และ 75:01 - 90:00 การเดิมพันจะตัดสินตามเวลาที่แน่นอนของการทำประตู (ลูกที่ข้ามเส้นประตู)
                            จำนวนมุม (มุมที่ถ่าย) และการจองรวม (บัตรที่กำหนดโดย ผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ในนาฬิกาตามที่เผยแพร่ในการถ่ายทอดสดโดยไม่รวมเวลาหรือเวลาบาดเจ็บเพิ่มขึ้น
                            <br /> 2.2.19
                            <br /> เตะฟรีคิก
                            <br /> 2.2.19.1
                            <br /> ฟรีคิกที่ได้รับ แต่ยังไม่ได้ทำการเตะจะยังไม่นับ
                            <br /> 2.2.19.2
                            <br /> การเตะฟรีคิกหมายถึงการเตะฟรีคิกโดยตรงและการเตะฟรีคิกสองจังหวะ (ยกเว้นลูกโทษและเตะจากประตู)
                            <br /> 2.2.19.3
                            <br /> จำนวนของฟรีคิก
                            <br /> 2.2.19.3.1
                            <br /> แฮนดิแค็ป
                            <br /> 2.2.19.3.1.1
                            <br /> แฮนดิแค็ปหมายถึงการเดิมพันว่าทีมใดจะได้ลูกฟรีคิกระหว่างการแข่งขันที่รวมแฮนดิแคปใด ๆ
                            <br /> 2.2.19.3.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.19.3.2
                            <br /> สูง/ ต่ำ
                            <br /> 2.2.19.3.2.1
                            <br />สูง / ต่ำหมายถึงการเดิมพันจำนวนรวมของการเตะฟรีคิกที่ดำเนินการโดยทั้งสองทีมในระหว่างการแข่งขัน
                            <br /> 2.2.19.3.2.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.19.3.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.19.3.2.4
                            <br /> First Free kick
                            <br /> 2.2.19.3.2.4.1
                            <br /> First Free kick หมายถึงการเดิมพันว่าทีมใดจะได้ลูกฟรีคิกก่อน
                            <br /> 2.2.19.3.2.4.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจาก มีการเตะฟรีคิกลูกแรก การเดิมพันจะยังคงอยู่แต่ว่าหากมีการยกเลิกการแข่งขันก่อนการเตะฟรีคิกลูกแรก
                            การเดิมพันทั้งหมดจะเป็นโมฆะ.
                            <br /> 2.2.19.3.2.5
                            <br /> Last Free Kick
                            <br /> 2.2.19.3.2.5.1
                            <br /> Last Free kick หมายถึงการเดิมพันว่าทีมใดจะเป็นผู้ได้ลูกฟรีคิกลูกสุดท้ายในการแข่งขัน.
                            <br /> 2.2.19.3.2.5.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.20
                            <br /> Goal kick
                            <br /> 2.2.20.1
                            <br /> A goal kick คือการเตะจากเส้นประตูจะได้รับโดยการที่คู่ต่อสู้ทำบอลหลุดออกเส้นหลังฝ่ายตนเอง
                            <br /> 2.2.20.2
                            <br /> การที่ผู้รักษาประตูเตะหลังจากเซฟลูกยิงจะไม่ถูกนับรวม.
                            <br /> 2.2.20.3
                            <br /> Number of Goal kicks
                            <br /> 2.2.20.3.1
                            <br /> แฮนดิแค็ป
                            <br /> 2.2.20.3.1.1
                            <br /> แฮนดิแค็ปหมายถึงการเดิมพันว่าทีมทีมใดจะได้ลูกเตะจากประตูมากที่สุดระหว่างการแข่งขันที่รวมแฮนดิแคป
                            <br /> 2.2.20.3.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.20.3.2
                            <br /> สูง / ต่ำ
                            <br /> 2.2.20.3.2.1
                            <br /> สูง / ต่ำหมายถึงการเดิมพันจำนวนลูกเตะทั้งหมดที่ทำโดยทั้งสองทีมในระหว่างการแข่งขัน
                            <br /> 2.2.20.3.2.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.20.3.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.20.4
                            <br /> ลูกเตะจากประตูลูกแรก
                            <br /> 2.2.20.4.1
                            <br /> ลูกเตะจากประตูลูกแรก หมายถึงการเดิมพันว่าทีมใดจะเตะลูกจากประตูลูกแรกในการแข่งขัน
                            <br /> 2.2.20.4.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากเตะจากประตูลูกแรกการเดิมพันทั้งหมดจะยังคงอยู่ หากการแข่งขันถูกยกเลิกก่อนที่การเตะจากประตูลูกแรกเกิดขึ้นเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 2.2.20.5
                            <br /> เตะจากประตูลูกสุดท้าย
                            <br /> 2.2.20.5.1
                            <br /> เตะจากประตูลูกสุดท้าย หมายถึงการเดิมพันว่าทีมใดจะได้ลูกเตะจากประตูลูกสุดท้ายในการแข่งขัน
                            <br /> 2.2.20.5.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.21
                            <br /> ลูกทุ่ม
                            <br /> 2.2.21.1
                            <br /> การที่จะได้รับลูกทุ่มคือฝ่ายหนึ่งฝ่ายใดทำลูกออกเส้นข้างสนาม
                            <br />2.2.21.2
                            <br /> จำนวนลูกทุ่ม
                            <br /> 2.2.21.2.1
                            <br /> Handicap
                            <br /> 2.2.21.2.1.1
                            <br /> Handicap หมายถึงการเดิมพันว่าทีมใดจะได้ลูกทุ่ม มากกว่า ผลรวมจะรวมถึงอัตราต่อรองแฮนดิแคบด้วย.
                            <br /> 2.2.21.2.1.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.21.2.2
                            <br /> สูง/ต่ำ
                            <br /> 2.2.21.2.2.1
                            <br /> Over/Under หมายถึงการเดิมพันจำนวนผลรวมของลูกทุ่มในระหว่างการแข่งขัน.
                            <br /> 2.2.21.2.2.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ.
                            <br /> 2.2.21.2.2.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.21.3
                            <br /> ลูกทุ่มลูกแรก
                            <br /> 2.2.21.3.1
                            <br /> First throw-in หมายถึงการทำนายว่าทีมใดจะเป็นผู้ที่ได้ลูกทุ่มก่อนเป็นทีมแรก.
                            <br /> 2.2.21.3.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.21.4
                            <br /> Last Throw-in
                            <br /> 2.2.21.4.1
                            <br /> วิธีการนับลูกทุ่มครั้งสุดท้ายหมายถึงการเดิมพันว่าทีมใดจะได้ลูกทุ่มครั้งสุดท้ายในการแข่งขัน
                            <br /> 2.2.21.4.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.22
                            <br /> สูง / ต่ำ (O / U)
                            <br /> 2.2.22.1
                            <br /> ช่วงเวลาที่เฉพาะเจาะจง 10 นาที สูง / ต่ำ:
                            <br /> 2.2.22.1.1
                            <br /> เฉพาะ 10 นาที (OU) หมายถึงการเดิมพันที่กำหนดโดยจำนวนรวมของคะแนน ((goals, corners, games, cards etc ) ในตอนท้ายของทุกๆ
                            10 นาที [INTERVAL OF] เวลาของการแข่งขัน
                            <br /> 2.2.22.1.2
                            <br /> ถ้าผลรวมเกินกว่าอัตรา OU ผลลัพธ์ที่ได้คือ สูง ถ้าผลรวมน้อยกว่าอัตรา OU ผลชนะจะเป็น ต่ำ
                            <br /> 2.2.22.1.3
                            <br /> ตัวอย่างเช่น:
                            <br /> OU นาทีที่ 10
                            <br /> 00: 00-10: 00 O / U: จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก 00:00 ถึง 10:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            10
                            <br /> OU 20 นาที
                            <br /> 10: 01-20: 00 O / U: จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก10:01 ถึง 20:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            20
                            <br /> OU นาทีที่ 30
                            <br /> 20: 01-30: 00 O / U: จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก20:01 ถึง 30:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            30
                            <br /> 40thMinuteOU
                            <br /> 30:01 - 40:00 O / U: จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก30:01 ถึง 40:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            40
                            <br /> 60thMinuteOU
                            <br /> 50:01 - 60:00 O / U:จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก50:01 ถึง 60:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            60
                            <br /> 70thMinuteOU
                            <br /> 60:01 - 70:00 O / U: จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก60:01 ถึง 70:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            70
                            <br /> 80thMinuteOU
                            <br /> 70:01 - 80:00 O / U:จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก70:01 ถึง 80:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            80
                            <br /> 90 นาที OU
                            <br /> 80:01 - 90:00 O / U: จำนวนเหตุการ์ณทั้งหมดที่จะได้รับจาก 80:01 ถึง 90:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            90
                            <br /> 2.2.22.2
                            <br /> สำหรับช่วงเวลาเฉพาะ O / U 10 นาทีการเดิมพันจะตัดสินตามเวลาที่กำหนดไว้ในการทำประตู (ลูกที่ข้ามเส้นประตู) จำนวนมุม
                            (มุมที่ถ่าย) และการจองทั้งหมด (บัตรที่ได้รับจากผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ นาฬิกาที่เผยแพร่ในการถ่ายทอดสด
                            <br /> 2.2.22.3
                            <br /> หากมีการระงับหรือยกเลิกการแข่งขันการเดิมพันที่วางบน OU เฉพาะ 10 นาทีที่ยังไม่เสร็จจะถือว่าเป็นโมฆะ หากกำหนดเวลา
                            O / U เฉพาะ 10 นาทีที่กำหนดไว้เดิมพันจะถูกต้อง
                            <br /> 2.2.22.4
                            <br /> ในช่วงสองนาทีสุดท้ายของการเดิมพันสด O / U เฉพาะ 10 นาทีการกระทำใด ๆ ที่นอกเหนือจากที่ระบุไว้ในที่นี้จะถือว่าเป็นการเล่นแบบปลอดภัยและการเดิมพันที่ค้างอยู่ทั้งหมดอาจถือได้ว่าเป็นที่ยอมรับ:
                            เป้าหมายการลงโทษและ บัตรสีแดง
                            <br /> 2.2.22.5
                            <br /> สำหรับ 80: 01-90: 00 การเดิมพันจะตัดสินตามเวลาที่กำหนดไว้ (ลูกที่ข้ามเส้นประตู) จำนวนมุม (มุมที่ถ่าย) และการจองทั้งหมด
                            (บัตรที่ได้รับจากผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงโดย นาฬิกาตามที่เผยแพร่ในการถ่ายทอดสดโดยไม่รวมเวลาหรือเวลาบาดเจ็บเพิ่มขึ้น
                            <br /> 2.2.23
                            <br /> กฎของฟุตซอล
                            <br /> 2.2.23.1
                            <br /> การเดิมพันทั้งหมดจะขึ้นอยู่กับผลการแข่งขันเมื่อสิ้นสุดการแข่งขัน 40 นาที (2 x 20 นาที) การเพิ่มเวลาหรือการลงโทษจะไม่นับรวม
                            <br /> 2.2.23.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับและไม่ได้กลับมาทำงานในวันเดียวกันการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 2.2.23.3
                            <br /> หากการแข่งขันเริ่มขึ้นก่อนเวลาที่กำหนดไว้การเดิมพันเฉพาะก่อนการเตะจริงจะถือว่าถูกต้อง การเดิมพันทั้งหมดที่วางหลังจากเวลาเริ่มต้นจะถือว่าเป็นโมฆะยกเว้นการเดิมพันสด
                            <br /> 2.2.24
                            <br /> ผู้ทำประตูสูงสุด
                            <br /> 2.2.24.1
                            <br /> การทายผลการแข่งขันล่วงหน้า
                            <br /> 2.2.24.1.1
                            <br /> การทำเข้าประตูตัวเองและการดวลจุดโทษจะไม่นับ
                            <br /> 2.2.24.1.2
                            <br /> ผลการแข่งขันทั้งหมดจะถูกนำออกเมื่อผลการตัดสินอย่างเป็นทางการถูกประกาศเมื่อสิ้นสุดการแข่งขันโดยฝ่ายปกครอง
                            <br /> 2.2.24.2
                            <br /> Players Head to Head Tournament Top Goal Scorer
                            <br /> 2.2.24.2.1
                            <br /> การทำเข้าประตูตัวเองและการดวลจุดโทษและการต่อเวลาพิเศษจะไม่นับ
                            <br /> 2.2.24.2.2
                            <br /> หากผู้เล่นไม่ได้ลงเล่นในการแข่งขันรายการนั้นๆการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.24.2.3
                            <br /> ผลการแข่งขันทั้งหมดจะถูกนำออกเมื่อผลการตัดสินอย่างเป็นทางการถูกประกาศเมื่อสิ้นสุดการแข่งขันโดยฝ่ายปกครอง
                            <br /> 2.2.24.3
                            <br /> ผู้เล่น Head to Head Match ผู้ทำประตูสูงสุด
                            <br /> 2.2.24.3.1
                            <br /> เป้าหมายที่เป็นของตัวเองและคะแนนในการยิงลูกโทษไม่นับ Extra-time ไม่รวมและไม่นับรวมในการเดิมพัน
                            <br /> 2.2.24.3.2
                            <br /> หากผู้เล่นไม่เริ่ม / เล่นในแมทช์การเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 2.2.24.3.3
                            <br /> ผลการแข่งขันทั้งหมดจะถูกนำออกเมื่อผลการตัดสินอย่างเป็นทางการถูกประกาศเมื่อจบการแข่งขันโดยฝ่ายปกครอง
                            <br /> 2.2.25
                            <br /> เวลาบาดเจ็บ
                            <br /> 2.2.25.1
                            <br /> เวลาบาดเจ็บหมายถึงเวลาในการเล่นเสริมที่เพิ่มขึ้นเพื่อชดเชยเวลาที่ใช้ไปร่วมกับผู้เล่นที่บาดเจ็บในระหว่างการแข่งขัน
                            เวลาการบาดเจ็บที่ได้รับในตอนท้ายของครึ่งหลังคือ:
                            <br /> ไม่มี
                            <br /> 1 นาที
                            <br /> 2 นาที
                            <br /> 3 นาที
                            <br /> 4 นาที +
                            <br /> 2.2.25.2
                            <br /> เวลาบาดเจ็บที่ได้รับเมื่อสิ้นสุดครึ่งแรก
                            <br /> 2.2.25.2.1
                            <br /> การวางเดิมพันทั้งหมดจะขึ้นอยู่กับการเล่นแบบเต็มเวลา 45 นาทีโดยไม่รวมเวลาพิเศษ เดิมพันจะตัดสินตามเวลาการบาดเจ็บที่ได้รับจากผู้ตัดสินที่
                            4 ในการแข่งขันหลังจากเล่นครบ 45 นาทีหรือในตอนท้ายของครึ่งแรก
                            <br /> 2.2.25.2.2
                            <br /> หากการแข่งขันถูกยกเลิกในช่วงครึ่งปีแรกการเดิมพันทั้งหมดในระยะเวลาบาดเจ็บที่ได้รับเมื่อสิ้นสุดครึ่งแรกจะถือว่าเป็นโมฆะและการเดิมพันจะได้รับการคืนให้กับบัญชีของสมาชิก
                            <br /> 2.2.25.3
                            <br /> ได้รับบาดเจ็บเมื่อสิ้นสุดการแข่งขันที่ 2
                            <br /> 2.2.25.3.1
                            <br /> การวางเดิมพันทั้งหมดจะขึ้นอยู่กับการเล่น 90 นาทีเต็มรูปแบบโดยไม่รวมเวลาพิเศษ เดิมพันจะตัดสินจากเวลาบาดเจ็บที่ได้รับจากผู้ตัดสินที่
                            4 ในการแข่งขันหลังจากเล่นครบ 90 นาทีหรือในตอนท้ายของครึ่งหลังอีกครั้ง
                            <br /> 2.2.25.3.2
                            <br /> หากการแข่งขันถูกยกเลิกเมื่อใดก็ได้การเดิมพันทั้งหมดในช่วงทดเวลาบาดเจ็บที่ได้รับเมื่อสิ้นสุดครึ่งหลังจะถือเป็นโมฆะและการเดิมพันจะได้รับการคืนให้กับบัญชีของสมาชิก
                            <br /> 2.2.25.4
                            <br /> บริษัท จะตัดสินเดิมพันตามผลการแข่งขันอย่างเป็นทางการซึ่งจัดทำขึ้นโดยผู้มีอำนาจในการจัดฟุตบอล
                            <br /> 2.2.26
                            <br /> โอกาสคู่
                            <br /> 2.2.26.1
                            <br /> มีตัวเลือกต่อไปนี้:
                            <br /> 1 หรือ X - หากผลที่ได้คือบ้านหรือวาดแล้วการเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                            <br /> X หรือ 2 - หากผลที่ได้คือการวาดหรือออกไปการเดิมพันที่ตัวเลือกนี้จะเป็นผู้ชนะ
                            <br /> 1 หรือ 2 - หากผลที่ได้คือบ้านหรือจากนั้นเดิมพันในตัวเลือกนี้จะเป็นผู้ชนะ
                            <br /> หากการแข่งขันถูกเล่นในสถานที่ที่เป็นกลางทีมแรกที่ถือว่าเป็นทีมแรกในการเดิมพัน
                            <br /> 2.2.27
                            <br /> เสมอไม่มีเดิมพัน
                            <br /> 2.2.27.1
                            <br /> ทำนายว่าบ้านหรือทีมเยือนชนะในการแข่งขัน หากผลการแข่งขันรอบสุดท้ายหลังจากเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการเดิมพันการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 2.2.28
                            <br /> ทั้งสองคน / คน / ไม่ให้คะแนน
                            <br /> ทั้งสอง = ทั้งสองทีมทำคะแนน
                            <br /> One = ทั้งสองทีมทำคะแนน
                            <br /> ทั้งสองทีมไม่ให้คะแนน
                            <br /> 2.2.29
                            <br /> ชนะไป Nil
                            <br /> 2.2.29.1
                            <br /> คาดเดาว่าการเลือกของคุณสามารถเอาชนะการแข่งขันได้โดยไม่ต้องยอมให้ได้ประตูหลังจากเล่นตามเวลาปกติหรือเมื่อจบกำหนดเวลานั้นโดยไม่รวมเวลาพิเศษหรือการยิงลูกโทษ
                            <br /> 2.2.30
                            <br /> แฮนดิแคป 3 ทาง
                            <br /> 2.2.30.1
                            <br /> การชำระบัญชีจะเป็นไปตามอัตราเดิมพันที่แสดงโดยใช้คะแนนตามจริงในการแข่งขันที่ปรับสำหรับแต้มต่อ
                            <br /> 2.2.31
                            <br /> ชนะทั้งสองครึ่ง
                            <br /> 2.2.31.1
                            <br /> คาดเดาว่าการเลือกของคุณสามารถทำประตูมากกว่าฝ่ายตรงข้ามได้ในครึ่งหลังของสองทีม
                            <br /> 2.2.32
                            <br /> ชนะทั้งสองครึ่ง
                            <br /> 2.2.32.1
                            <br /> คาดเดาว่าการเลือกของคุณสามารถทำประตูได้มากกว่าฝ่ายตรงข้ามในแต่ละครึ่ง
                            <br /> ตัวอย่างเช่นหากการเลือกของคุณทำคะแนนในครึ่งแรกของการแข่งขันและการจับคู่เสร็จสิ้น 1-0 แม้ว่าครึ่งแรกจะได้รับรางวัล
                            1-0 คะแนนใน 45 นาทีที่สองมีผลใช้เวลา 0-0 และเป็นเสมอ หากเกิดเหตุการณ์เช่นนี้ครึ่งแรกถือว่าเป็น 'ชนะ' และดังนั้นการเดิมพันจะเป็นผู้แพ้
                            <br /> 2.2.33
                            <br /> ทีมทำคะแนนสูงสุด
                            <br /> ทีมที่มีคะแนนสูงสุดคือผู้ชนะ
                            <br /> ความแตกต่างของประตูไม่นับ
                            <br /> หากทีมมีคะแนนตามคะแนนแล้วกฎความตายจะใช้
                            <br /> การละทิ้งและการเลื่อนตำแหน่ง
                            <br /> สำหรับทีมที่ถูกยกเลิกหรือเลื่อนออกไป (ไม่ได้กำหนดเวลาภายในกรอบเวลาที่ระบุโดย บริษัท ) การเดิมพันทั้งหมดจะถูกยกเลิกไป
                            <br /> ตัวอย่าง:
                            <br /> แมนซิตี้ 4 สวอนซี 4
                            <br /> ลิเวอร์พูล 4 ซันเดอร์แลนด์ 1
                            <br /> จากนั้น Liverpool, Man city และ Swansea เป็นผู้ชนะ
                            <br /> 2.2.34
                            <br /> เป้าหมายครึ่งแรกที่แน่นอน
                            <br /> 2.2.34.1
                            <br /> เป้าหมายครึ่งแรกที่แน่นอนหมายถึงการเดิมพันที่จะทำนายจำนวนประตูทั้งหมดที่ได้จากทั้งสองทีมภายในสิ้นครึ่งแรก
                            <br /> 2.2.34.2
                            <br /> หากมีการยกเลิกกิจกรรมก่อนสิ้นครึ่งแรกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.35
                            <br /> กลุ่มที่ต้องการ:
                            <br /> 2.2.35.1
                            <br /> คะแนนทีมที่ถูกต้องหมายถึงการเดิมพันกับทีมเพื่อให้ได้คะแนนรวมที่แน่นอนเมื่อสิ้นสุดรอบของกลุ่ม
                            <br /> 2.2.36
                            <br /> กลุ่มคะแนนสูงสุด
                            <br /> 2.2.36.1
                            <br /> หมายถึงการเดิมพันเพื่อทำนายจำนวนรวมของคะแนนที่ได้จากกลุ่มตามวันที่ระบุ
                            <br /> 2.2.36.2
                            <br /> หากกลุ่มมีคะแนนตามคะแนนแล้วกฎความตายจะใช้
                            <br /> ตัวอย่าง:
                            <br /> กลุ่ม A
                            <br /> โปแลนด์ vs กรีซ -2-1 = 3Goals
                            <br /> รัสเซีย vs เช็ก -2-2 = 5 ประตู
                            <br /> กลุ่ม ATOT: 8Goals
                            <br /> กลุ่ม BTotal: 7Goals
                            <br /> กลุ่ม CTotal: 7Goals
                            <br /> กลุ่ม DTotal: 6Goals
                            <br /> กลุ่ม A เป็นผู้ชนะ
                            <br /> 2.2.37
                            <br /> คะแนนทีมจากทีม
                            <br /> 2.2.37.1
                            <br /> หมายถึงการเดิมพันในทีมเมื่อจบรอบของกลุ่มซึ่งตรงกับหมวดหมู่ที่นำเสนอ "Under", "Inclusive" & "Over"
                            <br /> ตัวอย่าง
                            <br /> คะแนนรวมของทีม X คือ 5 คะแนน
                            <br /> ต่ำกว่า 3 คะแนน - แพ้
                            <br /> รวม 3-4 จุด - แพ้
                            <br /> มากกว่า 4 คะแนน - ชนะ
                            <br /> 2.2.38
                            <br /> พยากรณ์กลุ่ม Straight
                            <br /> 2.2.38.1
                            <br /> หมายถึงการเดิมพันเพื่อทำนายทีมที่จะทำอันดับที่หนึ่งและที่สองตามลำดับเฉพาะในกลุ่มทีมของตนในตอนท้ายของเวทีกลุ่ม
                            <br /> 2.2.39
                            <br /> เวลาบาดเจ็บสูงกว่า / ต่ำกว่า
                            <br /> 2.2.39.1
                            <br /> ได้รับบาดเจ็บเมื่อสิ้นสุดครึ่งหลังครึ่งเวลาสูงกว่า / ต่ำกว่า:
                            <br /> 2.2.39.1.1
                            <br /> ช่วงทดเวลาบาดเจ็บครึ่งเหนือหรือต่ำกว่าหมายถึงการเดิมพันสูง / ต่ำในช่วงทดเวลาบาดเจ็บที่ได้รับเมื่อสิ้นสุดครึ่งแรก
                            <br /> 2.2.39.1.2
                            <br /> ถ้าผลรวมเกินกว่าเส้นของ OU ผลลัพธ์ที่ได้จะสูงกว่า ถ้าผลรวมน้อยกว่าเส้น OU ผลที่ได้คือ
                            <br /> 2.2.39.1.3
                            <br /> เดิมพันจะตัดสินตามระยะเวลาการบาดเจ็บที่ได้รับจากผู้ตัดสินที่ 4 ในการแข่งขันหลังจากเล่นครบ 45 นาทีหรือสิ้นสุดครึ่งแรก
                            <br /> 2.2.39.2
                            <br /> ได้รับบาดเจ็บเมื่อสิ้นสุดครึ่งหลังครึ่งหลัง / ใต้
                            <br /> 2.2.39.2.1
                            <br /> ช่วงทดเวลาบาดเจ็บครึ่งหลังครึ่งเวลาสูง / ต่ำหมายถึงการเดิมพันสูง / ต่ำในช่วงทดเวลาบาดเจ็บที่ได้รับเมื่อสิ้นสุดครึ่งหลังที่สอง
                            <br /> 2.2.39.2.2
                            <br /> ถ้าผลรวมเกินกว่าเส้นของ OU ผลลัพธ์ที่ได้จะสูงกว่า ถ้าผลรวมน้อยกว่าเส้น OU ผลชนะจะอยู่ภายใต้
                            <br /> 2.2.39.2.3
                            <br /> เดิมพันจะตัดสินตามระยะเวลาการบาดเจ็บที่ได้รับจากผู้ตัดสินที่ 4 ในการแข่งขันหลังจากเล่นครบ 90 นาทีหรือในตอนท้ายของครึ่งหลัง
                            2.
                            <br /> 2.2.40
                            <br /> วิธีการเป้าหมายแรก
                            <br /> 2.2.40.1
                            <br /> หมายถึงการคาดการณ์ว่าเป้าหมายของการแข่งขันจะเป็นอย่างไรโดยทีมใดทีมหนึ่ง
                            <br /> 2.2.40.1.1
                            <br /> ฟรีคิก - เป้าหมายต้องทำประตูโดยตรงจากการเตะฟรีคิก การนับการเบี่ยงเบนจากการยิงประตูทำให้นักเตะฟรีเตะได้รับรางวัล
                            รวมทั้งทำประตูได้โดยตรงจากเตะมุม.
                            <br /> 2.2.40.1.2
                            <br /> การลงโทษ - เป้าหมายต้องทำประตูได้โดยตรงจากการลงโทษด้วยการลงโทษผู้ตัดสินตามชื่อแต้มต่อ
                            <br /> 2.2.40.1.3
                            <br /> เป้าหมายที่เป็นเจ้าของ - หากเป้าหมายประกาศเป็นเป้าหมายของตัวเอง
                            <br /> 2.2.40.1.4
                            <br /> ส่วนหัว - การแตะครั้งสุดท้ายของผู้ทำประตูจะต้องอยู่กับศีรษะ
                            <br /> 2.2.40.1.5
                            <br /> Shot - เป้าหมายอื่น ๆ ทั้งหมดที่ไม่รวมอยู่ด้านบน
                            <br /> 2.2.40.1.6
                            <br /> ไม่มีเป้าหมาย
                            <br /> 2.2.40.2
                            <br /> บริษัท จะตัดสินเดิมพันตามผลการแข่งขันอย่างเป็นทางการซึ่งจัดทำขึ้นโดยผู้มีอำนาจในการจัดฟุตบอล
                            <br /> 2.2.41
                            <br /> การยิงลูกโทษ - การลงโทษจะทำอย่างไร?
                            <br /> 2.2.41.1
                            <br /> หมายถึงการเดิมพันเพื่อคาดการณ์ว่าผู้ลงเตะที่กำหนดจะได้คะแนนหรือไม่ได้รับโทษจากการเตะลูกโทษระหว่างการลงโทษลูกโทษ
                            <br /> 2.2.41.2
                            <br /> หากการเตะลูกโทษไม่ได้เกิดขึ้นการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 2.2.42
                            <br /> พยากรณ์ Dual
                            <br /> 2.2.42.1
                            <br /> การคาดเดาแบบคู่หมายถึงการเดิมพันเพื่อคาดการณ์ทีมสอง (2) ที่ต้องอยู่ในตำแหน่งสูงสุด 2 ตำแหน่งตามลำดับใด ๆ ในตอนท้ายของการแข่งขัน
                            <br /> 2.2.43
                            <br /> พยากรณ์ทันเวลา
                            <br /> 2.2.43.1
                            <br /> Straight Forecast หมายถึงการเดิมพันเพื่อทำนายทั้งสองทีม (2) ซึ่งจะต้องอยู่ในตำแหน่งสูงสุด 2 ตำแหน่งตามลำดับที่แน่นอนเมื่อสิ้นสุดการแข่งขัน
                            <br /> 2.2.44
                            <br /> ผู้ใช้ใหม่ยอดเยี่ยม
                            <br /> 2.2.44.1
                            <br /> Newcomer หมายถึงการคาดการณ์ว่าทีมใดจะจบในฐานะ Top Newcomer ของการแข่งขันหรือการแข่งขัน "Newcomer" คือทีมที่เพิ่งได้รับการเลื่อนตำแหน่งให้เข้าร่วมการแข่งขันหรือการแข่งขัน
                            <br /> 2.2.45
                            <br /> ผู้ชนะระดับภูมิภาค
                            <br /> 2.2.45.1
                            <br /> ผู้ชนะในภูมิภาคหมายถึงการเดิมพันผู้ชนะจากการแข่งขันหรือการแข่งขันจากภูมิภาค
                            <br /> ผลการแข่งขันทั้งหมดจะถูกนำออกเมื่อผลการตัดสินอย่างเป็นทางการถูกประกาศเมื่อสิ้นสุดการแข่งขันโดยฝ่ายปกครอง
                            <br /> 2.2.46
                            <br /> หน้าแรกไม่มีเดิมพัน
                            <br /> 2.2.46.1
                            <br /> ทายผลการแข่งขันเสมอหรือเสมอไปในการแข่งขัน หากผลการแข่งขันรอบสุดท้ายหลังจากเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการชนะในบ้านการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 2.2.47
                            <br /> ไม่มีเดิมพันใด ๆ
                            <br /> 2.2.47.1
                            <br /> ทายผลการจับคู่หรือการแข่งขันในการแข่งขัน หากผลการแข่งขันรอบสุดท้ายหลังจากเวลาเล่นตามปกติหรือเมื่อสิ้นสุดเวลาที่กำหนดไว้คือการชนะนอกบ้านการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 2.2.48
                            <br /> เสมอ/ไม่เสมอ
                            <br /> 2.2.48.1
                            <br /> คาดเดาการจับสลากหรือเสมอไม่มีในผลลัพธ์สุดท้ายของกิจกรรมหลังจากเล่นตามเวลาปกติหรือเมื่อสิ้นสุดเวลาที่กำหนด
                            <br /> 2.2.49
                            <br /> คะแนนครึ่งแรกและครึ่งหลังถูกต้อง
                            <br /> 2.2.49.1
                            <br /> คะแนนครึ่งแรกหมายถึงการเดิมพันเพื่อทำนายคะแนนสุดท้ายในตอนท้ายของครึ่งแรก
                            <br /> 2.2.49.2
                            <br /> ครึ่งหลังที่ถูกต้องหมายถึงการเดิมพันเพื่อทำนายคะแนนในครึ่งหลังของการแข่งขัน
                            <br /> 2.2.49.3
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.50
                            <br /> ผลรวม / เป้าหมาย
                            <br /> 2.2.50.1
                            <br /> ผลรวม / หมายถึงการเดิมพันทั้งทำนาย:
                            <br /> การแข่งขันจะส่งผลให้ Home win หรือ Away ชนะหรือเสมอ; และ
                            <br /> จำนวนเป้าหมายทั้งหมดในผลลัพธ์สุดท้ายของกิจกรรมจะสูงหรือต่ำกว่า
                            <br /> 2.2.50.2
                            <br /> มีตัวเลือกการพนันดังนี้:
                            <br /> บ้านและรางวัลสูง - เดิมพันชนะหากทีมในบ้านชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                            <br /> บ้านและที่อยู่ต่ำกว่า - เดิมพันชนะหากทีมในบ้านชนะและประตูรวมต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                            <br /> เดิมพันเยือนและมากกว่า - เดิมพันจะชนะหากทีมเยือนชนะและประตูทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                            <br /> การเดิมพันชนะและแพ้ - การเดิมพันชนะถ้าทีมเยือนชนะและประตูทั้งหมดอยู่ใต้เส้นที่กำหนดไว้ล่วงหน้า
                            <br /> วาด - มากกว่า - เดิมพันชนะหากผลการแข่งขันที่ได้รับในการวาดและเป้าหมายทั้งหมดอยู่เหนือเส้นที่กำหนดไว้ล่วงหน้า
                            <br /> เสมอและต่ำ - เดิมพันจะชนะถ้าผลการแข่งขันจับได้และเป้าหมายทั้งหมดอยู่ต่ำกว่าเส้นที่กำหนดไว้ล่วงหน้า
                            <br /> 2.2.51
                            <br /> ทีมที่ชนะจากเบื้องหลัง
                            <br /> 2.2.51.1
                            <br /> ทีมที่ชนะจากด้านหลังหมายถึงการเดิมพันเพื่อทำนายทีมที่จะสูญเสียเวลาใด ๆ ในการแข่งขัน แต่ในที่สุดก็มาจากด้านหลังและชนะเมื่อจบ
                            90 นาที
                            <br /> 2.2.52
                            <br /> ผู้ทำประตูแรก
                            <br /> 2.2.52.1
                            <br /> ดาวซัลโวแรกหมายถึงการเดิมพันเพื่อทำนายผู้เล่นที่จะทำประตูแรกในการแข่งขัน
                            <br /> 2.2.52.2
                            <br /> การเดิมพันผู้เล่นที่ไม่มีส่วนร่วมในการจับคู่จะถือเป็นโมฆะและได้รับเงินคืน
                            <br /> 2.2.52.3
                            <br /> การเดิมพันผู้เล่นที่เข้ามาเล่นแทนหลังจากทำประตูแรกเท่านั้นจะเป็นโมฆะและได้รับเงินคืน
                            <br /> 2.2.52.4
                            <br /> เป้าหมายของตัวเองไม่นับเป็นเป้าหมายแรก ในกรณีเช่นนี้ผู้เล่นคนถัดไปจะได้คะแนนเป็นผู้ทำประตูแรก
                            <br /> 2.2.52.5
                            <br /> การเดิมพันจะถือเป็นโมฆะยกเว้นกรณีที่เป้าหมายแรกเป็นเป้าหมายของตัวเองซึ่งในกรณีนี้การวางเดิมพันจะยืนขึ้น
                            <br /> 2.2.52.6
                            <br /> การเดิมพันผู้เล่นที่ถูกเปลี่ยนหรือถูกส่งไปก่อนที่จะมีการทำประตูแรกจะหายไป
                            <br /> 2.2.52.7
                            <br /> เดิมพันที่ "ไม่มีแต้มต่อเป้าหมาย" ชนะถ้าไม่มีผู้เล่นทำประตูได้ในการแข่งขัน หากเป้าหมายของตัวเองเป็นเป้าหมายเดียวในเกมการเดิมพัน
                            "ไม่มีแต้มเป้าหมาย" ชนะ
                            <br /> 2.2.53
                            <br /> ทีมแรกทำคะแนน 2 ประตู
                            <br /> 2.2.53.1
                            <br /> หมายถึงการเดิมพันเพื่อทำนายว่าทีมใดจะเป็นคนแรกที่ทำประตูได้ 2 ประตูในการแข่งขัน
                            <br /> * หน้าแรก
                            <br /> * ออกไป
                            <br /> ไม่ได้
                            <br /> 2.2.53.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากที่ทีมทำประตูได้ 2 ประตูการเดิมพันทั้งหมดจะยืนขึ้น
                            <br /> 2.2.53.3
                            <br /> หากการแข่งขันถูกยกเลิกก่อนที่ทีมใด ๆ จะได้ประตูสอง (2) เดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.54
                            <br /> ทีมแรกทำคะแนน 3 ประตู
                            <br /> 2.2.54.1
                            <br /> หมายถึงการเดิมพันเพื่อคาดการณ์ว่าทีมใดจะเป็นคนแรกที่ทำประตูได้สาม (3) ในการแข่งขัน
                            <br /> * ทีมเหย้า
                            <br /> * ออกไป
                            <br /> ไม่ได้
                            <br /> 2.2.54.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากที่ทีมทำคะแนนได้สาม (3) เป้าหมายการเดิมพันทั้งหมดจะยืนขึ้น
                            <br /> 2.2.54.3
                            <br /> หากการแข่งขันถูกยกเลิกก่อนที่ทีมใด ๆ จะได้ประตูสาม (3) การเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.55
                            <br /> เวลาในการทำประตูแรก
                            <br /> 2.2.55.1
                            <br /> หมายถึงการเดิมพันเพื่อทำนายในช่วงเวลาที่เป้าหมายแรกจะได้คะแนน
                            <br /> 2.2.55.2
                            <br /> มีวงเล็บเวลา / ตัวเลือกการพนันต่อไปนี้:
                            <br /> · 00:00 - 10:00
                            <br /> · 10:01 - 20:00
                            <br /> · 20:01 - 30:00
                            <br /> · 30:01 - 40:00
                            <br /> · 40:01 - 50:00
                            <br /> · 50:01 - 60:00
                            <br /> · 60:01 - 70:00
                            <br /> · 70:01 - 80:00
                            <br /> · 80:01 - เต็มเวลา
                            <br /> ·ไม่มีเป้าหมาย
                            <br /> 2.2.55.3
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากมีการทำประตูแรกการเดิมพันทั้งหมดจะยืน
                            <br /> 2.2.55.4
                            <br /> หากการแข่งขันถูกยกเลิกก่อนที่จะมีการทำประตูแรกการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.56
                            <br /> ครึ่งใดจะเป็นเป้าหมายแรก
                            <br /> 2.2.56.1
                            <br /> หมายถึงการเดิมพันเพื่อทำนายว่าครึ่งหลังของการจับคู่ประตูแรกจะได้รับคะแนน
                            <br /> 2.2.56.2
                            <br /> มีตัวเลือกการพนันดังนี้:
                            <br /> ·ครึ่งแรก
                            <br /> ·ครึ่งหลัง
                            <br /> ·ไม่มีเป้าหมาย
                            <br /> 2.2.56.3
                            <br /> หากการแข่งขันถูกยกเลิกในภายหลังหลังจากทำประตูแรกในช่วงครึ่งแรกการเดิมพันทั้งหมดจะยืน
                            <br /> 2.2.56.4
                            <br /> หากการแข่งขันถูกยกเลิกเมื่อใดก็ได้ก่อนที่จะมีการทำประตูแรกการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.56.5
                            <br /> ในช่วงสองนาทีสุดท้ายของการถ่ายทอดสด HDP แบบเฉพาะเจาะจง 15 นาทีการดำเนินการใด ๆ ที่นอกเหนือจากที่ระบุไว้ในที่นี้จะถือว่าเป็นการเล่นแบบปลอดภัยและทำให้การเดิมพันที่ค้างอยู่ทั้งหมดสามารถทำได้เพื่อรับ:
                            เป้าหมายการลงโทษและสีแดง การ์ด
                            <br /> 2.2.56.6
                            <br /> สำหรับช่วงเวลา 30: 01-45: 00 และ 75:01 - 90:00 การเดิมพันจะตัดสินตามเวลาที่แน่นอนของการทำประตู (ลูกที่ข้ามเส้นประตู)
                            จำนวนมุม (มุมที่ถ่าย) และการจองรวม (บัตรที่กำหนดโดย ผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ในนาฬิกาตามที่เผยแพร่ในการถ่ายทอดสดโดยไม่รวมเวลาหรือเวลาบาดเจ็บเพิ่มขึ้น
                            <br /> 2.2.57
                            <br /> ทั้งสองทีมทำคะแนน / ผลและทั้งสองทีมทำคะแนน / ผลการแข่งขันครึ่งเวลา
                            <br /> 2.2.57.1
                            <br /> ทั้งสองทีมทำคะแนน / ผลหมายถึงการเดิมพันทั้งสองทำนาย:
                            <br /> (ก) การแข่งขันจะส่งผลให้ทั้งสองทีมทำคะแนนได้หรือไม่
                            <br /> (B) การแข่งขันจะเป็นผลให้ Home Win หรือ Away ชนะหรือเสมอ
                            <br /> 2.2.57.2
                            <br /> มีตัวเลือกการพนันดังนี้:
                            <br /> · Yes & Home - เดิมพันจะชนะหากทั้งสองทีมทำคะแนนและทีมที่บ้านชนะ
                            <br /> · Yes & Away - เดิมพันชนะถ้าทั้งสองทีมทำคะแนนและทีมเยือนชนะ
                            <br /> ·มีและวาด - เดิมพันชนะถ้าทั้งสองทีมทำคะแนนและผลการแข่งขันในการแข่งขัน
                            <br /> 2.2.57.3
                            <br /> ทั้งสองทีมทำสกอร์ / ผลรวมครึ่งเวลาหมายถึงการเดิมพันเพื่อทำนายผลของครึ่งแรกของการแข่งขันและว่าทั้งสองทีมจะทำสกอร์ได้ในครึ่งแรกหรือไม่
                            <br /> 2.2.57.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.58
                            <br /> ครึ่งเวลา / เต็มเวลาไม่ซ้ำ / คู่
                            <br /> 2.2.58.1
                            <br /> การเดิมพันเวลาครึ่งแรก / เต็มเวลา / คี่หมายถึงการเดิมพันเพื่อคาดการณ์ว่าผลการแข่งขันครึ่งเวลาและผลการแข่งขันแบบเต็มเวลาของการแข่งขันเป็นแบบคี่และคี่ตามลำดับคี่และแม้แต่คู่และคี่หรือแม้แต่คู่แข่งขัน
                            <br/> 2.2.58.2
                            <br /> มีสี่ตัวเลือกเพื่อเดิมพัน:
                            <br /> · Odd / Odd
                            <br /> · Odd / Even
                            <br /> · Even / Odd
                            <br /> · Even / Even
                            <br /> 2.2.58.3
                            <br /> สำหรับประเภทการเดิมพันนี้การเพิ่มเวลาพิเศษใด ๆ จะไม่ถูกนับเพื่อวัตถุประสงค์ในการพิจารณาผลการแข่งขันแบบเต็มเวลา
                            <br /> 2.2.58.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.59
                            <br /> ทั้งสองทีมทำคะแนน / ผลและทั้งสองทีมทำคะแนน / ผลการแข่งขันครึ่งเวลา
                            <br /> 2.2.59.1
                            <br /> ทั้งสองทีมทำคะแนน / ผลหมายถึงการเดิมพันทั้งสองทำนาย:
                            <br /> (ก) การแข่งขันจะส่งผลให้ทั้งสองทีมทำคะแนนได้หรือไม่
                            <br /> (B) การแข่งขันจะเป็นผลให้ Home Win หรือ Away ชนะหรือเสมอ
                            <br /> 2.2.59.2
                            <br /> มีตัวเลือกต่อไปนี้:
                            <br /> · Yes & Home - เดิมพันจะชนะหากทั้งสองทีมทำคะแนนและทีมที่บ้านชนะ
                            <br /> · Yes & Away - เดิมพันชนะถ้าทั้งสองทีมทำคะแนนและทีมเยือนชนะ
                            <br /> ·มีและวาด - เดิมพันชนะถ้าทั้งสองทีมทำคะแนนและผลการแข่งขันในการแข่งขัน
                            <br /> 2.2.59.3
                            <br /> ทั้งสองทีมทำสกอร์ / ผลรวมครึ่งเวลาหมายถึงการเดิมพันเพื่อทำนายผลของครึ่งแรกของการแข่งขันและว่าทั้งสองทีมจะทำสกอร์ได้ในครึ่งแรกหรือไม่
                            <br /> 2.2.59.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.60
                            <br /> ครึ่งหลังกับทีมที่บ้านทำประตูแรก
                            <br /> 2.2.60.1
                            <br /> หมายถึงการเดิมพันเพื่อทำนายในครึ่งหลังของการแข่งขันที่ทีมแรกจะทำประตูแรก
                            <br /> 2.2.60.2
                            <br /> มีตัวเลือกต่อไปนี้:
                            <br /> * 1 ครึ่ง
                            <br /> * ครึ่งหลัง
                            <br /> * ไม่มีเป้าหมาย
                            <br /> 2.2.61
                            <br /> ครึ่งหลังกับทีมเยือนทำประตูแรก
                            <br /> 2.2.61.1
                            <br /> หมายถึงการเดิมพันที่จะคาดการณ์ว่าครึ่งหลังของการแข่งขันทีมเยือนจะทำประตูแรกได้อย่างไร
                            <br /> 2.2.61.2
                            <br /> มีตัวเลือกต่อไปนี้:
                            <br /> * 1 ครึ่ง
                            <br /> * ครึ่งหลัง
                            <br /> * ไม่มีเป้าหมาย
                            <br /> 2.2.62
                            <br /> ครึ่งหลังกับทีมเยือนทำประตูแรก
                            <br /> 2.2.62.1
                            <br /> แฮนดิแค็ปเฉพาะ 15 นาทีหมายถึงการเดิมพันเมื่อนักกีฬาหรือทีมคนหนึ่งได้รับตำแหน่งเริ่มต้นเสมือนจริงผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนที่ดีขึ้นหลังจากเพิ่มแฮนดิแคปให้กับผลทุกๆ
                            15 นาที (ช่วงเวลา) ของการแข่งขัน
                            <br /> 2.2.62.2
                            <br /> ตัวอย่างเช่น:
                            <br />
                            <br /> HDP นาทีที่ 15
                            <br /> 00:00 - 15:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่เวลา 00:00 น. ถึง 15:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            15
                            <br />
                            <br /> HDP ที่ 30 นาที
                            <br /> 15:01 - 30:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 15:01 จนถึง 30:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            30
                            <br />
                            <br /> HDP นาทีที่ 45
                            <br /> 30: 01- 45:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 30:01 - 45:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            45
                            <br />
                            <br /> HDP ที่ 60 นาที
                            <br /> 45:01 - 60:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 45:01 ถึง 60:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            60
                            <br />
                            <br /> HDP นาทีที่ 75
                            <br /> 60:01 - 75:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 60:01 ถึง 75:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            75
                            <br />
                            <br /> HDP ที่ 90 นาที
                            <br /> 75: 01-90:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 75:01 จนถึง 90:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            90
                            <br /> 2.2.62.3
                            <br /> สำหรับการเล่น HDP เฉพาะช่วงเวลา 15 นาทีการเดิมพันจะถูกตัดสินตามเวลาที่กำหนดที่ทำประตูได้ (ลูกที่ข้ามเส้นประตู) จำนวนมุม
                            (มุมที่ถ่าย) และการจองทั้งหมด (บัตรที่ได้รับจากผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ในนาฬิกา ตามที่เผยแพร่ในการถ่ายทอดสด
                            <br /> 2.2.62.4
                            <br /> หากมีการระงับหรือยกเลิกการแข่งขันการวางเดิมพันที่ยังไม่เสร็จภายใน 15 นาที HDP ที่เฉพาะเจาะจงจะถือว่าเป็นโมฆะ หากการกำหนด
                            HDP เฉพาะ 15 นาทีเสร็จสมบูรณ์แล้วการเดิมพันจะมีผลสมบูรณ์
                            <br /> 2.2.62.5
                            <br /> ในช่วงสองนาทีสุดท้ายของการถ่ายทอดสด HDP แบบเฉพาะเจาะจง 15 นาทีการดำเนินการใด ๆ ที่นอกเหนือจากที่ระบุไว้ในที่นี้จะถือว่าเป็นการเล่นแบบปลอดภัยและทำให้การเดิมพันที่ค้างอยู่ทั้งหมดสามารถทำได้เพื่อรับ:
                            เป้าหมายการลงโทษและสีแดง card./p>
                            <br /> 2.2.62.6
                            <br /> สำหรับช่วงเวลา 30: 01-45: 00 และ 75:01 - 90:00 การเดิมพันจะตัดสินตามเวลาที่แน่นอนของการทำประตู (ลูกที่ข้ามเส้นประตู)
                            จำนวนมุม (มุมที่ถ่าย) และการจองรวม (บัตรที่กำหนดโดย ผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ในนาฬิกาตามที่เผยแพร่ในการถ่ายทอดสดโดยไม่รวมเวลาหรือเวลาบาดเจ็บเพิ่มขึ้น
                            <br /> 2.2.63
                            <br /> การแข่งขันแฟนตาซี: ทีมที่ทำประตูแรก
                            <br /> 2.2.63.1
                            <br /> การแข่งขันแฟนตาซี: ทีมแรกทำประตูหมายถึงการเดิมพันเพื่อทำนายทีมที่จะทำประตูแรกในการแข่งขันแฟนตาซี
                            <br />
                            <br /> ตัวอย่าง:
                            <br /> แมทช์: แมนฯ ซิตี้ vs ลิเวอร์พูล; เชลซี vs แมนฯ ยูไนเต็ด
                            <br /> การจับคู่แฟนตาซี: แมนเชสเตอร์ vs เชลซี
                            <br /> แมนฯ ซิตี้ยิงประตูแรกที่ 25:10
                            <br /> เชลซีทำประตูแรกได้เวลา 25:48
                            <br /> เดิมพันชนะ: แมนซิตี้
                            <br /> 2.2.63.2
                            <br /> หากทั้งสองฝ่ายทำคะแนนได้ในเวลาเดียวกัน (นาทีและวินาที) หรือไม่มีประตูใด ๆ ที่เป็นผลมาจากการแข่งขันทั้งคู่การจับคู่แฟนตาซีจะได้รับการพิจารณาให้เป็นแบบวาด
                            <br /> 2.2.63.3
                            <br /> หากการแข่งขันหนึ่งครั้งถูกเลื่อนหรือยกเลิกหลังจากมีการทำประตูแรกในการแข่งขันอื่นเดิมพันทั้งหมดจะยืนขึ้น หากการแข่งขันถูกเลื่อนหรือยกเลิกก่อนที่จะมีการทำประตูแรกในการแข่งขันอื่นการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br />
                            <br /> ตัวอย่าง:
                            <br /> แมทช์: แมนฯ ซิตี้ vs ลิเวอร์พูล; เชลซี vs แมนฯ ยูไนเต็ด
                            <br /> การจับคู่แฟนตาซี: แมนเชสเตอร์ vs เชลซี
                            <br /> แมนฯ ซิตี้ยิงประตูแรกที่ 25:10
                            <br /> การแข่งขันของเชลซีเลื่อนออกไปหรือถูกทอดทิ้งก่อน 25:10
                            <br /> ผลการแข่งขัน: การเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.63.4
                            <br /> หากการแข่งขันทั้งคู่ถูกยกเลิกโดยไม่มีการทำประตูการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.63.5
                            <br /> เป้าหมายใด ๆ ที่ทำประตูระหว่างช่วงต่อเวลาพิเศษจะไม่นับ
                            <br /> 2.2.64
                            <br /> ทีมยุโรปยอดเยี่ยม
                            <br /> 2.2.64.1
                            <br /> ทีมยุโรปยอดเยี่ยมหมายถึงการเดิมพันว่าทีมยุโรปใดจะลงแข่งมากที่สุดในการแข่งขัน FIFA World Cup
                            <br /> 2.2.64.2
                            <br /> หากทีมยุโรปสองทีมแข่งขันในรอบชิงชนะเลิศหรือในการแข่งขันนัดที่สามผู้ชนะในการแข่งขันจะถือเป็นทีมยุโรปยอดเยี่ยม
                            <br /> 2.2.64.3
                            <br /> ในกรณีอื่น ๆ ที่มีทีมยุโรปมากกว่าหนึ่งทีมออกจากการแข่งขันในรอบเดียวกันรอบชิงชนะเลิศกฎ "เดดฮีท" จะถูกนำมาใช้และอัตราการจ่ายเงิน
                            (จำนวนเงินที่น้อยกว่า) จะหารด้วยจำนวนผู้ชนะและตัดสินตามสัดส่วนการถือหุ้นที่ส่งคืน
                            <br /> 2.2.64.4
                            <br /> การเดิมพันทั้งหมดสำหรับทีมยุโรปสูงสุดจะตัดสินเมื่อผู้ตัดสินได้ลงนามใน FIFA หรือทีมยุโรปคนสุดท้ายออกจากการแข่งขัน
                            <br /> 2.2.65
                            <br /> ทีมอเมริกาใต้ยอดนิยม
                            <br /> 2.2.65.1
                            <br /> ทีมอเมริกาใต้ยอดนิยมหมายถึงการเดิมพันว่าทีมไหนในอเมริกาใต้จะก้าวไปไกลที่สุดในการแข่งขัน FIFA World Cup
                            <br /> 2.2.65.2
                            <br /> หากทีมอเมริกาใต้สองทีมแข่งขันในรอบชิงชนะเลิศหรือในการแข่งขันนัดที่สามผู้ชนะในการแข่งขันจะถือเป็นทีมยอดเยี่ยมในอเมริกาใต้
                            <br /> 2.2.65.3
                            <br /> ในกรณีอื่นที่มีทีมอเมริกาใต้มากกว่าหนึ่งทีมออกจากการแข่งขันในรอบเดียวกันรอบชิงชนะเลิศกฎ "Dead Heat" และอัตราการจ่ายเงิน
                            (จำนวนเงินที่น้อยกว่า) จะหารด้วยจำนวนผู้ชนะและตัดสินตามสัดส่วนการถือหุ้นที่ส่งคืน
                            <br/> 2.2.65.4
                            <br /> การเดิมพันทั้งหมดสำหรับทีมท็อปอเมริกาใต้จะตัดสินเมื่อผู้ตัดสินได้รับการตัดสินโดย FIFA หรือเมื่อทีมอเมริกาใต้คนสุดท้ายออกจากการแข่งขัน
                            <br /> 2.2.66
                            <br /> ทีมแอฟริกายอดนิยม
                            <br /> 2.2.66.1
                            <br /> ทีมแอฟริกันยอดนิยมหมายถึงการเดิมพันว่าทีมแอฟริกันคนใดจะลงแข่งมากที่สุดในการแข่งขัน FIFA World Cup
                            <br /> 2.2.66.2
                            <br /> หากทีมแอฟริกันสองทีมแข่งขันในรอบชิงชนะเลิศหรือในการแข่งขันนัดที่สามผู้ชนะในการแข่งขันจะถือเป็นทีมแอฟริกายอดเยี่ยม
                            <br /> 2.2.66.3
                            <br /> ในกรณีอื่น ๆ ที่มีทีมแอฟริกันมากกว่าหนึ่งคนออกจากการแข่งขันในรอบเดียวกันรอบชิงชนะเลิศกฎ "เดดฮีท" จะถูกนำมาใช้และอัตราการจ่ายเงิน
                            (น้อยกว่าหุ้น) จะหารด้วยจำนวนผู้ชนะและตัดสินตามสัดส่วนการถือหุ้นที่ส่งคืน
                            <br /> 2.2.66.4
                            <br /> การเดิมพันทั้งหมดสำหรับทีมแอฟริกายอดจะได้รับการตัดสินเมื่อผู้ FIFA หรือ FIFA ทีมสุดท้ายออกจากการแข่งขัน
                            <br /> 2.2.67
                            <br /> ทั้งสองทีมทำคะแนน
                            <br /> 2.2.67.1
                            <br /> ทั้งสองทีมทำประตูหมายถึงการเดิมพันเพื่อคาดการณ์ว่าการจับคู่จะส่งผลให้ทั้งสองทีมทำคะแนนได้หรือไม่
                            <br /> 2.2.67.2
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.68
                            <br /> ทั้งสองทีมทำคะแนนในครึ่งแรก
                            <br /> 2.2.68.1
                            <br /> ทั้งสองทีมทำสกอร์ครึ่งแรกหมายถึงการเดิมพันเพื่อคาดการณ์ว่าทั้งสองทีมจะได้คะแนนในครึ่งแรกของการแข่งขัน
                            <br /> 2.2.68.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากทั้งสองทีมทำคะแนนได้ในครึ่งแรกเดิมพัน "ใช่" จะถูกตัดสินว่าเป็นผู้ชนะและผู้แพ้ของเกม
                            "ไม่" หากการแข่งขันถูกเลื่อนหรือยกเลิกก่อนจบครึ่งแรกโดยไม่ได้ให้ทั้งสองทีมให้คะแนนการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.69
                            <br /> ทั้งสองทีมทำคะแนนในครึ่งหลัง
                            <br /> 2.2.69.1
                            <br /> ทั้งสองทีมทำคะแนนในครึ่งหลังหมายถึงการเดิมพันเพื่อคาดการณ์ว่าทั้งสองทีมจะได้คะแนนในครึ่งหลังของการแข่งขัน
                            <br /> 2.2.69.2
                            <br /> หากการแข่งขันถูกยกเลิกหลังจากทั้งสองทีมทำประตูได้ในช่วงครึ่งหลังการเดิมพัน "ใช่" จะตัดสินว่าเป็นผู้ชนะและผู้แพ้
                            "ไม่มี" หากการแข่งขันถูกเลื่อนหรือยกเลิกโดยไม่มีการให้คะแนนทั้งสองทีมการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 2.2.70
                            <br /> ทั้งสองทีมทำประตูที่ 1 และ / หรือ 2 ครึ่ง
                            <br /> 2.2.70.1
                            <br /> ทั้งสองทีมทำคะแนนในครึ่งแรกและ / หรือครึ่งหลังหมายถึงการเดิมพันเพื่อคาดการณ์ว่าทั้งสองทีมจะได้คะแนนในครึ่งแรกและถ้าทั้งสองทีมทำคะแนนในครึ่งหลังของการแข่งขัน
                            <br /> 2.2.70.2
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่ทั้งสองทีมทำคะแนนได้ในครึ่งแรกและครึ่งหลังของการแข่งขัน
                            <br /> 2.2.71
                            <br /> ทั้งสองทีมทำคะแนน / ประตูรวม
                            <br /> 2.2.71.1
                            <br /> ทั้งสองทีมทำประตู / รวมหมายถึงการเดิมพันเพื่อทำนายจำนวนประตูทั้งหมดในการแข่งขันและหากทั้งสองทีมทำคะแนนในการแข่งขัน
                            <br /> 2.2.71.2
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.72
                            <br /> ผลการแข่งขันครึ่งเวลา / ผลรวม
                            <br /> 2.2.72.1
                            <br /> ผลการแข่งขันครึ่งเวลา / ประตูรวมหมายถึงการเดิมพันทั้งสองทำนายผลของครึ่งแรกของการแข่งขันและจำนวนประตูครึ่งแรกทั้งหมด
                            <br /> 2.2.72.2
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกในช่วงครึ่งแรกของการแข่งขัน การเดิมพันจะยังคงใช้งานได้หากการแข่งขันถูกยกเลิกระหว่างช่วงครึ่งหลังของการแข่งขัน
                            <br /> 2.2.73
                            <br /> ครึ่งแรกของการทำประตู / ครึ่งหลังของสกอร์
                            <br /> 2.2.73.1
                            <br /> ครึ่งแรกของการทำประตู / ครึ่งหลังของสกอร์หมายถึงการเดิมพันเพื่อคาดการณ์ว่าทีมเจ้าบ้านทำประตูในครึ่งแรกและครึ่งหลังของการแข่งขัน
                            <br /> 2.2.73.2
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.74
                            <br /> ครึ่งเวลาแรกของการทำประตู / ครึ่งหลังของสกอร์
                            <br /> 2.2.74.1
                            <br /> คะแนนครึ่งแรกของการทำประตู / ครึ่งหลังของสกอร์หมายถึงการเดิมพันเพื่อคาดเดาว่าทีมเยือนจะทำคะแนนในครึ่งแรกและครึ่งหลังของการแข่งขัน
                            <br /> 2.2.71
                            <br/> 2.2.74.2
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.75
                            <br /> เฉพาะ 15 นาที 1X2
                            <br /> 2.2.75.1
                            <br /> เฉพาะ 15 นาที 1X2 หมายถึงการเดิมพันเพื่อคาดการณ์ผลการแข่งขันที่เป็นไปได้สามอย่างในตอนท้ายของทุกๆ 15 นาที (ช่วงทดของ)
                            ของการแข่งขัน 1 หมายถึงทีมที่ได้รับการตั้งชื่อเป็นอันดับแรก (โดยปกติทีมบ้านเกิด); X หมายถึงเกมที่เกิดขึ้นในการดึงหรือเสมอ;
                            2 หมายถึงทีมที่มีชื่อเป็นที่สอง (โดยปกติจะอยู่ห่างจากทีม)
                            <br /> 2.2.75.2
                            <br /> ตัวอย่างเช่น:
                            <br /> นาทีที่ 15 นาที 1X2
                            <br /> คาดการณ์ผลการชนะที่เป็นไปได้ 3 อย่างคือ 1X2 ตั้งแต่เวลา 00:00 - 15:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            15
                            <br />
                            <br /> นาที 30 นาที 1X2
                            <br /> คาดการณ์ผลการชนะที่เป็นไปได้สามอย่างคือ 1X2 ตั้งแต่เวลา 15:01 - 30:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            30
                            <br />
                            <br /> 45 นาที 1X2
                            <br /> คาดการณ์ผลการชนะที่เป็นไปได้สามอย่างคือ 1X2 จาก 30:01 น. - 45:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            45
                            <br />
                            <br /> นาทีที่ 60 นาที 1 วินาที
                            <br /> คาดการณ์ผลการชนะที่เป็นไปได้สามอย่างซึ่งเป็น 1X2 จาก 45:01 - 60:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            60
                            <br />
                            <br /> นาที 75 นาที 1X2
                            <br /> คาดการณ์ผลการชนะที่เป็นไปได้สามอย่างซึ่งเป็น 1X2 จาก 60:01 - 75:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            75
                            <br />
                            <br /> 90 นาที 1X2
                            <br /> คาดการณ์ผลการชนะที่เป็นไปได้สามอย่างซึ่งเป็น 1X2 จาก 75:01 - 90:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            90
                            <br /> 2.2.75.3
                            <br /> สำหรับระยะเวลาเฉพาะ 15 นาที 1X2 การเดิมพันจะตัดสินตามเวลาที่แน่นอนของการทำประตู (ลูกที่ข้ามเส้นประตู) จำนวนมุม (มุมที่ถ่าย)
                            และจำนวนการจองทั้งหมด (บัตรที่กำหนดโดยผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงโดยนาฬิกาตาม เผยแพร่ในการถ่ายทอดสด
                            <br /> 2.2.75.4
                            <br /> หากมีการระงับหรือยกเลิกการแข่งขันการวางเดิมพันที่ยังไม่เสร็จภายใน 15 นาที 1X2 จะถือเป็นโมฆะ หากกำหนดเวลาที่กำหนด
                            15 นาที 1X2 เสร็จสมบูรณ์เดิมพันจะมีผลสมบูรณ์
                            <br /> 2.2.75.5
                            <br /> ในช่วงสองนาทีสุดท้ายของการเดิมพันสดแบบเฉพาะ 15 นาที 1X2 การดำเนินการใด ๆ ที่นอกเหนือจากที่ระบุไว้ในที่นี้จะถือว่าเป็นการเล่นแบบปลอดภัยและทำให้การเดิมพันที่ค้างอยู่ทั้งหมดอาจได้รับการพิจารณาเพื่อรับ:
                            เป้าหมายโทษและสีแดง การ์ด
                            <br /> 2.2.75.6
                            <br /> สำหรับช่วงเวลา 30:01 น. - 45:00 น. และ 75:01 - 90:00 การเดิมพันจะตัดสินตามเวลาที่แน่นอนของการทำประตู (ลูกที่ข้ามเส้นประตู)
                            จำนวนมุม (มุมที่ถ่าย) และการจองรวม ผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงไว้ในนาฬิกาตามที่เผยแพร่ในการถ่ายทอดสดโดยไม่รวมเวลาหรือเวลาบาดเจ็บเพิ่มขึ้น
                            <br /> 2.2.76
                            <br /> ทีมใดจะก้าวไปสู่รอบต่อไป
                            <br /> 2.2.76.1
                            <br /> ทีมใดจะเข้าสู่รอบถัดไปหมายถึงการเดิมพันเพื่อคาดการณ์ว่าทีมใดจะเข้าสู่รอบต่อไปของการแข่งขัน
                            <br /> 2.2.77
                            <br /> แฮนดิแคปพิเศษ 10 นาที (HDP)
                            <br /> 2.2.77.1
                            <br /> แฮนดิแค็ป 10 นาทีที่เฉพาะเจาะจงหมายถึงการเดิมพันเมื่อผู้แข่งขันหรือทีมคนหนึ่งได้รับตำแหน่งหัวเช็ดเสมือนผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าหลังจากเพิ่มแฮนดิแคปให้กับทุกสิ้นระยะเวลา
                            10 นาที การแข่งขัน
                            <br /> 2.2.77.2
                            <br /> ตัวอย่างเช่น:
                            <br /> HDP ที่ 10 นาที
                            <br /> 00:00 - 10:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่เวลา 00:00 ถึง 10:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            10
                            <br />
                            <br /> HDP ที่ 20 นาที
                            <br /> 10:01 - 20:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่เวลา 10:01 ถึง 20:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            20
                            <br />
                            <br /> HDP ที่ 30 นาที
                            <br /> 20: 01- 30:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 20:01 - 30:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            30
                            <br />
                            <br /> HDP ที่ 40 นาที
                            <br /> 30:01 - 40:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 30:01 ถึง 40:00 น. การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            40
                            <br />
                            <br /> HDP ที่ 60 นาที
                            <br /> 50: 01- 60:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 50:01 จนถึง 60:00 น. การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            60
                            <br />
                            <br /> HDP นาทีที่ 70
                            <br /> 60: 01-70:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 60:01 จนถึง 70:00 การเดิมพันทั้งหมดต้องวางในหรือก่อนสิ้นนาทีที่
                            70
                            <br />
                            <br /> HDP นาทีที่ 80
                            <br /> 70: 01- 80:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 70:01 ถึง 80:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            80
                            <br />
                            <br /> HDP ที่ 90 นาที
                            <br /> 80: 01-90:00 HDP: ผู้ชนะคือผู้แข่งขันหรือทีมที่มีคะแนนดีกว่าตั้งแต่ 80:01 จนถึง 90:00 การเดิมพันทั้งหมดจะต้องวางในหรือก่อนสิ้นนาทีที่
                            90
                            <br /> 2.2.77.3
                            <br /> สำหรับช่วงเวลาพิเศษ 10-Minute HDP การเดิมพันจะตัดสินตามเวลาที่กำหนดไว้ในการทำประตู (ลูกที่ข้ามเส้นประตู) จำนวนมุม
                            (มุมที่ถ่าย) และจำนวนการจองทั้งหมด (บัตรที่ผู้ตัดสินกำหนด) ตามที่แสดงไว้ในนาฬิกา ตามที่เผยแพร่ในการถ่ายทอดสด
                            <br /> 2.2.77.4
                            <br /> หากการแข่งขันถูกระงับหรือถูกยกเลิกการเล่นการวางเดิมพันที่ยังไม่เสร็จสมบูรณ์ HDP 10 นาทีที่เฉพาะเจาะจงจะถือเป็นโมฆะ
                            หากกำหนดเวลา HDP เฉพาะ 10 นาทีที่กำหนดไว้เดิมพันจะถูกต้อง
                            <br /> 2.2.77.5
                            <br /> ในช่วงสองนาทีสุดท้ายของการถ่ายทอดสดการแข่งขัน HDP แบบเฉพาะเจาะจง 10 นาทีการกระทำใด ๆ ที่นอกเหนือจากที่กล่าวถึงในที่นี้จะถือว่าเป็นการเล่นแบบปลอดภัยและทำให้การเดิมพันที่ค้างอยู่ทั้งหมดอาจได้รับการพิจารณาเพื่อรับ:
                            เป้าหมายโทษและสีแดง การ์ด
                            <br /> 2.2.77.6
                            <br /> สำหรับ 80: 01-90: 00 การเดิมพันจะตัดสินตามเวลาที่กำหนดไว้ (ลูกที่ข้ามเส้นประตู) จำนวนมุม (มุมที่ถ่าย) และการจองทั้งหมด
                            (บัตรที่ได้รับจากผู้ตัดสินอย่างเป็นทางการ) ตามที่แสดงโดย นาฬิกาตามที่เผยแพร่ในการถ่ายทอดสดโดยไม่รวมเวลาหรือเวลาบาดเจ็บเพิ่มขึ้น
                            <br /> 2.2.78
                            <br /> การลงโทษครั้งแรกเพื่อทำคะแนนหรือไม่ให้คะแนน
                            <br /> 2.2.78.1
                            <br /> การลงโทษครั้งแรกในการทำสกอร์หรือไม่ให้ทำประตูหมายถึงการเดิมพันเพื่อคาดการณ์ว่าการลงโทษในทีมครั้งแรกจะได้คะแนนหรือไม่ดี
                            <br /> 2.2.79
                            <br /> ผู้สนับสนุนเจอร์ซีย์ยอดเยี่ยม
                            <br /> 2.2.79.1
                            <br /> สปอนเซอร์ชั้นนำของเจอร์ซีย์หมายถึงการเดิมพันเพื่อทำนายว่าผู้สนับสนุนเสื้อสปอนเซอร์จะมีทีมสนับสนุนบ้างชนะได้อย่างไร
                            <br /> 2.2.80
                            <br /> ทวีปของหัวหน้าโค้ชผู้ชนะ
                            <br /> 2.2.80.1
                            <br /> ทวีปของหัวหน้าโค้ชผู้ชนะหมายถึงการเดิมพันเพื่อทำนายทวีปต้นกำเนิดของหัวหน้าโค้ชของทีมที่จะชนะชื่อ
                            <br /> 2.2.81
                            <br /> มาร์จิ้นที่ชนะ
                            <br /> 2.2.81.1
                            <br /> การชนะหมายถึงการเดิมพันเพื่อทำนายผู้ชนะของแมตช์และขอบของประตูที่จะทำประตูระหว่างทีมบ้านกับทีมเยือน
                            <br /> 2.2.81.2
                            <br /> ตัวเลือกที่ใช้ได้สำหรับประเภทการเดิมพันนี้คือตัวเลือกที่ระบุไว้ในเว็บไซต์ ตัวอย่างเช่น:
                            <br /> •บ้านชนะด้วย 1 ประตู
                            <br /> •บ้านชนะด้วย 2 ประตู
                            <br /> •บ้านชนะได้ 3 ประตูขึ้นไป
                            <br /> •คะแนนเป้าหมายใด ๆ วาด
                            <br /> •ชนะไป 1 ประตู
                            <br /> •ชนะไป 2 ประตู
                            <br /> •ชนะไป 3 ประตูหรือมากกว่า
                            <br /> 2.2.81.3
                            <br /> สำหรับประเภทเดิมพันนี้พิเศษเวลาจะไม่รวมอยู่ในการกำหนดขอบชนะ
                            <br /> 2.2.82
                            <br /> เป้าหมายถัดไป, ครึ่งแรกหลังประตูถัดไปและเวลาต่อไปเป้าหมายถัดไป
                            <br /> 2.2.82.1
                            <br /> ประตูถัดไปหมายถึงการเดิมพันเพื่อทำนายว่าทีมทำประตูต่อไปในการแข่งขัน
                            <br /> 2.2.82.2
                            <br /> ครึ่งหลังถัดไปหมายถึงการเดิมพันเพื่อทำนายว่าทีมทำประตูต่อไปในครึ่งแรกของการแข่งขัน
                            <br /> 2.2.82.3
                            <br /> เวลาพิเศษต่อไปหมายถึงการเดิมพันเพื่อทำนายว่าทีมจะทำประตูต่อไปในการแข่งขันเวลาพิเศษ
                            <br /> 2.2.82.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.83
                            <br /> การลงโทษที่ได้รับ
                            <br /> 2.2.83.1
                            <br /> การลงโทษหมายถึงการเดิมพันเพื่อคาดการณ์ว่าจะมีการลงโทษในการแข่งขันหรือไม่
                            <br /> 2.2.83.2
                            <br /> มีตัวเลือกต่อไปนี้:
                            <br /> ใช่ใช่
                            <br /> ไม่ได้
                            <br /> 2.2.84
                            <br /> ครึ่งคะแนนสูงสุด
                            <br /> 2.2.84.1
                            <br /> ครึ่งคะแนนสูงสุดหมายถึงการเดิมพันเพื่อคาดการณ์ว่าครึ่งหลังของการแข่งขันใดจะมีจำนวนประตูมากขึ้น
                            <br /> 2.2.84.2
                            <br /> มีตัวเลือกต่อไปนี้:
                            <br /> 1. ครึ่งแรก
                            <br /> 2. ครึ่งหลัง
                            <br /> 3. Tie
                            <br /> 2.2.84.3
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกจนกว่าจะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.84.4
                            <br /> ทีมเจ้าบ้านคะแนนสูงสุด
                            <br />
                            <br /> 2.2.84.4.1 ทีมเจ้าบ้านคะแนนที่สูงที่สุดครึ่งหมายถึงการเดิมพันเพื่อคาดการณ์ว่าครึ่งหลังของแมตช์ใดจะมีจำนวนประตูรวมเพิ่มขึ้นเป็นจำนวนมาก
                            <br />
                            <br /> 2.2.84.4.2 ทีมเจ้าบ้านคะแนนสูงสุดครึ่งหมายถึงการเดิมพันเพื่อคาดการณ์ว่าครึ่งหลังของแมตช์ใดจะมีจำนวนประตูรวมมากขึ้น
                            <br /> 2.2.84.5
                            <br /> ทีมเยือนครึ่งคะแนนสูงสุด
                            <br />
                            <br /> 2.2.84.5.1 ทีมเยือนคะแนนสูงสุดครึ่งหมายถึงการเดิมพันเพื่อคาดการณ์ว่าครึ่งหลังของการแข่งขันจะมีจำนวนประตูที่มากขึ้นหรือไม่
                            <br />
                            <br /> 2.2.84.5.2 การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.85
                            <br /> ครึ่งเวลา / เต็มเวลาแก้ไขคะแนน
                            <br /> 2.2.85.1
                            <br /> ครึ่งเวลา / เต็มเวลาคะแนนที่ถูกต้องหมายถึงการเดิมพันทั้งทำนายคะแนนที่ถูกต้องในครึ่งเวลาและให้คะแนนสุดท้ายที่ถูกต้องเมื่อสิ้นสุดการแข่งขัน
                            <br /> 2.2.85.2
                            <br /> เดิมพันจะถือเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการตัดสินเดิมพันเรียบร้อยแล้วสำหรับประเภทการเดิมพันนี้ "4+"
                            หมายถึงตัวเลือกการเดิมพันที่มีคะแนนรวมหลังทำประตูเต็มเวลาอย่างน้อยสี่ (4) เพื่อชนะการเดิมพัน .
                            <br /> 2.2.85.3
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะได้มีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.86
                            <br /> ผู้ที่จะทำประตู -
                            <br />2.2.86.1
                            <br /> Goalscorer – Anytime หมายถึงการเดิมพันว่าผู้เล่นในทีมนั้นจะยิงประตูในระหว่างการแข่งขันแต่จะไม่รวมการต่อเวลาแบบพิเศษ.
                            <br /> 2.2.86.2
                            <br /> การยิงเข้าประตูตัวเองจะไม่นับ.
                            <br /> 2.2.86.3
                            <br /> การเดิมพันใช้ได้โดยไม่คำนึงถึงระยะเวลาที่ผู้เล่นเข้าร่วมการแข่งขัน.
                            <br /> 2.2.86.4
                            <br /> การเดิมพันผู้เล่นที่ไม่มีส่วนร่วมในการแข่งขันจะเป็นโมฆะและได้รับเงินคืน
                            <br /> 2.2.86.5
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว.
                            <br /> 2.2.87
                            <br /> Player Sent Off & First Half Player Sent Off
                            <br /> 2.2.87.1
                            <br /> Player Sent Off หมายถึงการเดิมพันว่าผู้เล่นใดจะถูกเปลี่ยนออกในเวลาการแข่งขันเต็มเวลา.
                            <br /> 2.2.87.2
                            <br /> First Half Player Sent Off หมายถึงการวางเดิมว่าผู้เล่นใดจะถูกเปลี่ยนออกในเวลาการแข่งขันครึ่งเวลา.
                            <br /> 2.2.87.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.87.4
                            <br /> Home Team Player Sent Off & First Half Home Team Player Sent Off
                            <br />
                            <br /> 2.2.87.4.1. Home Team Player Sent Off หมายถึงการเดิมพันว่าผู้เล่นฝ่ายเจ้าบ้านจะถูกเปลี่ยนออกในเวลาการแข่งขันเต็มเวลา..
                            <br />
                            <br /> 2.2.87.4.2. First Half Home Team Player Sent Off หมายถึงการเดิมพันว่าผู้เล่นเจ้าบ้านจะถูกเปลี่ยนออกในเวลาการแข่งขันครึ่งเวลา..
                            <br />
                            <br /> 2.2.87.4.3. หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.87.5
                            <br /> Away Team Player Sent Off & First Half Away Team Player Sent Off
                            <br />
                            <br /> 2.2.87.5.1. Away Team Player Sent Off หมายถึงการเดิมพันว่าผู้เล่นฝ่ายทีมเยือนจะถูกเปลี่ยนออกในเวลาการแข่งขันเต็มเวลา.
                            <br />
                            <br /> 2.2.87.5.2. First Half Away Team Player Sent Offหมายถึงการเดิมพันว่าผู้เล่นฝ่ายทีมเยือนจะถูกเปลี่ยนออกในเวลาการแข่งขันครึ่งเวลา.
                            <br />
                            <br /> 2.2.87.5.3.หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.88
                            <br /> Extra Time Yes/No
                            <br /> 2.2.88.1
                            <br /> Extra Time Yes/No หมายถึงการเดิมพันว่าจะมีการต่อเวลาพิเศษหรือไม่.
                            <br /> 2.2.88.2
                            <br /> การแข่งขันจะถูกยกเลิกก่อนเวลาปกติจะหมดการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.89
                            <br /> Extra Time/Goal
                            <br /> 2.2.89.1
                            <br /> Extra Time/Goal หมายถึงการเดิมพันว่าจะมีการทำประตูในการต่อเวลาพิเศษ.
                            <br /> 2.2.89.2
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.90
                            <br /> Both Halves Over & Under Yes/No
                            <br /> 2.2.90.1
                            <br /> Both Halves Over 1.5 Yes/No หมายถึงการเดิมพันเพื่อคาดการณ์ว่าจะมีการทำประตูสองครั้ง (2) ขึ้นไปครึ่งเวลาแรกของการแข่งขันหรือไม่.
                            <br /> 2.2.90.2
                            <br /> Both Halves Under 1.5 Yes/No หมายถึงการเดิมพันเพื่อคาดการณ์ว่าจะมีการทำประตูน้อยกว่าสองครั้ง (2) ในครึ่งเวลาแรกของการแข่งขันหรือไม่.
                            <br /> 2.2.90.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.91
                            <br /> First Goal Specific Time
                            <br /> 2.2.91.1
                            <br /> First Goal Specific Timeหมายถึงการเดิมพันเพื่อคาดการณ์ว่าจะมีการทำประตูในช่วงเวลาที่กำหนดโดยมีช่วงเวลา 10 นาทีหรือ
                            15 นาที.
                            <br /> 2.2.91.2
                            <br /> การทำเข้าประตูตัวเองจะนับเฉพาะครึ่งแรก.
                            <br /> 2.2.91.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.92
                            <br /> Match Decided Method
                            <br /> 2.2.92.1
                            <br /> Match Decided Method หมายถึงการเดิมพันทั้งคู่ ทำนายผู้ชนะและวิธีการชนะการแข่งขัน.
                            <br /> 2.2.92.2
                            <br /> The following options are available:
                            <br /> • Home/เวลาปกติ
                            <br /> • Home/ต่อเวลาพิเศษ
                            <br /> • Home/ดวลจุดโทษ
                            <br /> • Away/เวลาปกติ
                            <br /> • Away/ต่อเวลาพิเศษ
                            <br /> • Away/ดวลจุดโทษ
                            <br /> 2.2.92.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.93
                            <br /> 1st Half Total vs. 2nd Half Total
                            <br /> 2.2.93.1
                            <br /> 1st Half Total Goal vs. 2nd Half Total Goal
                            <br />
                            <br /> 2.2.93.1.1. 1st Half Total Goal vs. 2nd Half Total Goal หมายถึงการเดิมพันเพื่อทำนายจำนวนประตูทั้งหมดที่ทำประตูได้ในช่วงครึ่งแรกและครึ่งหลังของการแข่งขัน.
                            <br />
                            <br /> 2.2.93.1.2.การต่อเวลาพิเศษจะไม่นับรวมกับผลสกอร์ทั้งหมด.
                            <br />
                            <br /> 2.2.93.1.3. 1st Half Total Goal vs. 2nd Half Total Goal หมายถึงการเดิมพันเพื่อทำนายจำนวนประตูทั้งหมดที่ทำประตูได้ในช่วงครึ่งแรกและครึ่งหลังของการแข่งขัน.
                            <br /> 2.2.93.2
                            <br /> 1st Half Total Corner vs. 2nd Half Total Corner
                            <br />
                            <br /> 2.2.93.2.1 1st Half Total Corner vs. 2nd Half Total Corner หมายถึงการเดิมพันในการทำนายจำนวนมุมทั้งหมดที่เกิดขึ้นในครึ่งแรกและครึ่งหลังของการแข่งขัน.
                            <br />
                            <br /> 2.2.93.2.2. เวลาพิเศษไม่นับรวมเพื่อคำนวณจำนวนมุมทั้งหมด
                            <br />
                            <br /> 2.2.93.2.3.การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกก่อนสิ้นเวลาเล่นปกติ.
                            <br /> 2.2.93.3
                            <br /> 1st Half Total Booking vs. 2nd Half Total Booking
                            <br />
                            <br /> 2.2.93.3.1. 1st Half Total Booking vs. 2nd Half Total Booking หมายถึงการเดิมพันจำนวนรวมของ ใบเหลือใบแดงของ 1st Half
                            and the 2nd Half ของการแข่งขัน.
                            <br />
                            <br /> 2.2.93.3.2. การต่อเวลาพิเศษจะไม่นับผลรวมใบเหลืองแดงของ90นาทีแรก.
                            <br />
                            <br /> 2.2.93.3.3. การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกก่อนสิ้นเวลาเล่นปกติ.
                            <br /> 2.2.94
                            <br /> Next Goal Time
                            <br /> 2.2.94.1
                            <br /> Next Goal Time หมายถึงการเดิมพันในกรอบเวลาที่จะมีการทำประตูต่อไปในช่วงเวลาที่กำหนดโดยมีช่วงเวลา 10 นาทีหรือ 15 นาที
                            <br /> 2.2.94.2
                            <br /> Next Goal Time หมายถึงการเดิมพันในกรอบเวลาที่จะมีการทำประตูต่อไปในช่วงเวลาที่กำหนดโดยมีช่วงเวลา 10 นาทีหรือ 15 นาที.
                            <br /> 2.2.94.3
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 2.2.95
                            <br /> Total Goals Minutes
                            <br /> 2.2.95.1
                            <br /> Total Goals Minutes หมายถึงการเดิมพันเพื่อทำนายผลรวมของทุกนาทีที่ตรงกับเวลาที่กำหนดเมื่อทั้งสองทีมทำประตูระหว่างการแข่งขัน
                            <br /> 2.2.95.2
                            <br /> ในการกำหนดนาทีของการทำประตูให้ปัดเศษเศษของนาที (1- 59 วินาที) ให้ใกล้เคียงกับนาทีที่ใกล้ที่สุด
                            <br />
                            <br /> For example:
                            <br /> oals at 22.55 minute (23 min) + 34.35 (35 min) + 55.05 (56 min) = 114 minutes.
                            <br /> 2.2.95.3
                            <br /> ประตูที่ยิงได้ในช่วงครึ่งแรกของการบาดเจ็บครึ่งแรกจะนับเป็น 45 ประตูใด ๆ ที่ทำประตูในช่วงทดเวลาบาดเจ็บครึ่งหลังจะนับเป็น
                            90
                            <br /> 2.2.95.4
                            <br /> เวลาพิเศษและการยิงลูกจุดโทษจะไม่ถูกนับรวมในการคำนวณนาทีรวมของการทำประตู.
                            <br /> 2.2.95.5
                            <br /> การทำเข้าประตูตัวเองจะถูกนับรวมในเวลาการทำประตู.
                            <br /> 2.2.95.6
                            <br /> นาทีเป้าหมายทั้งหมดจะหมายถึงเวลาของเป้าหมายตามที่ปรากฏในการออกอากาศทางโทรทัศน์ หากเกิดข้อพิพาทเกี่ยวกับเวลาของเป้าหมายใด
                            ๆ เวลาที่จัดทำโดยเว็บไซต์การแข่งขันอย่างเป็นทางการจะถือเป็นเวลาในการชำระบัญชี.
                            <br /> 2.2.95.7
                            <br /> หากการแข่งขันถูกยกเลิกการเดิมพันทั้งหมดถือเป็นโมฆะ.
                            <br /> 2.2.96
                            <br /> Next Set Piece
                            <br /> 2.2.96.1
                            <br /> Next Set Piece หมายถึงการเดิมพันในการทำนายว่าเหตุการณ์ใดในสี่เหตุการณ์ (1) การเตะมุม (Corner Kick) (2) การโยนโทษ
                            (3) การเตะลูกโทษและ (4) การเตะฟรี - จะเกิดขึ้นต่อไปหลังจากเวลานัดหมายที่ระบุ.
                            <br /> 2.2.96.2
                            <br /> เมื่อมีการเปิดใช้งานผลิตภัณฑ์ชุดถัดไปสมาชิกจะได้รับเวลาในการแข่งขันที่ระบุ ตัวอย่างเช่น:ลูกตั้งเตะ: หลังจาก 02:39".
                            <br /> 2.2.96.3
                            <br /> เดิมพันถูกระงับ 10 วินาทีก่อนเวลาการแข่งขันที่ระบุ หลังจากระยะเวลา 10 วินาทีหมดอายุการเดิมพันทั้งหมดจะเริ่มใช้งานและเหตุการณ์ถัดไปที่จะเกิดขึ้นหลังจากเวลาการแข่งขันที่กำหนดจะเป็นตัวกำหนดผลการแข่งขัน.
                            <br /> 2.2.96.4
                            <br /> การกระทำและการตัดสินใจของหัวหน้าผู้ตัดสินจะเป็นที่สิ้นสุดโดยไม่คำนึงถึงการกระทำของผู้ช่วยผู้ตัดสินที่ให้ความช่วยเหลือหรือสิ่งใดที่แสดงโดยการภาพช้า.
                            <br /> 2.2.96.5
                            <br /> เดิมพันที่เกิดขึ้นในช่วงครึ่งแรกที่ยังไม่ได้รับการแก้ไขโดยครึ่งเวลาจะนำไปสู่ช่วงครึ่งหลัง.
                            <br /> 2.2.96.6
                            <br /> การวางเดิมพันระหว่างเกมที่ยังไม่ได้รับการแก้ไขเมื่อสิ้นสุดเวลาปกติจะได้รับการคืนเงิน.
                            <br /> 2.2.96.7
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.97
                            <br /> Goal Within 60 Seconds
                            <br /> 2.2.97.1
                            <br /> Goal Within 60 Seconds หมายถึงการเดิมพันเพื่อคาดการณ์ว่าจะมีการทำประตูภายใน 60 วินาทีหลังจากการเตะลูกโทษ (1) (2)
                            เตะมุม (Kick Corner) หรือ (3) เตะฟรี - แต่ละจะถูกเรียกว่า "Dangerous Kick".
                            <br /> 2.2.97.2
                            <br /> เดิมพันจะได้รับการยอมรับหลังจากเป่านกหวีดเป็น Dangerous Kick และจะปิดก่อน 2-3 วินาทีก่อนที่ Dangerous Kick จะดำเนินการจริง
                            <br /> 2.2.97.3
                            <br /> การนับถอยหลัง 60 วินาทีจะเริ่มต้นนับจากช่วงเวลาที่มีการแสดง Dangerous Kick
                            <br /> 2.2.97.4
                            <br /> ถ้าหัวหน้าผู้ตัดสินได้รับรางวัลการเตะลูกโทษในช่วงระยะเวลาการเล่น 60 วินาทีการเตะลูกโทษจะถือว่าเกิดขึ้นภายในระยะเวลา
                            60 นาทีในการเล่นโดยไม่คำนึงว่าจะมีการดำเนินการใดและจะทำประตูใดก็ตาม ได้รับคะแนนภายในระยะเวลาการเล่น 60 วินาทีแรก
                            <br />
                            <br /> For Example:
                            <br /> ผู้ตัดสินหัวโทษจะเตะลูกโทษในนาทีที่ 59 Dangerous Kick ก่อนหน้านี้และการเตะลูกโทษจะทำได้สำเร็จโดยไม่คำนึงว่าการเตะลูกโทษครั้งใดจะเกิดขึ้นจริงเป้าหมายจะถือว่าได้คะแนนภายใน
                            60 วินาทีแรก ระยะเวลาในการเล่นเพื่อวัตถุประสงค์ในการพิจารณาเดิมพันที่ชนะ.
                            <br /> 2.2.97.5
                            <br /> สำหรับวัตถุประสงค์ในการพิจารณาเดิมพันที่ชนะจะถือว่ามีการทำประตูหากได้รับรางวัลจริงโดยหัวหน้าผู้ตัดสินโดยไม่คำนึงถึงการกระทำของผู้ตัดสินที่ให้ความช่วยเหลือหรือสิ่งที่แสดงโดยการเล่นซ้ำวิดีโอ
                            <br /> 2.2.97.6
                            <br /> ตลาดนี้ไม่ใช้กับการดวลลูกโทษ.
                            <br /> 2.2.97.7
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.98
                            <br /> Every Single Minute
                            <br /> 2.2.98.1
                            <br /> Every Single Minute หมายถึงการเดิมพันเพื่อทำนายเหตุการณ์เฉพาะที่จะเกิดขึ้นในช่วงนาทีที่กำหนดหรือ 60 วินาทีเช่นการเตะมุมลูกเตะมุมลูกเตะมุมลูกกระพริบประตูหรืออื่น
                            ๆ ตามที่ระบุไว้
                            <br /> 2.2.98.2
                            <br /> เมื่อตลาดเปิดใช้งานสมาชิกจะได้รับเวลาในการจับคู่ที่ระบุตัวอย่างเช่น "Every Single Minute at: 02:00"
                            <br /> 2.2.98.3
                            <br /> เดิมพันถูกระงับ 10 วินาทีก่อนเวลาการแข่งขันที่ระบุ
                            <br /> 2.2.98.4
                            <br /> หลังจากระยะเวลา 10 วินาทีหมดอายุการเดิมพันทั้งหมดจะเริ่มใช้งานและเหตุการณ์ถัดไปที่จะเกิดขึ้นภายในหนึ่งนาทีหรือ 60
                            วินาทีนับจากเวลาที่กำหนดที่กำหนดไว้จะเป็นตัวกำหนดผลการแข่งขัน
                            <br /> 2.2.98.5
                            <br /> ลูกเตะจะถือว่าเกิดขึ้นในขณะที่ผู้ตัดสินเป่านกหวีด สัญญาณเตะฟรีคิก.
                            <br /> 2.2.98.6
                            <br /> การกระทำและการตัดสินใจของหัวหน้าผู้ตัดสินจะเป็นที่สิ้นสุดโดยไม่คำนึงถึงการกระทำของผู้ช่วยผู้ตัดสินหรือสิ่งใดที่แสดงโดยการเล่นซ้ำวิดีโอ.
                            <br /> 2.2.98.7
                            <br /> เดิมพันที่เกิดขึ้นในช่วงครึ่งแรกที่ยังไม่ได้รับการแก้ไขโดยครึ่งเวลาจะนำไปสู่ช่วงครึ่งหลัง.
                            <br /> 2.2.98.8
                            <br /> การวางเดิมพันระหว่างเกมที่ยังไม่ได้รับการแก้ไขเมื่อสิ้นสุดเวลาปกติจะได้รับการคืนเงิน.
                            <br /> 2.2.98.9
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว.
                            <br /> 2.2.99
                            <br /> First Goal
                            <br /> 2.2.99.1
                            <br /> First Goal หมายถึงการเดิมพันเพื่อทำนายเวลาที่ทำประตูแรกในการแข่งขัน.
                            <br /> 2.2.99.2
                            <br /> หากไม่มีการทำประตูเมื่อสิ้นสุดการแข่งขันการเดิมพันทั้งหมดจะสูญหายไป
                            <br /> 2.2.99.3
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว.
                            <br /> 2.2.100
                            <br /> Time of Possession
                            <br /> 2.2.100.1
                            <br /> Time of Possession หมายถึงการเดิมพันเพื่อคาดการณ์ว่าเปอร์เซ็นต์การครอบครองของทีมที่กำหนดจะเกินหรือต่ำกว่าเปอร์เซ็นต์ที่ระบุไว้.
                            <br /> 2.2.100.2
                            <br /> ผลลัพธ์ทั้งหมดจะขึ้นอยู่กับข้อมูลที่ได้รับจากเจ้าหน้าที่ third party data provider.
                            <br /> 2.2.100.3
                            <br /> หากการแข่งขันถูกยกเลิกก่อนที่จะเริ่มต้นการเดิมพันทั้งหมดจะเป็นโมฆะ.
                            <br /> 2.2.101
                            <br /> Home to Score in Both Halves
                            <br /> 2.2.101.1
                            <br /> ทำนายว่าทีมบ้านจะทำประตูได้อย่างน้อยหนึ่งเป้าหมายในแต่ละครึ่งหลังของการแข่งขันในการเล่น 90 นาที.
                            <br /> 2.2.101.2
                            <br /> หากทีมที่เลือกทำคะแนนได้เพียงครึ่งเดียวหรือไม่ได้คะแนนทั้งหมดเดิมพันทั้งหมดจะถูกตัดสินว่าเป็นเดิมพันที่สูญเสีย
                            <br /> 2.2.101.3
                            <br /> หากมีการทำประตูของตัวเองจะมีเฉพาะเครดิตของทีมที่มีเป้าหมายเท่านั้นที่จะนับเป็นเดิมพันตามลำดับ
                            <br /> 2.2.101.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว
                            <br /> 2.2.102
                            <br /> Away to Score in Both Halves
                            <br /> 2.2.102.1
                            <br /> ทำนายว่าทีมเยือนทำประตูอย่างน้อย 1 ประตูในครึ่งหลังของการแข่งขันในการเล่น 90 นาทีหรือไม่
                            <br /> 2.2.102.2
                            <br /> หากทีมที่เลือกทำคะแนนได้เพียงครึ่งหรือไม่ได้คะแนนทั้งหมดเดิมพันทั้งหมดจะถูกตัดสินว่าเป็นเดิมพันที่สูญเสีย
                            <br /> 2.2.102.3
                            <br /> หากมีการทำประตูของตัวเองจะมีเฉพาะเครดิตของทีมคู่แข่งเท่านั้นที่จะนับเป็นเดิมพันตามลำดับ.
                            <br /> 2.2.102.4
                            <br /> การเดิมพันจะเป็นโมฆะถ้าการแข่งขันถูกยกเลิกเว้นแต่จะมีการกำหนดเดิมพันเรียบร้อยแล้ว.
                            <br /> 2.2.103
                            <br /> Away to Score in Both Halves
                            <br /> 2.2.103.1
                            <br /> การเดิมพันเพื่อทำนายว่าทั้งสองทีมจะทำยอดได้ถึงสองอันดับแรกของกลุ่มได้อย่างไร.
                            <br /> 2.2.104
                            <br /> Team Stage of Elimination
                            <br /> 2.2.104.1
                            <br /> คาดการณ์ว่าจะมีการตกรอบจากการแข่งขันในช่วงเวลาใด.
                            <br /> 2.2.105
                            <br /> Rock Bottom
                            <br /> 2.2.105.1
                            <br /> ทายว่าทีมใดจะจบด้านล่างของกลุ่ม.
                            <br /> 2.2.106
                            <br /> Nominate Finalists
                            <br /> 2.2.106.1
                            <br /> ทำนายว่าทีมใดจะแข่งขันในรอบชิงชนะเลิศของการแข่งขัน
                            <br /> 2.2.107
                            <br /> To Reach Final
                            <br /> 2.2.107.1
                            <br /> To Reach Final หมายถึงการเดิมพันเพื่อคาดการณ์ทีมที่เลือกให้เข้าสู่รอบรองชนะเลิศของการแข่งขัน
                            <br /> 2.2.107.2
                            <br /> ตลาดใช้คะแนน Full-Time และรวมเวลาพิเศษหรือจุดโทษที่จำเป็นในการหาผู้ชนะ.
                            <br /> 2.2.108
                            <br /> To Reach Semi Final
                            <br /> 2.2.108.1
                            <br /> To Reach Semi Final หมายถึงการเดิมพันเพื่อทำนายว่าทีมที่เลือกจะเข้าสู่รอบรองชนะเลิศของการแข่งขัน.
                            <br /> 2.2.108.2
                            <br /> ตลาดใช้คะแนน Full-Time และรวมเวลาพิเศษหรือจุดโทษที่จำเป็นในการหาผู้ชนะ.
                            <br /> 2.2.109
                            <br /> To Reach Semi Final
                            <br /> 2.2.109.1
                            <br /> To Reach Quarter Final หมายถึงการเดิมพันเพื่อทำนายทีมที่เลือกไปถึงรอบรองชนะเลิศของการแข่งขัน
                            <br /> 2.2.109.2
                            <br /> ตลาดใช้คะแนน Full-Time และรวมเวลาพิเศษหรือจุดโทษที่จำเป็นในการหาผู้ชนะ..
                            <br /> 2.2.110
                            <br /> Which Team from Group to Qualify
                            <br /> 2.2.110.1
                            <br /> คาดการณ์ว่าทีมใดจะมีคุณสมบัติและจะเข้าสู่รอบต่อไปของการแข่งขันที่ระบุ.
                            <br /> 2.2.110.2
                            <br /> Market is based on Full-Time score and includes any Extra Time or Penalties needed to declare a winner.
                            <br /> 2.2.111
                            <br /> Winning Group
                            <br /> 2.2.111.1
                            <br /> คาดการณ์ว่าทีมใดจะมีทีมที่ชนะการแข่งขันในรายการบอลถ้วย
                            <br /> 2.2.112
                            <br /> Wining Continent
                            <br /> 2.2.112.1
                            <br /> Winning Continent หมายถึงการเดิมพันเพื่อคาดการณ์ว่าทวีปใดจะเป็นผู้ชนะในการแข่งขัน.
                            <br /> 2.2.113
                            <br /> League - Team to Be Relegated
                            <br /> 2.2.113.1
                            <br /> คาดการณ์ว่าทีมใดจะตกชั้นจากลีก.
                            <br /> 2.2.113.2
                            <br /> ตลาดนี้จะรวมถึงตำแหน่งการเนรเทศโดยอัตโนมัติและการเนรเทศผ่านโครงสร้างการเล่นใด ๆ ที่ใช้สำหรับลีกที่ระบุ.
                            <br /> 2.2.113.3
                            <br /> หากทีมใดถูกนำออกจากลีกหรือถูกตัดออกการเดิมพันในทีมนั้นจะเป็นโมฆะ หากเกิดเหตุการณ์นี้ก่อนเริ่มฤดูกาลตลาดทั้งมวลจะเป็นโมฆะและจะเปิดตลาดใหม่ขึ้น.
                            <br /> 2.2.114
                            <br /> League - To Finish Bottom
                            <br /> 2.2.114.1
                            <br /> คาดการณ์ว่าทีมใดจะจบด้านล่างของลีกที่เฉพาะเจาะจงในช่วงฤดูกาลลีก
                            <br /> 2.2.114.2
                            <br /> หากทีมใดถูกนำออกจากลีกหรือถูกตัดออกการเดิมพันในทีมนั้นจะเป็นโมฆะ หากเกิดเหตุการณ์นี้ขึ้นก่อนเริ่มฤดูกาลตลาดทั้งมวลจะเป็นโมฆะและจะเปิดตลาดใหม่
                            <br /> 2.2.115
                            <br /> ลีก - ทีมในตำแหน่งที่สองด้านล่าง
                            <br /> 2.2.115.1
                            <br /> คาดการณ์ว่าทีมใดจะจบอันดับสองในฤดูกาลนี้
                            <br /> 2.2.115.2
                            <br /> หากทีมใดถูกนำออกจากลีกหรือถูกตัดออกการเดิมพันในทีมนั้นจะเป็นโมฆะ หากเกิดเหตุการณ์นี้ขึ้นก่อนเริ่มฤดูกาลตลาดทั้งมวลจะเป็นโมฆะและจะเปิดตลาดใหม่
                            <br /> 2.2.116
                            <br /> ลีก - จะได้รับการส่งเสริม
                            <br /> 2.2.116.1
                            <br /> ทำนายว่าทีมใดจะได้รับการเลื่อนตำแหน่งจากลีก
                            <br /> 2.2.116.2
                            <br /> ตลาดนี้จะรวมทั้งตำแหน่งโปรโมชันอัตโนมัติและการโปรโมตผ่านโครงสร้างการเล่นแบบใดก็ตามที่ใช้สำหรับลีกที่ระบุ
                            <br /> 2.2.116.3
                            <br /> หากทีมใดถูกนำออกจากลีกหรือถูกตัดออกการเดิมพันในทีมนั้นจะเป็นโมฆะ หากเกิดเหตุการณ์นี้ขึ้นก่อนเริ่มฤดูกาลตลาดทั้งมวลจะเป็นโมฆะและจะเปิดตลาดใหม่
                            <br /> 2.2.117
                            <br /> ผู้ชนะและผู้ทำประตูสูงสุด
                            <br /> 2.2.117.1
                            <br /> ทำนายว่าทีมใดจะเป็นผู้ชนะในการแข่งขันและผู้เล่นจะทำประตูได้มากที่สุด
                            <br /> 2.2.117.2
                            <br /> การเดิมพันทั้งหมดใช้เวลาเล่น 90 นาทีและเพิ่มเวลาตามที่เจ้าหน้าที่จับคู่บวกกับเวลาหยุดงานใด ๆ
                            <br /> 2.2.117.3
                            <br /> ประตูที่ยิงได้ไม่นับรวม
                            <br /> 2.2.117.4
                            <br /> หากมีผู้เล่นมากกว่าหนึ่งคนที่ถูกมัดไว้สำหรับผู้ทำประตูสูงสุดให้ใช้กฎความร้อนที่ตายตัว
                            <br /> 2.2.118
                            <br /> ลีก - Tricast
                            <br /> 2.2.118.1
                            <br /> ลีก - ไทรคาสต์หมายถึงการเดิมพันในการทำนายทีมแรกทีมที่สองและสามและระบุในลำดับท้ายสุดของลีก
                            <br /> 2.2.118.2
                            <br /> ตัวอย่าง: แมนเชสเตอร์ซิตี้ / แมนเชสเตอร์ยูไนเต็ด / เชลซีต้องชนะในลำดับที่เฉพาะเจาะจงในตอนท้ายของลีก
                            <br /> 2.2.118.3
                            <br /> ตารางลีกขั้นสุดท้ายที่แสดงโดยเจ้าหน้าที่ของลีกนั้นคือผลการตัดสิน
                            <br /> 2.2.119
                            <br /> ลีก - ทีมไปไม่แพ้
                            <br /> 2.2.119.1
                            <br /> ทีมต้องทำลีกให้สมบูรณ์โดยไม่แพ้เกมใด ๆ
                            <br /> 2.2.120
                            <br /> To Win Title
                            <br /> 2.2.120.1
                            <br /> ทำนายว่าทีมใดจะชนะได้ในตอนท้ายของการแข่งขัน
                            <br /> 2.2.121
                            <br /> ทีมใด / ผู้เล่นจะก้าวไปไกลที่สุดในการแข่งขัน
                            <br /> 2.2.121.1
                            <br /> ทีมใด / ผู้เล่นจะลงเล่นมากที่สุดในทัวร์นาเมนท์หมายถึงการเดิมพันเพื่อคาดเดาทีมที่เลือก / ผู้เล่นจะเลื่อนไปไกลที่สุดในทัวร์นาเมนต์
                            <br /> 2.2.121.2
                            <br /> สองทีม / ผู้เล่นจะถูกจับคู่สำหรับการเลือกเดิมพันทีม / ผู้เล่นที่อยู่ในกลุ่มที่แตกต่างกันอาจจับคู่กับการเดิมพันเช่นเดียวกัน
                            <br /> 2.2.121.3
                            <br /> หากทั้งสองทีม / ผู้เล่นจับคู่การเดิมพันมีสิทธิ์เข้าร่วมการแข่งขันในครั้งต่อไปการเดิมพันทั้งหมดสำหรับทั้งสองทีม /
                            ผู้เล่นจะถูกยกไปสู่ขั้นตอนต่อไป
                            <br /> 2.2.121.4
                            <br /> การเดิมพันจะถือว่าเป็นแบบวาดถ้าทั้งสองทีม / ผู้เล่นจะถูกตัดออกในขั้นตอนเดียวกัน
                            <br />
                            <br /> กลับสู่ด้านบน
                            <br /> 3.
                            <br /> กฎการวางเดิมพันตามเหตุการณ์เฉพาะ
                            <br /> 3.1
                            <br /> กฎฟุตบอล
                            <br /> 3.1.1
                            <br /> เวลาที่กำหนดไว้สำหรับการเล่นอื่นที่ไม่ใช่เวลาปกติ (เช่นช่วงเวลาพิเศษในการเล่นในทัวร์นาเมนต์ต่างๆหรือการแข่งขันที่เป็นมิตร)
                            เดิมพันทั้งหมดจะถูกตัดสินเมื่อสิ้นสุดเวลาที่กำหนดไว้
                            <br /> 3.1.1.1
                            <br /> เมื่อมีการเล่นน้อยกว่าเวลาปกติผู้ดำเนินการขอสงวนสิทธิ์ในการระงับการชำระเงินเดิมพันทั้งหมดที่รอผลการแข่งขันอย่างเป็นทางการของการแข่งขันนั้น
                            <br /> 3.1.1.2
                            <br /> เว้นเสียแต่ว่าการแข่งขันในเวลาไม่ปกติจะมีการระบุไว้อย่างชัดเจนในเว็บไซต์ก่อนการแข่งขันฟุตบอลทั้งหมดการเดิมพันที่เกิดขึ้นในการแข่งขันดังกล่าวจะถือเป็น
                            VOID
                            <br /> 3.1.2
                            <br /> หากการแข่งขันฟุตบอลถูกเลื่อนออกไปหรือถูกยกเลิกหรือถูกระงับชั่วคราวและไม่สามารถดำเนินการต่อในวันเดียวกันการแข่งขันจะเป็นโมฆะ
                            การเดิมพันจะถือว่าสมบูรณ์หากการแข่งขันเริ่มต้นใหม่ก่อนหมดอายุ 12 ชั่วโมง การจับคู่จะถือเป็นโมฆะโดยไม่คำนึงถึงการตัดสินใจอย่างเป็นทางการใด
                            ๆ เพื่อเป็นเกียรติแก่ผลการแข่งขัน ผลของการเดิมพันทั้งหมดในการแข่งขันที่ถูกทิ้งร้าง / ถูกระงับการแข่งขันอยู่ภายใต้การพิจารณาของ
                            บริษัท แต่อย่างใด
                            <br /> 3.1.3
                            <br /> การเดิมพันครึ่งแรก (1H) ใช้กับการเล่นครึ่งแรกเท่านั้น หากการแข่งขันถูกยกเลิกในช่วงครึ่งแรกการเดิมพันทั้งหมดถือเป็นโมฆะ
                            หากการแข่งขันถูกยกเลิกในช่วงครึ่งหลังการเดิมพันครึ่งแรกทั้งหมดยังคงใช้ได้
                            <br /> 3.1.4
                            <br /> บริษัท ให้ข้อมูลสถานที่ (เช่นพื้นกลาง) เป็นบริการและไม่รับผิดชอบใด ๆ หากสถานที่จัดกลางที่ระบุไว้ถูกต้องหรือไม่ เป็นความรับผิดชอบของลูกค้าที่จะต้องตระหนักถึงสถานที่ที่เหมาะสมสำหรับการแข่งขันใด
                            ๆ
                            <br /> 3.1.5
                            <br /> เว้นแต่จะมีการระบุไว้เป็นอย่างอื่นหากสถานที่เปลี่ยนจากบ้านของทีมไปเป็นสถานที่ที่เป็นกลางหรือจากสถานที่ที่เป็นกลางที่ระบุไว้ก่อนหน้านี้ไปยังทีมที่บ้านแล้วการเดิมพันทั้งหมดถือว่าถูกต้อง
                            หากสถานที่เปลี่ยนจากบ้านของทีมที่บ้านไปเป็นทีมเยือนเดิมการเดิมพันจะถือเป็นโมฆะ การเดิมพันยังถือเป็นโมฆะถ้าชื่อทีมบ้านและทีมเยือนได้รับการระบุอย่างผิดพลาดในการกลับรายการ
                            <br /> 3.1.6
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันฟุตบอลสดและการเดิมพันที่แสดงในระหว่างการซื้อขายสดหมายถึงคะแนนที่แสดงในขณะวางเดิมพัน
                            คำชี้แจงเกี่ยวกับตัวจับเวลาและบัตรสีแดงมีไว้เพื่อจุดประสงค์ในการอ้างอิงเท่านั้น
                            <br /> 3.1.7
                            <br /> สำหรับการเดิมพันแบบสดในระหว่างเกมซึ่งเกี่ยวกับการดำเนินการที่ บริษัท เห็นสมควร แต่เพียงผู้เดียวและเห็นสมควรถือว่าเป็นอันตรายเมื่อคะแนนผลการทำงานของทีมหรือผู้เล่นคนใดคนหนึ่งอาจได้รับผลกระทบ
                            หรือ "การเล่นที่อันตราย") บริษัท ขอสงวนสิทธิ์ในการระงับการยอมรับการเดิมพันและอาจยอมรับหรือปฏิเสธการเดิมพันหลังจากเล่นอันตราย
                            การดำเนินการอื่น ๆ ทั้งหมดในเกมถือว่าปลอดภัยและการเล่นจะถือว่าได้รับการยอมรับ
                            <br /> 3.1.8
                            <br /> สำหรับการเดิมพันสดการวางเดิมพันจะได้รับอนุญาตภายใน 90 นาทีนอกเหนือจากเวลาการบาดเจ็บใด ๆ สำหรับเกมแบบเต็มเวลา (ตามดุลพินิจของ
                            บริษัท ) อย่างไรก็ตามจากนาทีที่ 85 ของการเล่นเป็นต้นไปหรือในช่วงห้านาทีที่ผ่านมาก่อนสิ้นสุดช่วงเวลาการแข่งขันใด ๆ
                            ที่สามารถใช้งานได้ในเกมการดำเนินการอื่นนอกเหนือจากที่ระบุไว้ในส่วน 3.1.8 นี้จะถือว่าเป็นสิ่งที่ปลอดภัยและด้วยเหตุนี้ทั้งหมด
                            การเดิมพันที่ค้างอยู่อาจถือเป็นที่ยอมรับได้: เล่นในหรือรอบบริเวณจุดโทษ; สถานการณ์โจมตีหนึ่งต่อหนึ่ง; โทษ; และลูกฟรีคิกที่
                            บริษัท ถือว่าเป็นอันตราย (ความเป็นไปได้ของเป้าหมาย)
                            <br /> 3.1.9
                            <br /> สำหรับการเดิมพันแบบสดการเดิมพันที่ค้างอยู่ทั้งหมดจะถูกปฏิเสธโดยอัตโนมัติในขณะที่ผู้ตัดสินจบการแข่งขันในครึ่งเวลาและ
                            / หรือเต็มเวลา
                            <br /> 3.1.10
                            <br /> สำหรับการเดิมพันแบบแฟนตาซีแบบสดการเดิมพันจะอนุญาตให้วางเดิมพันได้ถึง 90 นาทีนอกเหนือจากเวลาการบาดเจ็บใด ๆ สำหรับเกมแบบเต็มเวลา
                            (ตามดุลพินิจของ บริษัท ) ตั้งแต่เวลาเริ่มเล่น (00:00) เป็นต้นไปจนกว่าจะถึงเวลาสิ้นสุดของการแข่งขัน (90th minute)
                            แล้วแต่อย่างใดในเกมการกระทำใด ๆ ที่นอกเหนือจากที่ระบุไว้ในข้อ 3.1.8 นี้จะถือว่าปลอดภัย การเล่นและการวางเดิมพันที่ค้างอยู่ทั้งหมดอาจถือเป็นที่ยอมรับได้:
                            เล่นในหรือรอบบริเวณจุดโทษ; สถานการณ์โจมตีหนึ่งต่อหนึ่ง; โทษ; และลูกฟรีคิกที่ บริษัท ถือว่าเป็นอันตราย (ความเป็นไปได้ของเป้าหมาย)
                            <br /> 3.2
                            <br /> บาสเกตบอล
                            <br /> 3.2.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลการแข่งขันที่ผ่านมารวมถึงการต่อเวลาหากเล่น (ยกเว้นที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.2.2
                            <br /> หากการแข่งขันไม่ได้เริ่มต้นในวันที่เริ่มต้นตามกำหนดการเดิมพันทั้งหมดจะถือเป็นโมฆะ (เว้นแต่ที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.2.3
                            <br /> หากการแข่งขันเริ่มต้น แต่ถูกระงับหรือยกเลิกภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นตามกำหนดเวลาการเดิมพันแบบเต็มเวลาจะถือว่าถูกต้องถ้ามีการแข่งขันเอ็นบีเออย่างน้อยสี่สิบสาม
                            (43) นาทีหรือสามสิบห้า (35) นาที การแข่งขันบาสเกตบอลอื่น ๆ เสร็จสิ้นแล้ว การเดิมพันจะถือเป็นผลถ้าผลการแข่งขันอย่างเป็นทางการประกาศโดยคณะกรรมการที่เกี่ยวข้อง
                            มิเช่นนั้นการเดิมพันในการแข่งขันที่ถูกระงับหรือถูกยกเลิกจะถือเป็นโมฆะยกเว้นเดิมพันในตลาดที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.2.4
                            <br /> ผลการแข่งขันครึ่งแรกคือผลรวมของไตรมาสแรกและไตรมาสที่สอง ผลลัพธ์ครึ่งหลังคือผลรวมของไตรมาสที่สามและสี่รวมถึงการทำงานล่วงเวลาใด
                            ๆ ที่อาจมีขึ้น
                            <br /> 3.2.5
                            <br /> ผลการดำเนินงานในไตรมาสที่สี่ไม่รวมค่าล่วงเวลาใด ๆ ที่อาจมีขึ้น
                            <br /> 3.2.6
                            <br /> หากมีการระงับหรือยกเลิกการแข่งขันการวางเดิมพันในครึ่งหลังหรือไตรมาสที่ยังไม่เสร็จจะถือเป็นโมฆะ หากครึ่งหลังหรือไตรมาสที่กำหนดเสร็จสมบูรณ์เดิมพันจะมีผลสมบูรณ์
                            <br /> 3.2.7
                            <br /> คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันสดของบาสเกตบอลและแฮนดิแคปที่แสดงในระหว่างการซื้อขายสดหมายถึงคะแนนที่เริ่มต้นของการแข่งขันเช่น
                            0-0 เวลาและคะแนนที่แสดงไว้มีวัตถุประสงค์เพื่อการอ้างอิงเท่านั้น
                            <br /> 3.2.8
                            <br /> ทีมใดทำสกอร์ได้ก่อนจะตัดสินในทีมที่ทำแต้มได้แต้มแรก หากการแข่งขันถูกระงับหรือยกเลิกหลังจากได้รับแต้มแรกแล้วการเดิมพันยังคงใช้งานได้
                            <br /> 3.2.9
                            <br /> ทีมใดที่ทำสกอร์ล่าสุดได้จะตัดสินในทีมที่ทำแต้มได้แต้มสุดท้ายของการแข่งขัน (รวมถึงการต่อเวลา) หากการแข่งขันถูกระงับหรือยกเลิกการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.2.10
                            <br /> ตลาดพิเศษ (รวมถึงจำนวนคะแนน, การตีกลับ, การช่วยเหลือ, สามจุด, การโยนโทษฟรี ฯลฯ ) มีผลถ้าทั้งสองผู้เล่นเข้าร่วมการแข่งขัน
                            หากผู้เล่นหนึ่งหรือทั้งสองฝ่ายไม่เข้าร่วมการแข่งขันการเดิมพันทั้งหมดถือเป็นโมฆะ ผลการค้นหาสำหรับตลาดพิเศษ ได้แก่
                            การทำงานล่วงเวลายกเว้นที่ระบุไว้เป็นอย่างอื่น ผลการแข่งขันทั้งหมดจะถูกนำมาใช้เมื่อผลการแข่งขันถูกประกาศโดยเจ้าหน้าที่ของรัฐ
                            (NBA.com, FIBA.com ฯลฯ ) และการเปลี่ยนแปลงใด ๆ ที่เกิดขึ้นภายหลังในสถิติจะไม่สามารถใช้ในการเดิมพันได้
                            <br /> 3.2.11
                            <br /> สถานที่จัดงาน Home / Away สำหรับการแข่งขัน NCAA จะมีไว้เพื่อเป็นข้อมูลอ้างอิงเท่านั้น
                            <br /> 3.2.12
                            <br /> ตลาดบาสเกตบอลแฟนตาซีคือการจับคู่ของทีมจากการแข่งขันที่แตกต่างกัน การแข่งขันที่เกี่ยวข้องกับทั้งสองทีมจะต้องสิ้นสุดลงในวันเดียวกันมิฉะนั้นการเดิมพันถือเป็นโมฆะ
                            สถานที่สำหรับตลาดแฟนตาซีบาสเกตบอลเป็นเพียงเพื่อการอ้างอิงเท่านั้น
                            <br /> 3.2.13
                            <br /> การชนะเดิมพันในไตรมาสส่วนใหญ่จะได้รับการตัดสินจากทีมที่ชนะจำนวนมากที่สุดในระหว่างการแข่งขันบาสเกตบอล หากผลของไตรมาสที่หนึ่งเป็นที่เสมอกันทีมที่ชนะในไตรมาสนั้นไม่ได้
                            การทำงานล่วงเวลาไม่รวมอยู่ในตลาดนี้ หากการแข่งขันถูกระงับหรือยกเลิกการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.3
                            <br /> ฟุตบอลอเมริกัน
                            <br /> 3.3.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลสุดท้ายรวมทั้งการทำงานล่วงเวลา (ยกเว้นที่ระบุไว้เป็นอย่างอื่นในกติกาฉบับนี้)
                            <br /> 3.3.2
                            <br /> หากการแข่งขันไม่ได้เริ่มต้นในวันที่เริ่มต้นตามกำหนดการเดิมพันทั้งหมดจะถือเป็นโมฆะ (เว้นแต่ที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.3.3
                            <br /> หากการแข่งขันเริ่มขึ้น แต่ถูกระงับหรือยกเลิกภายใน 12 ชั่วโมงนับจากเวลาเริ่มต้นที่กำหนดไว้การเดิมพันแบบเต็มเวลาจะถือว่ายังคงใช้ได้หากการแข่งขันสิ้นสุดลงเมื่อเวลาผ่านไปห้าสิบห้า
                            (55) นาที การเดิมพันจะถือเป็นผลถ้าผลการแข่งขันอย่างเป็นทางการประกาศโดยคณะกรรมการที่เกี่ยวข้อง มิเช่นนั้นการเดิมพันในการแข่งขันที่ถูกระงับหรือถูกยกเลิกจะถือเป็นโมฆะยกเว้นเดิมพันในตลาดที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.3.4
                            <br /> ผลการแข่งขันครึ่งแรกคือผลรวมของไตรมาสแรกและไตรมาสที่สอง ผลลัพธ์ครึ่งหลังคือผลรวมของไตรมาสที่สามและสี่รวมถึงการทำงานล่วงเวลาใด
                            ๆ ที่อาจมีขึ้น
                            <br /> 3.3.5
                            <br /> ผลการดำเนินงานในไตรมาสที่สี่ไม่รวมค่าล่วงเวลาใด ๆ ที่อาจมีขึ้น
                            <br /> 3.3.6
                            <br /> หากมีการระงับหรือยกเลิกการแข่งขันการวางเดิมพันในครึ่งหลังหรือไตรมาสที่ยังไม่เสร็จจะถือเป็นโมฆะ หากครึ่งหลังหรือไตรมาสที่กำหนดเสร็จสมบูรณ์เดิมพันจะมีผลสมบูรณ์
                            <br /> 3.3.7
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันสดอเมริกันฟุตบอลและตลาดที่แสดงในระหว่างการซื้อขายสดดูที่คะแนนที่แสดงในเวลาวางเดิมพัน
                            <br /> 3.3.8
                            <br /> ทีมใดที่ทำประตูได้คะแนนแรกจะตัดสินในทีมที่ทำแต้มได้แต้มแรก หากการแข่งขันถูกระงับหรือยกเลิกหลังจากได้รับแต้มแรกแล้วการเดิมพันยังคงใช้งานได้
                            <br /> 3.3.9
                            <br /> ทีมใดจะทำคะแนนให้ได้คะแนนสุดท้ายจะตัดสินในทีมที่ทำแต้มได้แต้มสุดท้ายของการแข่งขัน (รวมถึงการต่อเวลา) หากการแข่งขันถูกระงับหรือยกเลิกการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.3.10
                            <br /> สถานที่จัดงาน Home / Away สำหรับการแข่งขัน NCAA จะมีไว้เพื่อเป็นข้อมูลอ้างอิงเท่านั้น
                            <br /> 3.4
                            <br /> เบสบอล
                            <br /> 3.4.1
                            <br /> ชื่อเหยือกเป็นเพียงเพื่อการอ้างอิงเท่านั้น การเดิมพันเบสบอลทั้งหมดจะยังคงมีผลโดยไม่คำนึงถึงเหยือกเริ่มเล่น
                            <br /> 3.4.2
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลการแข่งขันรอบสุดท้ายซึ่งรวมถึงโอกาสพิเศษ (ยกเว้นที่ระบุไว้เป็นอย่างอื่นในกติกาฉบับนี้)
                            ในเบสบอลญี่ปุ่นจะมีการผูกขาดและในกรณีนี้การเดิมพัน moneyline จะได้รับการคืนเงิน
                            <br /> 3.4.3
                            <br /> หากเกมไม่เริ่มต้นในวันที่เริ่มต้นที่กำหนดการเดิมพันทั้งหมดจะถือเป็นโมฆะ (เว้นแต่ที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.4.4
                            <br /> สำหรับการเดิมพันเบสบอลถือว่าถูกต้องแล้วเกมจะต้องใช้โอกาส 9 (เก้า) (หรือ 8.5 โอกาสหากทีมเจ้าบ้านเป็นผู้นำ) หากเกมถูกระงับและเสร็จสิ้นในวันถัดมาการเดิมพันทั้งหมด
                            (ยกเว้นเกมที่ได้รับการกำหนดโดยไม่มีเงื่อนไข) จะถือว่าเป็นโมฆะ
                            <br /> 3.4.5
                            <br /> ถ้าเกมถูกระงับหรือถูกเรียกในโอกาสพิเศษคะแนนจะถูกกำหนดหลังจากการแข่งขันเต็มรูปแบบครั้งสุดท้ายเว้นเสียแต่ว่าผลการแข่งขันของทีมเจ้าบ้านจะผูกหรือนำไปสู่ครึ่งหลังของโอกาสซึ่งในกรณีนี้คะแนนจะถูกกำหนดในเวลาที่
                            เกมนี้เรียกว่า
                            <br /> 3.4.6
                            <br /> การเดิมพัน Innings 5 ครั้งแรกจะตัดสินตามผลที่เกิดขึ้นเมื่อครบ 5 โอกาส หากโอกาสทั้งห้ายังไม่เสร็จสมบูรณ์ไม่ว่าด้วยเหตุผลใด
                            ๆ การเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.4.7
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันแบบสดและการเดิมพันในตลาดที่แสดงในระหว่างการซื้อขายสดดูที่คะแนนที่แสดงในเวลาวางเดิมพัน
                            <br /> 3.4.8
                            <br /> เกมเบสบอลคลาสสิกของโลกสามารถจบได้เร็วหากทีมใดนำโดยสิบหรือมากกว่าหลังจากที่ทีมของฝ่ายตรงข้ามได้เข้าร่วมอย่างน้อย
                            7 ครั้งหรือถ้าทีมที่นำโดยวิ่งมากกว่าสิบห้านาทีหลังจากที่ทีมตรงข้ามเข้าร่วมอย่างน้อยห้าครั้ง โอกาส หากเกิดเหตุการณ์นี้เดิมพันทั้งหมดจะถือว่าถูกต้อง
                            <br /> 3.4.9
                            <br /> เกมเบสบอลนานาชาติ (เช่นการแข่งขันโอลิมปิก) อาจเรียกได้ตั้งแต่ต้นและสำหรับการเดิมพันที่ถูกต้องโอกาสที่จะได้รับ 6.5
                            ครั้ง
                            <br /> 3.5
                            <br /> ฮอกกี้น้ำแข็ง
                            <br /> 3.5.1
                            <br /> ตลาดแบบเต็มเวลา (เส้นแฮนดิแคปและตลาดที่อยู่ระหว่างการแข่งขัน แต่ไม่ใช่การเดิมพันสด) จะได้รับการตัดสินตามผลการแข่งขันที่ผ่านมารวมทั้งการต่อเวลาและการยิงประตู
                            (ผู้ชนะของการยิงออกจะมีหนึ่งเป้าหมายเพิ่มคะแนนของพวกเขาเพื่อกำหนดผลสุดท้าย)
                            <br /> 3.5.2
                            <br /> หากการแข่งขันไม่ได้เริ่มต้นในวันที่เริ่มต้นตามกำหนดการเดิมพันทั้งหมดจะถือเป็นโมฆะ (เว้นแต่ที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.5.3
                            <br /> หากการแข่งขันเริ่มขึ้น แต่ถูกระงับหรือยกเลิกภายใน 12 ชั่วโมงนับจากเวลาเริ่มต้นที่กำหนดไว้การเดิมพันแบบเต็มเวลาจะถือว่ายังคงใช้ได้หากการแข่งขันสิ้นสุดลงเมื่อเวลาผ่านไปห้าสิบห้า
                            (55) นาที การเดิมพันจะถือเป็นผลถ้าผลการแข่งขันอย่างเป็นทางการประกาศโดยคณะกรรมการที่เกี่ยวข้อง มิเช่นนั้นการเดิมพันในการแข่งขันที่ถูกระงับหรือถูกยกเลิกจะถือเป็นโมฆะยกเว้นเดิมพันในตลาดที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.5.4
                            <br /> สำหรับการเดิมพันรอบระยะเวลาต้องดำเนินการรอบระยะเวลาเพื่อให้การเดิมพันถือว่าถูกต้อง
                            <br /> 3.5.5
                            <br /> ผลการแข่งขันในช่วงที่สามไม่รวมถึงการทำงานล่วงเวลาหรือการยิงประตูที่อาจเล่น
                            <br /> 3.5.6
                            <br /> เดิมพันฮอกกี้น้ำแข็งแบบสดจะตัดสินตามผลการแข่งขันเมื่อสิ้นสุดเวลาปกติ (สามช่วงเวลา) การทำงานล่วงเวลาและการยิงออกไม่นับ
                            <br /> 3.5.7
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันสดแบบ Ice Hockey และตลาดที่แสดงในระหว่างการซื้อขายสดดูที่คะแนนที่แสดงในเวลาวางเดิมพัน
                            <br /> 3.6
                            <br /> เทนนิส
                            <br /> 3.6.1
                            <br /> ตลาด Moneyline หมายถึงผู้ชนะของการแข่งขันหรือชุดที่ระบุ ตลาดแฮนดิแคปขึ้นอยู่กับชุดหรือเกม (โปรดดูชื่อเรื่องการตลาด)
                            / ต่ำกว่าและแปลก / แม้แต่ตลาดตามเกม (ยกเว้นที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.6.2
                            <br /> หากผู้เล่นไม่เริ่มการแข่งขันหรือจับคู่เดิมพันทั้งหมดจะถูกเป็นโมฆะ
                            <br /> 3.6.3
                            <br /> หากผู้เล่น (หรือคู่) เกษียณหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.6.4
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดถือว่าถูกต้องหากการแข่งขันเสร็จสมบูรณ์
                            <br /> 3.6.5
                            <br /> การเดิมพันทั้งหมดจะถือว่าถูกต้องโดยไม่คำนึงถึงการเปลี่ยนแปลงสถานที่จัดงานหรือสนามแข่งขัน (รวมถึงการย้ายการแข่งขันจากสนามกลางแจ้งสู่สนามในร่มหรือในทางกลับกัน)
                            <br /> 3.6.6
                            <br /> หากจำนวนชุดที่กำหนดในการชนะการแข่งขันจะเปลี่ยนจากเดิมที่กำหนดไว้การเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ไม่มีเงื่อนไข
                            <br /> 3.6.7
                            <br /> ผู้ชนะในเซ็ตแรก (Second, Third Set Winner ฯลฯ ) หมายถึงผลของชุดที่ระบุ การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าชุดที่ระบุไม่สมบูรณ์
                            <br /> 3.6.8
                            <br /> เดิมพันเทนนิสสดจะตัดสินตามผลของการแข่งขัน (หรือชุดที่ระบุ) คะแนนจะไม่ได้รับการอัปเดตสำหรับการเล่นเทนนิสสด
                            <br /> 3.6.9
                            <br /> ตลาดเอซส่วนใหญ่ (Double Faults ฯลฯ ) จะถูกตัดสินตามสถิติการแข่งขันอย่างเป็นทางการ หากผู้เล่นเกษียณหรือถูกตัดสิทธิ์ก่อนการแข่งขันเสร็จสิ้นการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.6.10
                            <br /> First Ace (Double Fault etc) จะถูกตัดสินตามสถิติการแข่งขันอย่างเป็นทางการ หากมีการตัดสินว่ามีปัญหาใด ๆ เกิดขึ้นจากการแข่งขันเอซ
                            (ข้อบกพร่องสองครั้ง) แล้วการเดิมพันทั้งหมดจะถือว่าถูกต้องแม้ว่าการแข่งขันจะยังไม่สมบูรณ์เนื่องจากเกษียณหรือถูกตัดสิทธิก็ตาม
                            หากไม่มีเอซ (ข้อบกพร่องคู่ ฯลฯ ) ในขณะที่เกษียณ / ถูกตัดสิทธิ์เดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.6.11
                            <br /> เกม Winner markets หมายถึงผู้ชนะในเกมที่เฉพาะเจาะจงเช่น ตั้ง 1 เกมที่ 1; ชุดที่ 1 เกม 2 เป็นต้นหากมีการตั้งค่าไปที่
                            tie-break แล้วตลาดจะถูกกำหนดให้เป็นชุดที่ 1 TB; กำหนด 2 TB เป็นต้นหากมีการเกษียณ / ถูกตัดสิทธิ์ในระหว่างเกมที่ไม่สมบูรณ์เดิมพันทั้งหมดจะถือเป็นโมฆะ
                            หากเกมเสร็จสิ้นโดยผู้ตัดสินที่ตัดสิน "เกมโทษ" การเดิมพันทั้งหมดในเกมนั้นจะถือเป็นโมฆะ (แม้ว่าเกมจะจบด้วย "จุดโทษ"
                            แล้วการเดิมพันทั้งหมดยังคงมีผลอยู่) หากเกมถูกระงับการเดิมพันทั้งหมดถือว่าถูกต้องหากเกมเสร็จสิ้น
                            <br /> 3.7
                            <br /> แบดมินตัน
                            <br /> 3.7.1
                            <br /> ตลาด Moneyline หมายถึงผู้ชนะของการแข่งขันหรือชุดที่ระบุ ตลาดแฮนดิแคปขึ้นอยู่กับชุดหรือจุด (โปรดดูชื่อเรื่องการตลาด)
                            สูง / ต่ำกว่าและต่ำ / ต่ำกว่าตลาดตามจุด (เว้นแต่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.7.2
                            <br /> หากผู้เล่นไม่เริ่มการแข่งขันหรือจับคู่เดิมพันทั้งหมดจะถูกเป็นโมฆะ
                            <br /> 3.7.3
                            <br /> หากผู้เล่น (หรือคู่) เกษียณหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.7.4
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดจะถือว่าถูกต้องหากการแข่งขันดำเนินต่อก่อนหมดอายุ 12 ชั่วโมง
                            <br /> 3.7.5
                            <br /> ผู้ชนะในเซ็ตแรก (Second, Third Set Winner ฯลฯ ) หมายถึงผลของชุดที่ระบุ การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าชุดที่ระบุไม่สมบูรณ์
                            <br /> 3.7.6
                            <br /> เดิมพันสดแบดมินตันถูกตัดสินตามผลของการแข่งขัน (หรือชุดที่ระบุ) คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันสดแบดมินตัน
                            <br /> 3.8
                            <br /> โต๊ะปิงปอง
                            <br /> 3.8.1
                            <br /> ตลาด Moneyline หมายถึงผู้ชนะของการแข่งขันหรือชุดที่ระบุ ตลาดแฮนดิแคปขึ้นอยู่กับชุดหรือจุด (โปรดดูชื่อเรื่องการตลาด)
                            สูง / ต่ำกว่าและต่ำ / ต่ำกว่าตลาดตามจุด (เว้นแต่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.8.2
                            <br /> หากผู้เล่นไม่เริ่มการแข่งขันหรือจับคู่เดิมพันทั้งหมดจะถูกเป็นโมฆะ
                            <br /> 3.8.3
                            <br /> หากผู้เล่น (หรือคู่) เกษียณหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.8.4
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดจะถือว่าถูกต้องหากการแข่งขันดำเนินต่อก่อนหมดอายุ 12 ชั่วโมง
                            <br /> 3.8.5
                            <br /> ผู้ชนะในเซ็ตแรก (Second, Third Set Winner ฯลฯ ) หมายถึงผลของชุดที่ระบุ การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าชุดที่ระบุไม่สมบูรณ์
                            <br /> 3.8.6
                            <br /> เดิมพันปิงปองแบบสดจะตัดสินตามผลของการแข่งขัน (หรือชุดที่ระบุ) คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันปิงปองสด
                            <br /> 3.9
                            <br /> วอลเลย์บอลและวอลเลย์บอลชายหาด
                            <br /> 3.9.1
                            <br /> ตลาด Moneyline หมายถึงผู้ชนะของการแข่งขันหรือชุดที่ระบุ ตลาดแฮนดิแคปขึ้นอยู่กับชุดหรือจุด (โปรดดูชื่อเรื่องการตลาด)
                            สูง / ต่ำกว่าและต่ำ / ต่ำกว่าตลาดตามจุด (เว้นแต่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.9.2
                            <br /> หากทีมไม่เริ่มต้นทัวร์นาเมนต์หรือการแข่งขันการเดิมพันทั้งหมดในทีมนั้นจะเป็นโมฆะ
                            <br /> 3.9.3
                            <br /> หากทีมใดเกษียณหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.9.4
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดจะถือว่าถูกต้องหากการแข่งขันดำเนินต่อก่อนหมดอายุ 12 ชั่วโมง
                            <br /> 3.9.5
                            <br /> ผู้ชนะในเซ็ตแรก (Second, Third Set Winner ฯลฯ ) หมายถึงผลของชุดที่ระบุ การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าชุดที่ระบุไม่สมบูรณ์
                            <br /> 3.9.6
                            <br /> วอลเลย์บอลเดิมพันแบบสดจะตัดสินตามผลของการแข่งขัน (หรือชุดที่ระบุ) คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันวอลเลย์บอลสด
                            <br /> 3.10
                            <br /> ฮอกกี้สนาม
                            <br /> 3.10.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลสุดท้ายเมื่อสิ้นสุดเวลาปกติ การทำประตูพิเศษ, โกลเด้นและการยิงลูกโทษไม่นับสำหรับตลาดแบบเต็มเวลา
                            (ตลาดเฉพาะสำหรับเวลาพิเศษ (ET) และการยิงลูกโทษ (PEN) อาจมีให้สำหรับเดิมพัน)
                            <br /> 3.10.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อได้ภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นการเดิมพันทั้งหมดถือเป็นโมฆะเว้นแต่เดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            การเดิมพันถือว่าถูกต้องหากมีการประกาศผลอย่างเป็นทางการจากหน่วยงานกำกับดูแลที่เกี่ยวข้อง
                            <br /> 3.10.3
                            <br /> ตลาดครึ่งแรกหมายถึงผลของครึ่งแรก การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าครึ่งหนึ่งที่ระบุไม่สมบูรณ์
                            <br /> 3.10.4
                            <br /> เดิมพันสดฮอกกี้เดิมพันแบบสดจะตัดสินตามผลของการจับคู่เมื่อสิ้นสุดเวลาปกติ
                            <br /> 3.10.5
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันสดฟิลด์ฮ็อกกี้และตลาดที่แสดงในระหว่างการซื้อขายสดดูที่คะแนนที่แสดงในเวลาวางเดิมพัน
                            <br /> 3.11
                            <br /> สนุ้กเกอร์และพูล
                            <br /> 3.11.1
                            <br /> ตลาด Moneyline และ Handicap หมายถึงผู้ชนะในการแข่งขัน ราคาที่ต่ำกว่า / ต่ำกว่าและต่ำ / ต่ำ / ขึ้นอยู่กับจำนวนเฟรม
                            / ชั้นวาง (ยกเว้นที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.11.2
                            <br /> หากผู้เล่นไม่เริ่มการแข่งขันหรือจับคู่เดิมพันทั้งหมดจะถูกเป็นโมฆะ
                            <br /> 3.11.3
                            <br /> หากการแข่งขันเริ่มต้น แต่ไม่สมบูรณ์การเดิมพันทั้งหมดถือเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.11.4
                            <br /> การเดิมพันแบบสนุ้กเกอร์และพูลจะตัดสินตามผลของการจับคู่ (หรือกรอบ / แร็คที่ระบุ) คะแนนจะไม่ได้รับการอัปเดตสำหรับสนุ๊กเกอร์และการเดิมพันแบบพูลสด
                            <br /> 3.12
                            <br /> กอล์ฟ
                            <br /> 3.12.1
                            <br /> การเดิมพันกอล์ฟทั้งหมดจะตัดสินตามผลการแข่งขันอย่างเป็นทางการ
                            <br /> 3.12.2
                            <br /> หากผู้เล่นไม่เริ่มต้นการแข่งขันหรือรอบที่ระบุการเดิมพันทั้งหมดในผู้เล่นนั้นจะเป็นโมฆะ หากนักกอล์ฟถอนตัวหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันหรือรอบที่ระบุการเดิมพันทั้งหมดจะสูญหาย
                            <br /> 3.12.3
                            <br /> หากการแข่งขันหรือรอบที่ระบุล่าช้าหรือถูกระงับการเดิมพันทั้งหมดจะยังคงใช้ได้ต่อไปอีกเป็นเวลาสี่สิบแปดชั่วโมงหลังจากสิ้นสุดการแข่งขัน
                            <br /> 3.12.4
                            <br /> ชนะเลิศ (ผู้ชนะการแข่งขัน)
                            <br /> 3.12.4.1
                            <br /> "ผู้เล่นคนอื่น" หรือ "ทุ่ง" หมายถึงนักกอล์ฟทุกคนที่ไม่ได้ตั้งชื่อในตลาดทันที
                            <br /> 3.12.4.2
                            <br /> การตัดสินเดิมพันจะตัดสินจากผู้ชนะการแข่งขันและจะมีการพิจารณาผลการแข่งขันใด ๆ
                            <br /> 3.12.4.3
                            <br /> หากการแข่งขันจะสั้นลงโดยเจ้าหน้าที่ (เช่นจำนวนที่กำหนดของหลุมไม่สมบูรณ์) การเดิมพันทั้งหมดจะยังคงถูกต้องถ้าผู้ชนะอย่างเป็นทางการจะมีการประกาศ
                            อย่างไรก็ตามหากไม่มีการเล่นต่อไปหลังจากมีการวางเดิมพันแล้วการวางเดิมพันดังกล่าวจะเป็นโมฆะ หากไม่มีการประกาศผู้ชนะอย่างเป็นทางการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.12.5
                            <br /> Matchups การแข่งขัน
                            <br /> 3.12.5.1
                            <br /> matchups แข่งขันหมายถึงนักกอล์ฟที่มีคะแนนต่ำสุดในการแข่งขัน (โดยปกติจะเป็น 72 หลุม) หากจำนวนหลุมที่เล่นลดลงจากที่กำหนดไว้การเดิมพันยังคงใช้งานได้หากมีการประกาศผลการแข่งขันอย่างเป็นทางการ
                            <br /> 3.12.5.2
                            <br /> นักกอล์ฟทั้งสองต้องออกรอบเพื่อให้การเดิมพันถูกต้อง นักกอล์ฟที่ทำหลุมเสร็จสมบูรณ์มากที่สุด (ไม่รวมการเล่นเพลย์ออฟ)
                            จะเป็นผู้ชนะ หากนักกอล์ฟกรอกจำนวนหลุมเท่าเดิม (ไม่รวมการเล่น) ผู้เล่นที่มีคะแนนต่ำสุดจะเป็นผู้ชนะ
                            <br /> 3.12.5.3
                            <br /> ถ้านักกอล์ฟถอนตัวหรือถูกตัดสิทธิ์หลังจากทีออฟผู้เล่นคนอื่นจะถือว่าเป็นผู้ชนะ แต่ถ้าผู้เล่นถอนตัวหรือถูกตัดสิทธิ์หลังจากที่ผู้เล่นคนอื่นได้พลาดแล้วตัดแล้วนักกอล์ฟที่เล่นหลุมมากที่สุดยังคงประกาศผู้ชนะ.
                            <br /> 3.12.5.4
                            <br /> หากทั้งสองนักกอล์ฟถอนตัวหรือขาดคุณสมบัติในระหว่างรอบเดียวกันการเดิมพันทั้งหมดจะถือเป็นโมฆะโดยไม่คำนึงถึงวิธีการหลายหลุมผู้เล่นแต่ละคนได้เสร็จสิ้น.
                            <br /> 3.12.6
                            <br /> matchups รอบ
                            <br /> 3.12.6.1
                            <br /> รอบการแข่งขันรอบหมายถึงนักกอล์ฟที่มีคะแนนต่ำสุดมากกว่า 18 หลุมที่ระบุ ไม่รวม Play-offs
                            <br /> 3.12.6.2
                            <br /> นักกอล์ฟทั้งสองต้องออกรอบเพื่อให้การเดิมพันถูกต้อง ถ้านักกอล์ฟถอนตัวหรือถูกตัดสิทธิ์หลังจากทีออฟผู้เล่นคนอื่นจะถือว่าเป็นผู้ชนะ
                            อย่างไรก็ตามหากผู้เล่นที่ถูกตัดสิทธิ์ได้เริ่มต้นรอบถัดไปแล้วคะแนนเดิมก็ยังคงใช้ได้
                            <br /> 3.12.7
                            <br /> สูงกว่า / ต่ำกว่า
                            <br /> 3.12.7.1
                            <br /> รอบ / ต่ำสุดหมายถึงคะแนนของนักกอล์ฟ (หรือนักกอล์ฟ) มากกว่า 18 หลุมที่ระบุ ไม่รวม Play-offs
                            <br /> 3.12.7.2
                            <br /> นักกอล์ฟต้องวางเดิมพันเพื่อให้ถูกต้อง หากนักกอล์ฟไม่สามารถทำตาม 18 หลุมที่ระบุได้การเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 3.12.8
                            <br /> หลุมส่วนบุคคลเกินกว่า / ต่ำกว่า
                            <br /> 3.12.8.1
                            <br /> แต่ละหลุมสูง / ต่ำกว่าหมายถึงคะแนนของนักกอล์ฟ (หรือนักกอล์ฟ) เหนือหลุมเฉพาะแต่ละรอบของรอบที่ระบุ
                            <br /> 3.12.8.2
                            <br /> ถ้านักกอล์ฟไม่ลงหลุม (หรือนักกอล์ฟ) การเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.13
                            <br /> กีฬามอเตอร์
                            <br /> 3.13.1
                            <br /> กีฬามอเตอร์รวมถึง แต่ไม่ จำกัด เพียงแค่สูตรหนึ่ง ได้แก่ Moto GP และ A1GP
                            <br /> 3.13.2
                            <br /> ตำแหน่งแท่นจะนับเป็นผลลัพธ์อย่างเป็นทางการโดยไม่คำนึงถึงการถูกตัดสิทธิ์ในการแข่งขันหรือการแก้ไขผลการแข่งขัน ถ้าไม่มีพิธีบูชาผลก็คือประกาศโดยหน่วยงานกำกับดูแลที่เกี่ยวข้องทันทีหลังจากจบการแข่งขัน
                            ตลาดที่มีคุณสมบัติตามเกณฑ์ขึ้นอยู่กับตำแหน่งสุดท้ายที่ประกาศโดยสภาผู้แทนราษฎรทันทีหลังจากสิ้นสุดการคัดเลือก
                            <br /> 3.13.3
                            <br /> หากสถานที่ตามกำหนดการมีการเปลี่ยนแปลงการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.13.4
                            <br /> หากการแข่งขันถูกเลื่อนออกไปการเดิมพันทั้งหมดถือเป็นที่ถูกต้องหากการแข่งขันเริ่มขึ้นก่อนหมดอายุการใช้งาน 48 นาทีมิฉะนั้นการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            หากการแข่งขันเริ่มต้น แต่ไม่สมบูรณ์การเดิมพันทั้งหมดจะยังคงมีผลถ้ามีการประกาศผลอย่างเป็นทางการ หากไม่มีการประกาศผลอย่างเป็นทางการการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.13.5
                            <br /> การแข่งรถถือเป็นการเริ่มต้นเมื่อมีการให้สัญญาณเพื่อเริ่มต้นตักอุ่นเครื่อง หากคู่แข่งไม่พร้อมที่จะเริ่มต้นจากกริด
                            (หรือเลนหลุม) เดิมพันบนนักแข่งนั้นจะเป็นโมฆะ หากผู้เข้าแข่งขันไม่สามารถเริ่มเซสชันที่มีคุณสมบัติอย่างเป็นทางการตำแหน่งขั้วโลกในการแข่งนั้นถือเป็นโมฆะ
                            <br /> 3.13.6
                            <br /> นักแข่งต้องเริ่มแข่ง (หรือรอบคัดเลือกอย่างเป็นทางการ) สำหรับการเดิมพันที่ถูกต้อง นักแข่งที่มีตำแหน่งการตกแต่งที่ดีกว่าจะได้รับการประกาศให้เป็นผู้ชนะ
                            หากทั้งสองนักแข่งไม่สามารถจบการแข่งขันได้ผู้ชนะจะได้รับรางวัลสูงสุดจากผู้เข้าแข่งขัน หากมีการบันทึกรอบจำนวนเท่ากันสำหรับนักแข่งทั้งสองคนการเดิมพันทั้งหมดจะถือเป็นโมฆะจนกว่าจะมีการประกาศตำแหน่งจบอย่างเป็นทางการ
                            <br /> 3.13.7
                            <br /> ตลาดตักเร็วที่สุดจะถูกตัดสินบนนักแข่งหรือทีมที่มีเวลาตักเร็วที่สุดในระหว่างการแข่งขัน
                            <br /> 3.13.8
                            <br /> จำนวนตลาด Finishers จำแนกตามประกาศผลการตัดสินอย่างเป็นทางการที่ประกาศโดยคณะกรรมการกำกับดูแล
                            <br /> 3.13.9
                            <br /> การเดิมพันสดของกีฬามอเตอร์สปอร์ตจะตัดสินตามผลของการแข่งขันอย่างเป็นทางการ
                            <br /> 3.13.10
                            <br /> ตลาดคี่ / คู่จะขึ้นอยู่กับตำแหน่งการสิ้นสุดที่ประกาศโดยหน่วยงานที่กำกับดูแล ตัวอย่างเช่นถ้า Driver A เสร็จสิ้นในตำแหน่งที่
                            1 ผลที่ได้คือคี่; ถ้า Driver B เสร็จสิ้นในตำแหน่งที่ 2 ผลที่ได้คือแม้กระทั่ง ฯลฯ หากผู้ขับขี่ไม่ได้รับการจัดประเภทอย่างเป็นทางการการเดิมพันจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.13.11
                            <br /> การชนะตลาด Margin ขึ้นอยู่กับความแตกต่างของเวลา (เป็นวินาที) ระหว่างไดรเวอร์ที่เลือกตามประกาศ หมายความว่าเวลาที่แตกต่างกันจะมากกว่าแฮนดิแคปขณะที่
                            Under หมายความว่าความแตกต่างของเวลาจะน้อยกว่าแฮนดิแคปที่เสนอ หากเวลาแตกต่างตรงกับแฮนดิแคปเดิมพันจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.14
                            <br /> แฮนด์บอล
                            <br /> 3.14.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลสุดท้ายเมื่อสิ้นสุดเวลาปกติ การลงโทษพิเศษและการยิงลูกโทษไม่นับสำหรับตลาดแบบเต็มเวลา
                            <br /> 3.14.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อได้ภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นการเดิมพันทั้งหมดถือเป็นโมฆะเว้นแต่เดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            การเดิมพันถือว่าถูกต้องหากมีการประกาศผลอย่างเป็นทางการจากหน่วยงานกำกับดูแลที่เกี่ยวข้อง
                            <br /> 3.14.3
                            <br /> แฮนด์บอลเดิมพันแบบสดจะตัดสินตามผลของการจับคู่เมื่อสิ้นสุดเวลาปกติ
                            <br /> 3.14.4
                            <br /> คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันสดแฮนด์บอล
                            <br /> 3.15
                            <br /> โปโลน้ำ
                            <br /> 3.15.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลสุดท้ายเมื่อสิ้นสุดเวลาปกติ (สี่ในสี่) เวลาพิเศษและการยิงนอกตลาดไม่นับสำหรับตลาดแบบเต็มเวลา
                            <br /> 3.15.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อได้ภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นการเดิมพันทั้งหมดถือเป็นโมฆะเว้นแต่เดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            การเดิมพันถือว่าถูกต้องหากมีการประกาศผลอย่างเป็นทางการจากหน่วยงานกำกับดูแลที่เกี่ยวข้อง
                            <br /> 3.15.3
                            <br /> ตลาดครึ่งแรกหมายถึงผลการดำเนินงานของไตรมาสแรกและไตรมาสที่สอง การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าครึ่งหนึ่งที่ระบุไม่สมบูรณ์
                            <br /> 3.15.4
                            <br /> การพนันฟุตบอลโปโลน้ำจะตัดสินตามผลของการจับคู่เมื่อสิ้นสุดเวลาปกติ
                            <br /> 3.15.5
                            <br /> คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันสดโปโลน้ำ
                            <br /> 3.16
                            <br /> มวย
                            <br /> 3.16.1
                            <br /> การสู้รบจะเกิดขึ้นภายในสิบวันนับจากวันที่เริ่มต้นเดิม
                            <br /> 3.16.2
                            <br /> สำหรับตลาด lineline (ในกรณีที่ไม่สามารถใช้การเดิมพันได้) การเดิมพันทั้งหมดจะเป็นโมฆะถ้าผลการแข่งขันเป็นเสมอ หากอัตราต่อรองสำหรับการจับสลากมีให้เลือกเป็นตัวเลือกการเดิมพันที่สามและการต่อสู้สิ้นสุดลงในการจับรางวัลการเดิมพันแบบวาดจะได้รับการจ่ายเงินเป็นผู้ชนะและการเดิมพันกับนักมวยสองคนจะสูญหาย
                            <br /> 3.16.3
                            <br /> การต่อสู้จะถือว่าเริ่มขึ้นเมื่อเสียงกระดิ่งเริ่มขึ้นในช่วงแรก หากนักมวยทั้งสองคนหรือทั้งสองฝ่ายไม่สามารถเริ่มการต่อสู้ได้การเดิมพันทั้งหมดจะเป็นโมฆะ
                            หากนักมวยล้มเหลวในการตอบเสียงระฆังในการเริ่มรอบการแข่งขันหรือถูกตัดสิทธิระหว่างรอบฝ่ายตรงข้ามจะถือว่าได้รับชัยชนะในรอบที่ผ่านมา
                            <br /> 3.16.4
                            <br /> การเดิมพันทั้งหมดจะตัดสินตามการตัดสินใจอย่างเป็นทางการในรอบทันทีหลังจากการต่อสู้ การเปลี่ยนแปลงผลลัพธ์ที่ตามมาจะไม่ได้รับการยอมรับสำหรับวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.16.5
                            <br /> การชนะแบบน็อต (KO) รวมถึงการชนะทางเทคนิค (TKO) หรือชนะโดยการตัดสิทธิ์ (DSQ) การตัดสินใจในจุดรวมถึงการตัดสินใจทางเทคนิค
                            (TD) และการวาดรวมถึงการวาดทางเทคนิค
                            <br /> 3.16.6
                            <br /> การวางเดิมพันสูง / ต่ำหมายถึงจำนวนรอบที่เกิดขึ้นระหว่างการต่อสู้เช่น ภายใต้ 9.5 หมายถึงการสู้รบสิ้นสุดก่อนหนึ่งนาทีและสามสิบวินาทีของรอบ
                            9; ขณะที่อายุเกิน 9.5 หมายถึงการสู้รบสิ้นสุดลงหลังจากผ่านไปหนึ่งนาทีและสามสิบวินาทีของรอบ 9 (รวมถึงการตัดสินใจด้วยคะแนน)
                            <br /> 3.16.7
                            <br /> UFC
                            <br /> 3.16.7.1
                            <br /> กฎ UFC ใช้กับการต่อสู้ที่ได้รับการส่งเสริมโดยองค์กรศิลปะการต่อสู้แบบผสมผสาน (Other MMA) อื่น ๆ
                            <br /> 3.16.7.2
                            <br /> การสู้รบจะเกิดขึ้นภายในสิบวันนับจากวันที่เริ่มต้นเดิม
                            <br /> 3.16.7.3
                            <br /> หากการต่อสู้จบลงด้วยการเดิมพันการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.17
                            <br /> ปาเป้า
                            <br /> 3.17.1
                            <br /> Moneyline และตลาดหมายถึงผู้ชนะในการแข่งขัน แฮนดิแค็ปและโอเวอร์ / ภายใต้ตลาดขึ้นอยู่กับจำนวนเซต (ยกเว้นที่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.17.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไปและไม่เริ่มภายใน 12 ชั่วโมงจากเวลาเริ่มต้นที่กำหนดการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 3.17.3
                            <br /> หากผู้เล่นไม่เริ่มการแข่งขันหรือจับคู่เดิมพันทั้งหมดจะถูกเป็นโมฆะ
                            <br /> 3.17.4
                            <br /> หากการแข่งขันเริ่มต้น แต่ไม่สมบูรณ์การเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.17.5
                            <br /> การเดิมพันแบบลูกดากสดจะตัดสินตามผลของการแข่งขัน คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันลูกดอกสด
                            <br /> 3.18
                            <br /> คริกเก็ต
                            <br /> 3.18.1
                            <br /> สำหรับการเดิมพันแบบ จำกัด (รวมทั้ง ODI และ Twenty20) การเดิมพันทั้งหมดจะตัดสินตามผลการแข่งขันอย่างเป็นทางการตามกฎการแข่งขัน
                            อย่างไรก็ตามหากผลการตัดสินถูกกำหนดโดย super-overs, bowl out, โยนเหรียญ ฯลฯ การเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.18.2
                            <br /> หาก "ไม่มีผลลัพธ์" เป็นผลอย่างเป็นทางการหรือกฎการแข่งขันไม่ประกาศผู้ชนะการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.18.3
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดถือเป็นที่ถูกต้องหากการแข่งขันดำเนินต่อภายใน 48 ชั่วโมงหมดอายุ
                            <br /> 3.18.4
                            <br /> ตลาดการจับคู่แบบทดสอบจะมีการเสนอในรูปแบบ 1X2 1 หมายถึงทีมที่ได้รับการตั้งชื่อเป็นอันดับแรก (โดยปกติทีมบ้านเกิด);
                            X หมายถึงเกมที่เกิดขึ้นในการดึง; 2 หมายถึงทีมที่มีชื่อเป็นที่สอง (โดยปกติทีมเยือน) หากการจับคู่การทดสอบสิ้นสุดลงใน
                            "Tie" (แตกต่างจาก "Draw") การเดิมพันแบบแมทช์จะถือว่าเป็นโมฆะ หากการแข่งขันถูกยกเลิกเนื่องจากการแทรกแซงจากภายนอกการเดิมพันทั้งหมดอาจถูกประกาศเป็นโมฆะ
                            <br /> 3.18.5
                            <br /> ตลาดส่วนใหญ่วิ่งหมายถึงผู้เล่นที่ให้คะแนนจำนวนมากที่สุดของการทำงานในระหว่างการแข่งขันหรือโอกาสที่เฉพาะเจาะจง ผู้เล่นทั้งสองต้องอยู่ที่แนวปะทะบอลอย่างน้อยหนึ่งลูกเพื่อให้การเดิมพันถูกต้อง
                            <br /> 3.18.6
                            <br /> ตลาด Wickets ส่วนใหญ่หมายถึงผู้เล่นที่ใช้จำนวน wickets มากที่สุดในระหว่างการแข่งขันหรือโอกาสที่เฉพาะเจาะจง ผู้เล่นทั้งสองต้องชามอย่างน้อยหนึ่งลูกเพื่อให้การเดิมพันถูกต้อง
                            <br /> 3.18.7
                            <br /> ตลาดส่วนใหญ่หกหมายถึงทีมที่ทำคะแนนได้มากที่สุดในจำนวนหกในระหว่างการแข่งขันหรือโอกาสที่เฉพาะเจาะจง การเดิมพันจะมีผลถ้ามีการประกาศผลอย่างเป็นทางการ
                            หากผลการแข่งขัน "ไม่มีผลลัพธ์" เป็นผลอย่างเป็นทางการการเดิมพันทั้งหมดในตลาดนี้จะเป็นโมฆะ
                            <br /> 3.18.8
                            <br /> ตลาด Man Out ถัดไปหมายถึงผู้เล่นคนไหนที่ถูกไล่ออกเป็นอันดับแรกในการแข่งขันหรือเฉพาะโอกาส หากผู้เล่นหนึ่งรายออกจากตำแหน่งเดิมพันจะถือเป็นโมฆะ
                            หากทั้งสองฝ่ายไม่ได้รับการเดิมพันการเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.18.9
                            <br /> ห้างหุ้นส่วนจำกัดการเปิดบัญชีที่ยิ่งใหญ่ที่สุดครั้งที่ 1 เดิมพันจะมีขึ้นเมื่อลูกบอลได้รับการชกต่อเนื่องในแต่ละทีมที่
                            1 ในกรณีที่เป็น Tie ซึ่งนำเสนอตลาดที่เป็นตัวเลือกแบบสองทิศทางที่ใช้กฎความร้อนตาย
                            <br /> 3.19
                            <br /> รักบี้ยูเนี่ยน
                            <br /> 3.19.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลการแข่งขันรอบสุดท้ายเมื่อสิ้นสุดเวลาปกติ (80 นาที) เวลาพิเศษไม่นับสำหรับตลาดแบบเต็มเวลา
                            <br /> 3.19.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อได้ภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นการเดิมพันทั้งหมดถือเป็นโมฆะเว้นแต่เดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            การเดิมพันถือว่าถูกต้องหากมีการประกาศผลอย่างเป็นทางการจากหน่วยงานกำกับดูแลที่เกี่ยวข้อง
                            <br /> 3.19.3
                            <br /> ตลาดครึ่งแรกหมายถึงผลของครึ่งแรกเท่านั้น การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าครึ่งหนึ่งที่ระบุไม่สมบูรณ์
                            <br /> 3.19.4
                            <br /> การเดิมพันสดของ Rugby Union จะตัดสินตามผลของการจับคู่เมื่อสิ้นสุดเวลาปกติ
                            <br /> 3.19.5
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันสดของ Rugby Union และการตลาดที่แสดงในระหว่างการซื้อขายสดดูที่คะแนนที่แสดงในเวลาวางเดิมพัน
                            <br /> 3.20
                            <br /> รักบี้ลีก
                            <br /> 3.20.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลการแข่งขันในตอนท้ายของการจับคู่รวมทั้งเวลาพิเศษที่อาจเล่นได้
                            <br /> 3.20.2
                            <br /> หากการแข่งขันถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อได้ภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นการเดิมพันทั้งหมดถือเป็นโมฆะเว้นแต่เดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            การเดิมพันถือว่าถูกต้องหากมีการประกาศผลอย่างเป็นทางการจากหน่วยงานกำกับดูแลที่เกี่ยวข้อง
                            <br /> 3.20.3
                            <br /> ตลาดครึ่งแรกหมายถึงผลของครึ่งแรกเท่านั้น การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าครึ่งหนึ่งที่ระบุไม่สมบูรณ์
                            <br /> 3.20.4
                            <br /> การเดิมพันแบบสดของ Rugby League จะตัดสินตามผลของการแข่งขันซึ่งรวมถึงเวลาพิเศษที่สามารถเล่นได้
                            <br /> 3.20.5
                            <br /> คะแนนจะได้รับการอัปเดตสำหรับการเดิมพันสดและการเดิมพันสดของ Rugby League ที่แสดงในระหว่างการซื้อขายสดดูที่คะแนนที่แสดงในเวลาวางเดิมพัน
                            <br /> 3.21
                            <br /> กรีฑา
                            <br /> 3.21.1
                            <br /> ตรงไปตรงมา (เพื่อชนะเหรียญทอง) หมายถึงผู้ชนะในการแข่งขันกรีฑาแต่ละครั้ง
                            <br /> 3.21.2
                            <br /> ตลาด Moneyline อ้างอิงถึงคู่แข่งที่มีการวางตำแหน่งที่ดีที่สุดในเหตุการณ์ (หรือความร้อนที่ระบุ) หากนักกีฬาคนใดคนหนึ่งถึงรอบสุดท้ายของการแข่งขันแล้วการเดิมพันกับคู่แข่งนั้นชนะการเดิมพัน
                            หากนักกีฬาทั้งสองคนไม่สามารถเข้าสู่รอบชิงชนะเลิศได้แล้วผู้เข้าแข่งขันที่มีการจัดประเภทที่ดีกว่าในระหว่างที่มีคุณสมบัติจะได้รับรางวัลผู้ชนะ
                            <br /> 3.21.3
                            <br /> ตำแหน่ง Podium จะเป็นผลการแข่งขันอย่างเป็นทางการซึ่งการเดิมพันทั้งหมดจะได้รับการตัดสิน การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันในภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.21.4
                            <br /> หากกิจกรรมถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อภายใน 12 ชั่วโมงนับจากเวลาเริ่มต้นที่กำหนดการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 3.21.5
                            <br /> ถ้านักกีฬาไม่สามารถเริ่มต้นการแข่งขันได้การเดิมพันทั้งหมดจะเป็นโมฆะ นักกีฬาถือว่าได้เริ่มเหตุการณ์หากมีส่วนร่วมในขอบเขตที่จำเป็นในการบันทึกผลการแข่งขันหรือการจัดประเภทอย่างเป็นทางการ
                            (รวมถึง DSQ (ตัดสิทธิ์) แต่ไม่รวม DNS (ยังไม่เริ่มต้น))
                            <br /> 3.22
                            <br /> ว่ายน้ำ
                            <br /> 3.22.1
                            <br /> ตรงไปตรงมา (เพื่อชนะเหรียญทอง) หมายถึงผู้ชนะการแข่งขันว่ายน้ำแต่ละครั้ง
                            <br /> 3.22.2
                            <br /> ตลาด Moneyline อ้างอิงถึงคู่แข่งที่มีการวางตำแหน่งที่ดีที่สุดในเหตุการณ์ (หรือความร้อนที่ระบุ) ถ้านักว่ายน้ำคนเดียวถึงรอบสุดท้ายของการแข่งขันแล้วการเดิมพันกับคู่แข่งนั้นชนะการเดิมพัน
                            หากนักว่ายน้ำทั้งสองคนไม่สามารถเข้าสู่รอบชิงชนะเลิศได้แล้วผู้เข้าแข่งขันที่มีการจัดประเภทที่ดีกว่าในระหว่างที่มีคุณสมบัติจะได้รับรางวัลผู้ชนะ
                            <br /> 3.22.3
                            <br /> ตำแหน่ง Podium จะเป็นผลการแข่งขันอย่างเป็นทางการซึ่งการเดิมพันทั้งหมดจะได้รับการตัดสิน การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันในภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.22.4
                            <br /> หากกิจกรรมถูกเลื่อนออกไประงับหรือยกเลิกและไม่สามารถดำเนินการต่อภายใน 12 ชั่วโมงนับจากเวลาเริ่มต้นที่กำหนดการเดิมพันทั้งหมดถือเป็นโมฆะ
                            <br /> 3.22.5
                            <br /> หากนักว่ายน้ำไม่สามารถเริ่มกิจกรรมได้การเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.23
                            <br /> ฟุตบอลชายหาด
                            <br /> 3.23.1
                            <br /> การเดิมพันทั้งหมดจะตัดสินหลังจากผลการเล่นทั้งสามครั้ง (สิบสองนาที) เว้นแต่จะได้ระบุเป็นลายลักษณ์อักษรจาก บริษัท
                            <br /> 3.23.2
                            <br /> หากการแข่งขันเริ่มขึ้นก่อนเวลาที่กำหนดการเดิมพันแบบไม่ใช้ชีวิตใด ๆ ที่วางไว้หลังจากเริ่มต้น แต่ก่อนการเริ่มต้นตามกำหนดการจะถือว่าเป็น
                            VOID การเดิมพันสดระหว่างการเดิมพันแบบสดถือได้ว่าเป็นการพนันที่ถูกต้องและการพนันสดถือได้ว่าเริ่มมีขึ้นเมื่อเริ่มมีการแข่งขันแม้ว่าจะเป็นเวลาที่กำหนดไว้ล่วงหน้า
                            <br /> 3.23.3
                            <br /> การเพิ่มเวลาและการยิงลูกโทษไม่นับรวมในการเดิมพันและการชำระบัญชียกเว้นที่ระบุไว้เป็นอย่างอื่น
                            <br /> 3.23.4
                            <br /> หากการแข่งขันถูกระงับเลิกหรือยกเลิกการแข่งขันทั้งหมดจะถือเป็นโมฆะ การจับคู่จะถือเป็นโมฆะโดยไม่คำนึงถึงการตัดสินใจอย่างเป็นทางการใด
                            ๆ เพื่อเป็นเกียรติแก่ผลการแข่งขัน การตัดสินเดิมพันทั้งหมดในการจับคู่ที่เป็นโมฆะขึ้นอยู่กับดุลยพินิจของ บริษัท
                            <br /> 3.23.5
                            <br /> บริษัท ให้ข้อมูลสถานที่ (เช่นพื้นกลาง) เป็นข้อมูลที่เป็นประโยชน์เท่านั้นและไม่รับผิดชอบใด ๆ หากสถานที่จัดกลางที่ระบุมีความถูกต้องหรือไม่
                            เป็นความรับผิดชอบของลูกค้าที่จะต้องตระหนักถึงสถานที่ที่เหมาะสมสำหรับการแข่งขันใด ๆ
                            <br /> 3.23.6
                            <br /> สำหรับการเดิมพันแบบสดในระหว่างเกมซึ่งเกี่ยวกับการดำเนินการที่ บริษัท เห็นสมควร แต่เพียงผู้เดียวและเห็นสมควรถือว่าเป็นอันตรายเมื่อคะแนนผลการทำงานของทีมหรือผู้เล่นคนใดคนหนึ่งอาจได้รับผลกระทบ
                            หรือ "การเล่นที่อันตราย") บริษัท ขอสงวนสิทธิ์ในการระงับการยอมรับการเดิมพันและอาจยอมรับหรือปฏิเสธการเดิมพันหลังจากเล่นอันตราย
                            การดำเนินการอื่น ๆ ทั้งหมดในเกมถือว่าปลอดภัยและการเล่นจะถือว่าได้รับการยอมรับ
                            <br /> 3.23.7
                            <br /> สำหรับการเดิมพันแบบสดการเดิมพันที่ค้างอยู่ทั้งหมดจะถูกปฏิเสธโดยอัตโนมัติในขณะที่ผู้ตัดสินจบการแข่งขันในตอนท้ายของแต่ละช่วงเวลาและ
                            / หรือเต็มเวลา
                            <br /> 3.23.8
                            <br /> ประเภทเดิมพันฟุตบอลชายหาด
                            <br /> 3.23.8.1
                            <br /> บริษัท เสนอประเภทเดิมพันต่อไปนี้:
                            <br /> 3.23.8.1.1
                            <br /> เดิมพันที่ไม่ใช่สด
                            <br /> 3.23.8.1.1.1
                            <br /> แฮนดิแค็ปเอเชีย - หมายถึงการเดิมพันว่าทีมใดจะสามารถทำประตูได้มากที่สุดตามผลคะแนนรวมทุกแต้มต่อ
                            <br /> 3.23.8.1.1.2
                            <br /> คี่ / คู่ - หมายถึงการเดิมพันที่กำหนดโดยจำนวนรวมของเป้าหมายเมื่อสิ้นสุดการเล่นทั้ง 3 ช่วงเวลา (แต่ละรอบ 12 นาที)
                            คือคี่หรือเท่าไร
                            <br /> 3.23.8.1.1.3
                            <br /> การเดิมพันสูง / ต่ำหมายถึงการเดิมพันจำนวนประตูทั้งหมดที่จะได้รับในช่วงเวลาการเล่นเต็มรูปแบบปกติสามช่วงเวลา (สิบสองนาที)
                            โดยไม่รวมเวลาพิเศษ
                            <br /> 3.23.8.1.2
                            <br /> เดิมพันที่ไม่ใช่สด
                            <br /> 3.23.8.1.2.1
                            <br /> แฮนดิแค็ปเอเชีย - หมายถึงการเดิมพันว่าทีมใดจะสามารถทำประตูได้มากที่สุดตามผลคะแนนรวมทุกแต้มต่อ
                            <br /> 3.23.8.1.2.2
                            <br /> การเดิมพันสูง / ต่ำหมายถึงการเดิมพันจำนวนประตูทั้งหมดที่จะได้รับในช่วงเวลาการเล่นเต็มรูปแบบปกติสามช่วงเวลา (สิบสองนาที)
                            โดยไม่รวมเวลาพิเศษ
                            <br /> 3.23.8.2
                            <br /> สำหรับรายชื่อประเภทเดิมพันทั้งหมดที่ครอบคลุมมากขึ้นโปรดดูที่ Sec. 2.2 ระบุไว้ข้างต้น
                            <br /> 3.24
                            <br /> สควอช
                            <br /> 3.24.1
                            <br /> ตลาด Moneyline หมายถึงผู้ชนะในการแข่งขันหรือเกมที่ระบุ ตลาดแฮนดิแคปขึ้นอยู่กับเกมหรือแต้ม (โปรดดูชื่อเรื่องการตลาด)
                            สูง / ต่ำกว่าและต่ำ / ต่ำกว่าตลาดตามจุด (เว้นแต่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.24.2
                            <br /> หากผู้เล่นไม่เริ่มการแข่งขันหรือจับคู่เดิมพันทั้งหมดจะถูกเป็นโมฆะ
                            <br /> 3.24.3
                            <br /> หากผู้เล่น (หรือคู่) เกษียณหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.24.4
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดจะถือว่าถูกต้องหากการแข่งขันดำเนินต่อก่อนหมดอายุ 12 ชั่วโมง
                            <br /> 3.24.5
                            <br /> ผู้ชนะเกมแรก (Second, Third Game Winner ฯลฯ ) หมายถึงผลของเกมที่ระบุ การเดิมพันทั้งหมดจะถือเป็นโมฆะหากเกมที่ระบุไม่สมบูรณ์
                            <br /> 3.24.6
                            <br /> การเดิมพันสดแบบสควอชจะตัดสินตามผลของการแข่งขัน (หรือเกมที่ระบุ) คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันสควอชแบบสด
                            <br /> 3.25
                            <br /> ข้อเสนอพิเศษสำหรับการแข่งม้า
                            <br /> 3.25.1
                            <br /> การแข่งม้าพิเศษจะได้รับการเสนอราคาสำหรับการแข่งขันที่ยิ่งใหญ่บางประเภทเช่น เมลเบิร์นคัพ
                            <br /> 3.25.2
                            <br /> ตรงไปตรง
                            <br /> 3.25.2.1
                            <br /> การเดิมพันแบบทันทีคือผู้ชนะในการแข่งม้า ผลการแข่งขันจะต้องเป็นทางการเมื่อมีการประกาศ "ชัดเจน", "ชั่งน้ำหนัก" หรือ
                            "น้ำหนักที่ถูกต้อง" และ "ประกาศผลอย่างเป็นทางการ" จะถูกประกาศโดยสนามแข่ง การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.25.2.2
                            <br /> เดิมพันวางเดิมพันตรงคือม้าที่เติมสถานที่ที่กำหนดไว้ในการแข่งขัน จำนวนสถานที่ที่จ่ายเป็นผู้ชนะจะระบุไว้ในชื่อเรื่องของตลาด
                            <br /> 3.25.2.3
                            <br /> Scratchings / Non-runners - เมื่อใดก็ตามที่ม้าถูกถอนออกจากการแข่งขันก่อนหรือหลังมาภายใต้คำสั่งของ starter (หรือประตูที่เริ่มต้นตั้งแต่หนึ่งประตูหรือมากกว่านั้นไม่เปิดขึ้นเพื่อป้องกันไม่ให้เกิดการเริ่มต้นอย่างเป็นธรรม)
                            ม้าจะถือว่าไม่ใช่ผู้เล่น วิ่งขึ้น / เกาและเงินที่เดิมพันบนม้านั้นจะได้รับการคืนเงิน
                            <br /> 3.25.2.4
                            <br /> หากมีการประกาศ "Dead Heat" ในตลาดแบบทันทีใด ๆ เดิมพันครึ่งหนึ่งจะถูกนำไปใช้กับการเลือกแบบเต็มจำนวนและอีกครึ่งหนึ่งของจำนวนเงินเดิมพันจะหายไป
                            หากมีม้าสองตัว "Dead Heat" จำนวนเงินเดิมพันจะเท่ากับสัดส่วน
                            <br /> 3.25.3
                            <br /> มุ่งหน้าสู่หัว
                            <br /> 3.25.3.1
                            <br /> Head to Head เดิมพันอยู่บนม้าหนึ่งที่จะวางดีกว่าอีกในการแข่งขัน หากม้าตัวหนึ่ง (หรือทั้งสอง) มีรอยขีดข่วน / นักวิ่งที่ไม่ใช่ผู้เล่นการเดิมพันทั้งหมดจะเป็นโมฆะและจะได้รับการคืนเงิน
                            หากม้าทั้งสองข้างเป็น Dead Heat การเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.26
                            <br /> กฎการแข่งม้า
                            <br /> 3.26.1
                            <br /> ทั่วไป
                            <br /> 3.26.1.1
                            <br /> (หรือถ้าหนึ่งหรือมากกว่าของประตูเริ่มต้นไม่เปิดจึงป้องกันไม่ให้เริ่มต้นที่เป็นธรรม) ม้าจะถือว่าไม่เป็นที่สิ้นสุด
                            วิ่งขึ้น / เกาและเงินที่เดิมพันบนม้านั้นจะได้รับการคืนเงิน
                            <br /> 3.26.1.2
                            <br /> เงินปันผลขั้นต่ำที่ได้รับการค้ำประกัน - มีการจ่ายเงินปันผลที่รับประกันขั้นต่ำสำหรับทุกประเภทการเดิมพันเท่ากับหน่วยของการเดิมพัน
                            <br /> 3.26.1.3
                            <br /> การเดิมพันช่วงปลาย - หากการเดิมพันได้รับการยอมรับเนื่องจากความผิดพลาดหลังจากการแข่งขันเริ่มต้นแล้วการวางเดิมพันดังกล่าวจะเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.26.1.4
                            <br /> การคัดค้าน - เมื่อใดก็ตามที่มีการคัดค้านผลการแข่งขันที่ได้รับการชำระเงินการชำระเงินใด ๆ จะต้องเป็นไปตามการตัดสินใจของเจ้าหน้าที่การประชุมหรือผู้พิทักษ์การแข่งขัน
                            <br /> 3.26.1.5
                            <br /> ผลการแข่งขันอย่างเป็นทางการ - ผลการแข่งขันจะต้องเป็นทางการเมื่อผู้แข่งขันประกาศให้ "แรลลี่" หรือ "ชั่งน้ำหนัก" โดยสนามแข่งและประกาศผลการแข่งขันอย่างเป็นทางการ
                            3.26.1.6
                            <br /> การจ่ายเงินปันผล - การชำระเงินจะเริ่มขึ้นโดยเร็วที่สุดหลังจากการแข่งขันแต่ละครั้งได้รับการยืนยันผลการยืนยันและประกาศ
                            "เจ้าหน้าที่"
                            <br /> 3.26.1.7
                            <br /> บริษัท ขอสงวนสิทธิ์ในการใช้ดุลพินิจ แต่เพียงผู้เดียวและเห็นสมควรโดยไม่จำเป็นต้องมีคำอธิบายหรือแจ้งให้ลูกค้าทราบก่อนที่จะปฏิเสธหรือปฏิเสธการเดิมพันใด
                            ๆ แม้ว่าการเดิมพันจะเกิดขึ้นก่อนที่กิจกรรมจะเริ่มต้นหรืออยู่ในวงเงินเดิมพัน (เช่น min / เดิมพันสูงสุด, เดิมพันสูงสุดต่อการแข่งขัน)
                            <br /> 3.26.1.8
                            <br /> ข้อนี้ใช้กับม้าเทียมและ greyhounds แข่ง การเดิมพันที่ถูกต้องจะไม่ถือว่าเป็นโมฆะในกรณีที่มีข้อขัดแย้งในการเขียนชื่อนักวิ่ง
                            สำหรับการแข่งขันหรือการประชุมใด ๆ หากมีความแตกต่างระหว่างชื่อนักวิ่งและหมายเลขนักวิ่งหรือควรระบุชื่อไว้อย่างไม่ถูกต้องหรือไม่ถูกต้องในเวลาย้อนกลับไปในทุกกรณีจะต้องมีการแก้ไขว่าหมายเลขนักวิ่งที่ระบุในระหว่างการแข่งขัน
                            ขณะวิ่งจะมีผลเหนือกว่า ในการแก้ไขความแตกต่างนี้ผลการแข่งขันจะต้องพิจารณาจากจำนวนนักวิ่ง
                            <br /> 3.26.1.9
                            <br /> ชื่อม้าและหมายเลข ในกรณีที่ชื่อม้าและหมายเลขม้าถูกแปลเป็นภาษาอื่น ๆ ภาษาอังกฤษจะมีผลเหนือกว่า
                            <br /> 3.26.1.10
                            <br /> เงื่อนไขการชำระเงินของเราสำหรับเขตแข่งรถต่างๆมีดังนี้:
                            <br /> กฎการจ่ายเงินแข่งม้าของสหราชอาณาจักรและไอร์แลนด์ (ชนะ & เพลย์เงินปันผล)
                            <br /> No Handicap Race WIN Place Payout for
                            <br /> 1st 2nd 3rd 4th
                            <br /> 1 4 runners or less YES NO NO NO NO
                            <br /> 2 5 runners to 7 runners YES YES YES NO NO
                            <br /> 3 8 runners to 15 runners YES YES YES YES NO
                            <br /> 4 16 runners and above YES YES YES YES YES
                            <br /> No Non Handicap Race WIN Place Payout for
                            <br /> 1st 2nd 3rd 4th
                            <br /> 1 4 runners or less YES NO NO NO NO
                            <br /> 2 5 runners to 7 runners YES YES YES NO NO
                            <br /> 3 8 runners and above YES YES YES YES NO
                            <br /> South Africa Horse Racing Payout Rules (SA Win &Place Dividend)
                            <br /> No Handicap Race & Non Handicap Race WIN Place Payout for
                            <br /> 1st 2nd 3rd 4th
                            <br /> 1 5 runners or less YES NO NO NO NO
                            <br /> 2 6 runners to 7 runners YES YES YES NO NO
                            <br /> 3 8 runners to 15 runners YES YES YES YES NO
                            <br /> 4 16 runners and above YES YES YES YES YES
                            <br /> Dubai Racing Payout Rules (Win & Place Dividend)
                            <br /> No Handicap Race & Non Handicap Race WIN Place Payout for
                            <br /> 1st 2nd 3rd
                            <br /> 1 5 runners or less YES NO NO NO
                            <br /> 2 6 runners and above YES YES YES YES
                            <br /> Australia & New Zealand Horse Racing Payout Rules (Australia Win &Place Dividend)
                            <br /> No Handicap Race & Non Handicap Race WIN Place Payout for
                            <br /> 1st 2nd 3rd
                            <br /> 1 4 runners or less YES NO NO NO
                            <br /> 2 5 runners to 7 runners YES YES YES NO
                            <br /> 3 8 runners and above YES YES YES YES*
                            <br /> * The exception to this rule occurs when a late scratching has reduced the number of runners to Seven, all three
                            Place dividends will be PAID.
                            <br /> 3.26.2
                            <br /> South African Horse Racing
                            <br /> 3.26.2.1
                            <br /> South Africa Races
                            <br /> 3.26.2.1.1
                            <br /> Win Pool
                            <br /> 3.26.2.1.1.1
                            <br /> มีวัตถุประสงค์เพื่อเลือกผู้ชนะในการแข่งขันที่ระบุ
                            <br /> 3.26.2.1.1.2
                            <br /> เงินปันผลจะคำนวณโดยหารยอดเงินสุทธิตามจำนวนหน่วยเดิมพันที่ชนะม้า
                            <br /> 3.26.2.1.1.3
                            <br /> เมื่อใดก็ตามที่มีม้าสองตัวหรือมากกว่าที่ตายแล้วให้จ่ายเงินปันผลให้คำนวณดังนี้ สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วนที่เท่ากันเช่นเดียวกับเครื่องทำความร้อนที่ตายแล้วและแต่ละส่วนที่เป็นผลลัพธ์จะหารด้วยจำนวนหน่วยเดิมพันที่วางเดิมพันบนเครื่องทำความร้อนที่ตายแล้วทั้งหมด
                            <br /> 3.26.2.1.2
                            <br /> สถานที่สระว่ายน้ำ
                            <br /> 3.26.2.1.2.1
                            <br /> จุดประสงค์คือการเลือกม้าที่วางไว้ในอันดับแรกที่สองสามหรือสี่ในการแข่งขันที่ระบุ
                            <br /> 3.26.2.1.2.2
                            <br /> หากมีผู้วิ่งห้าหรือน้อยกว่านั้นจะไม่มีสถานที่วางเดิมพันและการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.2.1.2.3
                            <br /> หากมีนักวิ่งหกหรือเจ็ดขวบให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้ในอันดับที่หนึ่งและที่สอง (โดยไม่คำนึงถึงจำนวนม้าที่ควั่นทั้งหมด)
                            <br /> 3.26.2.1.2.4
                            <br /> ถ้ามีนักวิ่งแปดถึงสิบห้าให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับแรกรองที่สองและสาม (โดยไม่คำนึงถึงจำนวนม้าที่ควายทั้งหมด)
                            <br /> 3.26.2.1.2.5
                            <br /> ถ้ามีผู้วิ่งสิบหกหรือมากกว่าให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้ในอันดับที่หนึ่ง, สอง, สามและสี่ (โดยไม่คำนึงถึงจำนวนม้าที่ผ่านดก)
                            <br /> 3.26.2.1.2.6
                            <br /> สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วน ๆ เท่า ๆ กับม้า แต่ละส่วนจะถูกหารด้วยจำนวนการเดิมพันต่อม้าแต่ละตัวและผลตอบแทนที่ได้รับจะต้องจ่าย
                            <br /> 3.26.2.1.2.7
                            <br /> เพื่อวัตถุประสงค์ในการคำนวณเงินปันผลให้ถือว่าม้าที่ให้ความร้อนเป็นอันดับหนึ่งจะถือว่าเป็นที่หนึ่งและสอง ม้าที่ตายด้วยความร้อนที่สองจะถือว่าเป็นที่ที่สองและที่สาม
                            ม้าที่ตายด้วยความร้อนที่สามจะถือว่าเป็นที่ที่สามและที่สี่ ม้าที่ตายแล้วให้ร้อนเป็นอันดับที่สี่จะถือว่าเป็นที่ราบสี่ตำแหน่ง
                            <br /> 3.26.2.2
                            <br /> การแข่งขันในดูไบ
                            <br /> 3.26.2.2.1
                            <br /> วินพูล
                            <br /> 3.26.2.2.1.1
                            <br /> มีวัตถุประสงค์เพื่อเลือกผู้ชนะในการแข่งขันที่ระบุ
                            <br /> 3.26.2.2.1.2
                            <br /> เงินปันผลจะคำนวณโดยหารยอดเงินสุทธิตามจำนวนที่เดิมพันของม้าที่ชนะ
                            <br /> 3.26.2.2.1.3
                            <br /> เมื่อใดก็ตามที่มีม้าสองตัวหรือมากกว่าที่ตายแล้วให้จ่ายเงินปันผลให้คำนวณดังนี้ สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วนที่เท่ากันเช่นเดียวกับเครื่องทำความร้อนที่ตายแล้วและแต่ละส่วนที่เป็นผลลัพธ์จะหารด้วยจำนวนหน่วยเดิมพันที่วางเดิมพันบนเครื่องทำความร้อนที่ตายแล้วทั้งหมด
                            <br /> 3.26.2.2.2
                            <br /> สถานที่สระว่ายน้ำ
                            <br /> 3.26.2.2.2.1
                            <br /> จุดประสงค์คือการเลือกม้าที่อยู่ในอันดับแรกที่สองหรือสามในการแข่งขันที่ระบุ
                            <br /> 3.26.2.2.2.2
                            <br /> หากมีผู้วิ่งห้าหรือน้อยกว่านั้นจะไม่มีสถานที่วางเดิมพันและการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.2.2.2.3
                            <br /> ถ้ามีนักวิ่งมากกว่าห้าคนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่หนึ่งและสองและสาม
                            <br /> 3.26.2.2.2.4
                            <br /> สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วน ๆ เท่า ๆ กับม้า ส่วนที่ถูกแบ่งออกจะถูกแบ่งตามลำดับโดยจำนวนของการเดิมพันแต่ละหน่วยของม้าแต่ละตัวและผลลัพธ์จะเป็นจำนวนที่ต้องจ่ายให้กับ
                            บริษัท
                            <br /> 3.26.2.2.2.5
                            <br /> เพื่อวัตถุประสงค์ในการคำนวณเงินปันผลให้ถือว่าม้าที่ให้ความร้อนเป็นอันดับหนึ่งจะถือว่าเป็นที่หนึ่งและสอง ม้าที่ตายด้วยความร้อนที่สองจะถือว่าเป็นที่ที่สองและที่สาม
                            ม้าที่ตายแล้วสำหรับสถานที่ที่สามจะถือว่าเป็นที่ราบที่สาม
                            <br /> 3.26.2.3
                            <br /> Scratchings / Non-runners - เมื่อใดก็ตามที่ม้าถูกถอนออกจากการแข่งขันก่อนหรือหลังมาภายใต้คำสั่งของ starter (หรือประตูที่เริ่มต้นตั้งแต่หนึ่งประตูหรือมากกว่านั้นไม่เปิดขึ้นเพื่อป้องกันไม่ให้เกิดการเริ่มต้นอย่างเป็นธรรม)
                            ม้าจะถือว่าไม่ใช่ผู้เล่น วิ่งขึ้น / เกาและเงินที่เดิมพันบนม้านั้นจะได้รับการคืนเงิน
                            <br /> 3.26.2.4
                            <br /> หากมีการประกาศ "Dead Heat" ในตลาดแบบทันทีใด ๆ เดิมพันครึ่งหนึ่งจะถูกนำไปใช้กับการเลือกแบบเต็มจำนวนและอีกครึ่งหนึ่งของจำนวนเงินเดิมพันจะหายไป
                            ถ้ามีม้ามากกว่าสองตัว "Dead Heat" เงินเดิมพันจะถูกแบ่งตามสัดส่วน
                            <br /> 3.26.3
                            <br /> การแข่งม้าของอังกฤษ
                            <br /> 3.26.3.1
                            <br /> การแข่งม้าอังกฤษจะขึ้นอยู่กับกฎการแข่งม้าของอังกฤษ
                            <br /> 3.26.3.2
                            <br /> วินพูล
                            <br /> 3.26.3.2.1
                            <br /> มีวัตถุประสงค์เพื่อเลือกผู้ชนะในการแข่งขันที่ระบุ
                            <br /> 3.26.3.2.2
                            <br /> เงินปันผลจะคำนวณโดยหารยอดเงินสุทธิตามจำนวนหน่วยเดิมพันที่ชนะม้า
                            <br /> 3.26.3.2.3
                            <br /> เมื่อใดก็ตามที่มีม้าสองตัวหรือมากกว่าที่ตายแล้วให้จ่ายเงินปันผลให้คำนวณดังนี้ สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วนที่เท่ากันเช่นเดียวกับเครื่องทำความร้อนที่ตายแล้วและแต่ละส่วนที่เป็นผลลัพธ์จะหารด้วยจำนวนหน่วยเดิมพันที่วางเดิมพันบนเครื่องทำความร้อนที่ตายแล้วทั้งหมด
                            <br /> 3.26.3.3
                            <br /> สถานที่สระว่ายน้ำ
                            <br /> 3.26.3.3.1
                            <br /> จุดประสงค์คือการเลือกม้าที่วางไว้ในอันดับแรกที่สองสามหรือสี่ในการแข่งขันที่ระบุ
                            <br /> 3.26.3.3.2
                            <br /> มีกฎแตกต่างกันสำหรับ Place Pool betting ขึ้นอยู่กับว่าการแข่งขันเป็นแต้มต่อหรือไม่มีแต้มต่อ
                            <br /> 3.26.3.4
                            <br /> การแข่งขันที่ไม่ใช่แฮนดิแค็ป
                            <br /> 3.26.3.4.1
                            <br /> หากมีผู้วิ่งสี่หรือน้อยกว่านั้นจะไม่มีการวางเดิมพันใด ๆ และการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.3.4.2
                            <br /> หากมีผู้วิ่ง 5-7 คนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับที่หนึ่ง
                            <br /> 3.26.3.4.3
                            <br /> ถ้ามีนักวิ่งมากกว่า 7 คนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับหนึ่งสองและสาม
                            <br /> 3.26.3.5
                            <br /> แข่ง Handicap
                            <br /> 3.26.3.5.1
                            <br /> หากมีผู้วิ่งสี่หรือน้อยกว่านั้นจะไม่มีการวางเดิมพันใด ๆ และการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.3.5.2
                            <br /> หากมีผู้วิ่ง 5-7 คนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับที่หนึ่ง
                            <br /> 3.26.3.5.3
                            <br /> ถ้ามีนักวิ่งแปดถึงสิบห้าให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับหนึ่งสองและสาม
                            <br /> 3.26.3.5.4
                            <br /> ถ้ามีนักวิ่งมากกว่าสิบห้าคนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับหนึ่งสองสามและสี่
                            <br /> 3.26.3.5.5
                            <br /> สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วน ๆ เท่า ๆ กับม้า แต่ละส่วนจะถูกหารด้วยจำนวนการเดิมพันต่อม้าแต่ละตัวและผลตอบแทนที่ได้รับจะต้องจ่าย
                            <br /> 3.26.3.5.6
                            <br /> เพื่อวัตถุประสงค์ในการคำนวณเงินปันผลให้ถือว่าม้าที่ให้ความร้อนเป็นอันดับหนึ่งจะถือว่าเป็นที่หนึ่งและสอง ม้าที่ตายด้วยความร้อนที่สองจะถือว่าเป็นที่ที่สองและที่สาม
                            ม้าที่ตายด้วยความร้อนที่สามจะถือว่าเป็นที่ที่สามและที่สี่ ม้าที่ตายแล้วให้ร้อนเป็นอันดับที่สี่จะถือว่าเป็นที่ราบสี่ตำแหน่ง
                            <br /> 3.26.4
                            <br /> การแข่งม้าไอริช
                            <br /> 3.26.4.1
                            <br /> การแข่งม้าไอริชจะต้องเป็นไปตามกฎการแข่งม้าของชาวไอริช
                            <br /> 3.26.4.2
                            <br /> วินพูล
                            <br /> 3.26.4.2.1
                            <br /> มีวัตถุประสงค์เพื่อเลือกผู้ชนะในการแข่งขันที่ระบุ
                            <br /> 3.26.4.2.2
                            <br /> เงินปันผลจะคำนวณโดยหารยอดเงินสุทธิตามจำนวนหน่วยเดิมพันที่ชนะม้า
                            <br /> 3.26.4.2.3
                            <br /> เมื่อใดก็ตามที่ม้าสองตัวหรือมากกว่านั้นตายโดยการจ่ายเงินปันผลให้คำนวณโดยการแบ่งสระสุทธิให้เท่ากับจำนวนที่เท่ากันกับเครื่องทำความร้อนที่ตายแล้วและแต่ละส่วนที่เป็นผลลัพธ์จะถูกหารด้วยจำนวนหน่วยที่วางเดิมพันบน
                            เดทฮีทเตอร์.
                            <br /> 3.26.4.3
                            <br /> สถานที่สระว่ายน้ำ
                            <br /> 3.26.4.3.1
                            <br /> จุดประสงค์คือการเลือกม้าที่วางไว้ในอันดับแรกที่สองสามหรือสี่ในการแข่งขันที่ระบุ
                            <br /> 3.26.4.3.2
                            <br /> มีกฎแตกต่างกันสำหรับ Place Pool betting ขึ้นอยู่กับว่าการแข่งขันเป็นแต้มต่อหรือไม่มีแต้มต่อ
                            <br /> 3.26.4.3.3
                            <br /> การแข่งขันที่ไม่ใช่แฮนดิแค็ป
                            <br /> 3.26.4.3.3.1
                            <br /> ถ้ามีผู้วิ่งสี่หรือน้อยกว่านั้นจะไม่มีการวางเดิมพันใด ๆ และการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.4.3.3.2
                            <br /> หากมีผู้วิ่ง 5-7 คนจ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าเป็นอันดับแรกและอันดับที่สอง
                            <br /> 3.26.4.3.3.3
                            <br /> ถ้ามีนักวิ่งมากกว่า 7 คนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับหนึ่งสองและสาม
                            <br /> 3.26.4.3.4
                            <br /> แข่ง Handicap
                            <br /> 3.26.4.3.4.1
                            <br /> ถ้ามีผู้วิ่งสี่หรือน้อยกว่านั้นจะไม่มีการวางเดิมพันใด ๆ และการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.4.3.4.2
                            <br /> หากมีผู้วิ่ง 5-7 คนให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับที่หนึ่ง
                            <br /> 3.26.4.3.4.3
                            <br /> ถ้ามีนักวิ่งแปดถึงสิบห้าให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับหนึ่งสองและสาม
                            <br /> 3.26.4.3.4.4
                            <br /> ถ้ามีสิบหกหรือมากกว่าให้จ่ายเงินปันผลในส่วนที่เกี่ยวกับม้าที่วางไว้อันดับหนึ่งสองสามและสี่
                            <br /> 3.26.4.3.4.5
                            <br /> สระว่ายน้ำสุทธิจะแบ่งออกเป็นส่วน ๆ เท่า ๆ กับม้า ส่วนที่ถูกแบ่งออกจะถูกแบ่งตามลำดับโดยจำนวนของการเดิมพันแต่ละหน่วยของม้าแต่ละตัวและผลลัพธ์จะเป็นจำนวนที่ต้องจ่ายให้กับ
                            บริษัท
                            <br /> '
                            <br /> 3.26.4.3.4.6
                            <br /> เพื่อวัตถุประสงค์ในการคำนวณเงินปันผลให้ถือว่าม้าที่ให้ความร้อนเป็นอันดับหนึ่งจะถือว่าเป็นที่หนึ่งและสอง ม้าที่ตายด้วยความร้อนที่สองจะถือว่าเป็นที่ที่สองและที่สาม
                            ม้าที่ตายด้วยความร้อนที่สามจะถือว่าเป็นที่ที่สามและที่สี่ และม้าที่ตายด้วยความร้อนเป็นที่สี่จะถือว่าเป็นที่ราบสี่ตำแหน่ง
                            <br /> 3.26.5
                            <br /> กฎการแข่งรถออสเตรเลียสายรัดและเกรย์ฮาวด์
                            <br /> ข้อกำหนดของข้อกำหนด
                            <br /> "Backed" หมายถึงการเดิมพันที่ได้ทำกับผู้เข้าแข่งขัน finisher หรือ combination แล้วแต่กรณี
                            <br /> "ผู้เข้าแข่งขัน" หมายถึงการแข่งขันม้าหรือเกรย์ฮาวด์ที่เข้าร่วมการแข่งขันในการเปิดการเดิมพันในการแข่งขัน แต่ไม่รวมถึงม้าหรือสุนัขไล่เนื้อที่ที่มีรอยขีดข่วนจากการแข่งขัน
                            <br /> Finisher "หมายถึงความเกี่ยวข้องกับเชื้อชาติเชื้อสายที่จบการแข่งขัน แต่ไม่รวมผู้เริ่มต้นที่ถูกตัดสิทธิ์หรือประกาศว่าไม่ใช่ผู้เริ่มต้นก่อนที่จะมีการประกาศน้ำหนักที่ถูกต้องสำหรับการแข่งขัน
                            <br /> "นักลงทุน" หมายถึงบุคคลที่จ่ายเงินและทำเงินเดิมพันที่ได้รับการยอมรับจาก TAB หรือสโมสรแข่งที่ดำเนินการ totalizator
                            ในหลักสูตร
                            <br /> 3.26.5.1
                            <br /> การแข่งม้าและเกรย์ฮาวด์ของออสเตรเลียจะอยู่ภายใต้กฎ Totalizator ที่บังคับใช้โดย TAB Limited
                            <br /> 3.26.5.2
                            <br /> วินพูล
                            <br /> 3.26.5.2.1
                            <br /> มีจุดประสงค์เพื่อเลือกผู้ชนะในการแข่งขันที่ระบุ
                            <br /> 3.26.5.2.2
                            <br /> เดิมพันจะไม่ได้รับการยอมรับหากจำนวนผู้แข่งขันในการแข่งขันน้อยกว่า 2.
                            <br /> 3.26.5.2.3
                            <br /> หากจำนวนผู้เข้าแข่งขันในการแข่งขันลดลงต่ำกว่า 2 เมื่อใดก็ได้หรือหากไม่มีผู้เล่นที่ชนะในการแข่งชนะเดิมพันพูลจะต้องถูกยกเลิกและการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.5.2.4
                            <br /> (น้อยกว่าจำนวนเงินอื่น ๆ ที่ถูกหักออกตามหลักเกณฑ์) จะถูกแบ่งระหว่างนักลงทุนในหมัดเด็ดที่วางไว้ก่อนในการแข่งขัน
                            <br /> 3.26.5.2.5
                            <br /> ถ้ามีความร้อนที่เสียชีวิตในการแข่งขันครั้งแรกให้คำนวณดังนี้เงินปันผลที่ได้รับจะแบ่งออกเป็นหลายส่วนเท่า ๆ กันเนื่องจากมีผู้ชนะที่ได้รับการสนับสนุนในส่วนที่ตายแล้วและส่วนหนึ่งเป็น
                            ที่จัดสรรให้กับนักชกมวยที่ได้รับการสนับสนุนแต่ละรายซึ่งจะแบ่งระหว่างนักลงทุนในหมัดเด็ดกับส่วนที่ได้รับการจัดสรร
                            <br /> 3.26.5.3
                            <br /> สถานที่สระว่ายน้ำ
                            <br /> 3.26.5.3.1
                            <br /> มีจุดประสงค์เพื่อเลือกผู้เล่นสำเร็จที่วางไว้อันดับที่หนึ่งสองหรือสามตาม แต่กรณี
                            <br /> 3.26.5.3.2
                            <br /> เดิมพันจะไม่ได้รับการยอมรับหากจำนวนผู้แข่งขันในการแข่งขันน้อยกว่า 5
                            <br /> 3.26.5.3.3
                            <br /> หากจำนวนผู้เข้าแข่งขันในการแข่งขันลดลงต่ำกว่า 5 ในเวลาใด ๆ หรือหากไม่มีผู้เล่นที่สำเร็จในการแข่งขันเดิมพันสระว่ายน้ำต้องถูกยกเลิกและการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.26.5.3.4
                            <br /> จะมีการจ่ายเงินปันผลในประเภทที่ 2 หากจำนวนการเข้าร่วมการแข่งขันที่ได้รับในเวลาที่กำหนดโดยผู้ควบคุมหรือสโมสรแข่งที่รับผิดชอบในการดำเนินการประชุมการแข่งขันที่มีค่าน้อยกว่า
                            8
                            <br /> 3.26.5.3.5
                            <br /> (ไม่รวมจำนวนเงินอื่น ๆ ที่หักตามหลักเกณฑ์) แบ่งออกเป็น 2 ส่วนเท่า ๆ กันซึ่งแบ่งเป็นส่วน ๆ กันระหว่างผู้ลงทุนในหมัดเด็ดที่หนึ่งในการแข่งขันและครั้งที่สอง
                            ส่วนหนึ่งจะถูกแบ่งระหว่างนักลงทุนในหมัดเด็ดที่สองในการแข่งขัน
                            <br /> 3.26.5.3.6
                            <br /> ในกรณีที่มีผู้ชนะในการแข่งขันปันผลครั้งแรกจะมีการจ่ายเงินปันผลเป็นครั้งแรกให้แบ่งเงินปันผลเป็นดังนี้คือเงินปันผลที่จะแบ่งออกเป็นหลายส่วนเท่ากันโดยมีผู้ชนะที่ได้รับการสนับสนุนในส่วนที่ตายแล้ว
                            ที่จัดสรรให้กับนักชกมวยที่ได้รับการสนับสนุนซึ่งจะแบ่งระหว่างนักลงทุนในหมัดเด็ดซึ่งเป็นส่วนที่ได้รับการจัดสรร
                            <br /> 3.26.5.3.7
                            <br /> จะมีการจ่ายเงินปันผลในประเภทที่ 2 หากมีจำนวนรายการในการแข่งที่ได้รับตามกำหนดเวลาของการเกาที่กำหนดโดยคณะกรรมการควบคุมหรือสโมสรแข่งที่รับผิดชอบการดำเนินการประชุมการแข่งขันที่มีอย่างน้อย
                            8 ครั้ง
                            <br /> 3.26.5.3.8
                            <br /> ให้จ่ายเงินปันผลเป็นเงินปันผลสำหรับการจ่ายเงินปันผล 3 ครั้ง (หักจำนวนเงินอื่น ๆ ที่หักออกตามหลักเกณฑ์) แบ่งออกเป็น
                            3 ส่วนเท่า ๆ กันซึ่งแบ่งเป็นส่วน ๆ กันระหว่างผู้ลงทุนในบัญชีรายรับรายแรก ส่วนที่สองจะแบ่งระหว่างนักลงทุนในหมัดเด็ดที่สองและส่วนที่สามจะแบ่งระหว่างนักลงทุนในหมัดเด็ดที่สาม
                            <br /> 3.26.5.3.9
                            <br /> ถ้าผู้ชนะ 2 คนจบชีวิตในการแข่งขันปันผล 3 ครั้งและได้รับการสนับสนุนทั้งสองฝ่ายจะแบ่งเงินปันผลออกเป็น 2 ใน 3 ส่วนแบ่งเป็น
                            2 ส่วนเท่า ๆ กันและแต่ละส่วนจะแบ่งแยกระหว่างนักลงทุนในแต่ละหมัดเด็ดที่ได้รับการสนับสนุน ความร้อนที่ตายแล้วและหนึ่งในสามของสถานที่จ่ายเงินปันผลจะถูกแบ่งระหว่างนักลงทุนในหมัดเด็ดที่สาม
                            <br /> 3.26.5.3.10
                            <br /> หากผู้ชนะ 2 คนตายในสถานที่แรกในการแข่งขัน 3 รอบ แต่ได้รับการสนับสนุนเพียงครั้งเดียวสระว่ายน้ำที่จ่ายเงินปันผลทั้งหมดจะแบ่งออกเป็น
                            2 ส่วนเท่ากัน ส่วนหนึ่งจะแบ่งระหว่างนักลงทุนในหมัดเด็ดที่ได้รับการสนับสนุนในความร้อนที่ตายแล้วและส่วนที่สองจะแบ่งระหว่างนักลงทุนในหมัดเด็ดที่สาม
                            <br /> 3.26.5.3.11
                            <br /> หากผู้ชนะ 2 คนตายความร้อนเป็นอันดับแรกในการแข่งขันปันผล 3 ครั้ง แต่ไม่ได้รับการสนับสนุนทั้งหมดของสถานที่เงินปันผลจะแบ่งออกระหว่างนักลงทุนกับหมัดเด็ดที่วางไว้
                            <br /> 3.26.5.3.12
                            <br /> ถ้าผู้ชนะ 3 คนหรือมากกว่าที่ได้รับความร้อนจากความร้อนเป็นอันดับแรกในการแข่งขันปันผล 3 รอบการจ่ายเงินปันผลจะแบ่งออกเป็นหลายส่วนเท่ากันโดยมีผู้ชนะที่ได้รับการสนับสนุนในส่วนที่ตายแล้วและส่วนที่ได้รับการจัดสรรให้กับผู้หมาดเด็ดแต่ละคน
                            ซึ่งจะแบ่งระหว่างนักลงทุนในหมัดเด็ดซึ่งเป็นส่วนที่ได้รับจัดสรร
                            <br /> 3.26.5.3.13
                            <br /> ถ้ามีผู้สนับสนุนหมัดเด็ดในตอนแรกและผู้เล่นที่ได้รับการสนับสนุน 2 คนหรือมากกว่าที่ได้รับความร้อนที่สองในการแข่งขันปันผล
                            3 ครั้งให้แบ่งผู้เล่นคนที่ทำประตูแรกเป็นอันดับ 1 ในสาม สองในสามของสถานที่สระว่ายน้ำเงินปันผลจะแบ่งออกเป็นจำนวนเท่ากันส่วนที่มีผู้ได้รับการสนับสนุนในตายตาย;
                            ส่วนที่ได้รับการจัดสรรให้กับหมัดเด็ดที่ได้รับการสนับสนุนในความตายเป็นครั้งที่สองในการแข่งขันซึ่งจะแบ่งระหว่างนักลงทุนในหมัดเด็ดซึ่งเป็นส่วนที่ได้รับการจัดสรร
                            <br /> 3.26.5.3.14
                            <br /> หากมีผู้ชนะ 2 คนหรือมากกว่าที่ได้รับความร้อนที่สอง แต่ได้รับการสนับสนุนเพียง 1 คนเท่านั้นผู้เล่นจะได้รับเงินปันผลทั้งหมดจากนั้นแบ่งเป็น
                            2 ส่วนเท่ากัน ส่วนหนึ่งจะแบ่งระหว่างนักลงทุนในหมัดเด็ดคนแรกและส่วนที่สองจะแบ่งระหว่างนักลงทุนในหมัดเด็ดที่สองที่ได้รับการสนับสนุนในหัวตาย
                            <br /> 3.26.5.3.15
                            <br /> ถ้าผู้เล่นฝ่ายเสิร์ฟครั้งแรกและอันดับที่สองได้รับการสนับสนุนและผู้เล่นที่ได้รับการสนับสนุน 2 คนหรือมากกว่าที่ได้รับความร้อนที่สามในการแข่งขันปันผล
                            3 ครั้งจะแบ่งผู้เล่นคนที่ทำประตูแรกและหนึ่งในสามเป็นหนึ่งในสามของ เงินปันผลที่จะแบ่งออกเป็นกลุ่มที่นักลงทุนที่สองวางหมัดเด็ด;
                            หนึ่งในสามของสระว่ายน้ำปันผลสถานที่จะแบ่งออกเป็นหลายส่วนเท่า ๆ กันเนื่องจากมีผู้สนับสนุนที่ได้รับการสนับสนุนในความร้อนที่ตายแล้วและส่วนหนึ่งส่วนจะได้รับการจัดสรรให้กับนักชกนับผู้ได้รับการสนับสนุนในผู้ตายที่ตายแล้วซึ่งจะแบ่งระหว่างผู้ลงทุนใน
                            finisher ซึ่งเป็นส่วนที่ได้รับมอบหมาย
                            <br /> 3.27
                            <br /> กฎและข้อบังคับกีฬาโอลิมปิกฤดูหนาว
                            <br /> 3.27.1
                            <br /> ทั่วไป
                            <br /> 3.27.1.1
                            <br /> ตลาดทั้งหมดจะได้รับการตัดสินตามผลการประกาศอย่างเป็นทางการของ IOC
                            <br /> 3.27.1.2
                            <br /> พิธีเหรียญเดิมจะเป็นผลการแข่งขันอย่างเป็นทางการซึ่งการเดิมพันทั้งหมดจะได้รับการตัดสิน การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันในภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.27.1.3
                            <br /> การเดิมพันทั้งหมดจะถือว่าสมบูรณ์หากการแข่งขันหรือการแข่งขันเสร็จสิ้นภายในระยะเวลาอย่างเป็นทางการของการแข่งขันกีฬาโอลิมปิกโดยไม่คำนึงถึงเวลาเริ่มต้นจริง
                            หากการแข่งขันหรือการแข่งขันไม่สมบูรณ์และไม่มีผลอย่างเป็นทางการเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.27.1.4
                            <br /> การเดิมพันใด ๆ ที่ได้รับการยอมรับจากความผิดพลาดหลังจากเหตุการณ์ได้เริ่มขึ้นจริง (ยกเว้นการเดิมพันแบบสด) ถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.27.1.5
                            <br /> หากทีมหรือผู้แข่งขันไม่ได้เริ่มกิจกรรมใด ๆ การเดิมพันทั้งหมดที่ถูกวางลงในการเลือก (รวมถึงตลาดอย่างสมบูรณ์ (เพื่อชนะเหรียญทอง))
                            จะถือเป็นโมฆะและจะได้รับการคืนเงิน หากทีมที่ตั้งชื่อหรือคู่แข่งในตลาด Money Line (head to head) ไม่เริ่มเล่นการแข่งขันการเดิมพันทั้งหมดในตลาดนั้นจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.27.1.6
                            <br /> ถ้าความตายเกิดขึ้นในทันที (เพื่อชนะเหรียญทอง) ตลาดแล้วครึ่งหนึ่งของเงินเดิมพันจะถูกนำไปใช้กับการเลือกแบบเต็มจำนวนในขณะที่อีกครึ่งหนึ่งของจำนวนเงินเดิมพันจะหายไป
                            ถ้าความร้อนที่เกิดขึ้นในตลาด Money Line (Head to Head) ผลที่ได้ก็คือการผูกและเดิมพันกับคู่แข่งทั้งสองจะได้รับการคืนเงิน
                            <br /> 3.27.2
                            <br /> เหรียญโอลิมปิก
                            <br /> 3.27.2.1
                            <br /> ตลาดจะนำเสนอจำนวนเหรียญที่ได้รับจากบุคคลหรือประเทศในกีฬาโอลิมปิก
                            <br /> 3.27.2.2
                            <br /> ตลาดเหล่านี้จะหมายถึงเหรียญทองทั้งเหรียญหรือเหรียญรวม (เหรียญทองเงินและเหรียญทองแดงรวมกัน)
                            <br /> 3.27.2.3
                            <br /> ตลาดทั้งหมดจะถูกตัดสินโดยตารางเหรียญอย่างเป็นทางการซึ่ง IOC ออกโดยทันทีหลังจากสิ้นสุดการแข่งขันกีฬาโอลิมปิก การเปลี่ยนแปลงใด
                            ๆ ที่เกิดขึ้นในตารางเหรียญจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.27.3
                            <br /> Moneyline (Head to Head)
                            <br /> 3.27.3.1
                            <br /> คู่แข่งหรือทีมใดจะชนะการแข่งขันหรือถูกวางไว้สูงกว่าในเหตุการณ์
                            <br /> 3.27.3.1.1
                            <br /> การตัดสินขั้นสุดท้ายจะถูกตัดสินโดยผู้แข่งขันที่ดำเนินไปไกลที่สุดในเหตุการณ์ ถ้าคู่แข่งทั้งคู่ถูกตัดออกในขั้นตอนเดียวกันผู้เข้าแข่งขันที่มีอันดับสูงกว่าจะได้รับรางวัลเป็นผู้ชนะ
                            คู่แข่งขันทั้งคู่ต้องถูกตัดออกในขั้นตอนเดียวกัน แต่ไม่ได้รับการจัดอันดับอย่างเป็นทางการจากนั้นการเดิมพันจะถือเป็นโมฆะ
                            <br /> 3.27.4
                            <br /> ฮอกกี้น้ำแข็ง
                            <br /> 3.27.4.1
                            <br /> ฮ็อกกี้น้ำแข็งโอลิมปิกจะเป็นไปตามกฎกติกาฮ็อกกี้น้ำแข็งตามปกติ (3.5) ข้างต้น
                            <br /> 3.27.4.2
                            <br /> ยกเว้นกฎข้อ 3.5.3 ซึ่งจะถูกแทนที่ด้วยข้อความต่อไปนี้ - การเดิมพันทั้งหมดจะถือว่าสมบูรณ์หากการแข่งขันเสร็จสิ้นภายในระยะเวลาอย่างเป็นทางการของการแข่งขันกีฬาโอลิมปิกโดยไม่คำนึงถึงเวลาเริ่มต้นจริง
                            การเดิมพันจะถือเป็นผลถ้าผลการแข่งขันอย่างเป็นทางการประกาศโดย IOC หากการแข่งขันไม่สมบูรณ์และไม่มีผลอย่างเป็นทางการเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.27.4.3
                            <br /> อาจมีการเสนอตลาดเพิ่มเติม (เช่นเวลาทำงานล่วงเวลาหรือผู้โชคดีที่ใช้จุดโทษ) และข้อกำหนดของตลาดเหล่านี้จะระบุไว้อย่างชัดเจนในชื่อ
                            <br /> * หมายเหตุ: การเล่นนอกเวลาจะไม่สามารถเล่นได้ในระหว่างการแข่งขันกลุ่มรอบเบื้องต้นเพื่อความสัมพันธ์ที่เป็นไปได้
                            <br /> 3.28
                            <br /> Netball
                            <br /> 3.28.1
                            <br /> ตลาดแบบเต็มเวลารวมถึงการเดิมพันแบบสดจะตัดสินตามผลการแข่งขันที่ผ่านมารวมถึงการทำงานล่วงเวลา (ยกเว้นที่ระบุไว้เป็นอย่างอื่น
                            <br /> 3.28.2
                            <br /> หากการแข่งขันไม่เริ่มต้นในวันที่เริ่มต้นตามกำหนดการการเดิมพันทั้งหมดจะถือเป็นโมฆะ (เว้นแต่ที่ระบุไว้เป็นอย่างอื่น)
                            หากการแข่งขันถูกระงับหรือยกเลิกการวางเดิมพันทั้งหมดจะถือเป็นโมฆะยกเว้นการเดิมพันที่กำหนดโดยไม่มีเงื่อนไข
                            <br />
                            <br /> 3.28.3
                            <br /> ผลการแข่งขันครึ่งแรกคือผลรวมของไตรมาสแรกและไตรมาสที่สอง ผลการแข่งขันในครึ่งหลังคือผลรวมของไตรมาสที่สามและสี่รวมทั้งการเล่นล่วงเวลาที่อาจเล่นผลการแข่งขันในไตรมาสที่สี่ไม่รวมถึงการทำงานล่วงเวลาใด
                            ๆ ที่อาจจะเล่น
                            <br /> 3.28.4
                            <br /> หากมีการระงับหรือยกเลิกการแข่งขันการวางเดิมพันในครึ่งหลังหรือไตรมาสที่ยังไม่เสร็จจะถือเป็นโมฆะ หากครึ่งหลังหรือไตรมาสที่กำหนดเสร็จสมบูรณ์เดิมพันจะมีผลสมบูรณ์
                            <br /> 3.28.5
                            <br /> คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันแบบสดและแฮนดิแคปที่แสดงในระหว่างการซื้อขายสดหมายถึงคะแนนที่เริ่มต้นของการแข่งขันคือ
                            0-0 เวลาและคะแนนที่แสดงมีไว้เพื่อการอ้างอิงเท่านั้น
                            <br /> 3.29
                            <br /> กีฬาโอลิมปิก
                            <br /> 3.29.1
                            <br /> ทั่วไป
                            <br /> 3.29.1.1
                            <br /> ตลาดทั้งหมดจะได้รับการตัดสินตามผลการประกาศอย่างเป็นทางการของ IOC
                            <br /> 3.29.1.2
                            <br /> พิธีเหรียญเดิมจะเป็นผลการแข่งขันอย่างเป็นทางการซึ่งการเดิมพันทั้งหมดจะได้รับการตัดสิน การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันในภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.29.1.3
                            <br /> การเดิมพันทั้งหมดจะถือว่าสมบูรณ์ถ้าการแข่งขันหรือการแข่งขันเสร็จสิ้นภายในระยะเวลาอย่างเป็นทางการของการแข่งขันกีฬาโอลิมปิกโดยไม่คำนึงถึงเวลาเริ่มต้นจริง
                            ๆ (ยกเว้นฟุตบอล) หากการแข่งขันหรือการแข่งขันไม่สมบูรณ์และไม่มีผลอย่างเป็นทางการเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.29.1.4
                            <br /> การเดิมพันใด ๆ ที่ได้รับการยอมรับว่าผิดพลาดหลังจากเหตุการณ์เริ่มต้นขึ้นจริง (ยกเว้นการเดิมพันสด) จะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.29.1.5
                            <br /> หากทีมหรือผู้แข่งขันไม่ได้เริ่มกิจกรรมใด ๆ การเดิมพันทั้งหมดที่ถูกวางลงในการเลือก (รวมถึงตลาดอย่างสมบูรณ์ (เพื่อชนะเหรียญทอง))
                            จะถือเป็นโมฆะและจะได้รับการคืนเงิน หากทีมที่ตั้งชื่อหรือคู่แข่งในตลาด Money Line (head to head) ไม่เริ่มเล่นการแข่งขันการเดิมพันทั้งหมดในตลาดนั้นจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.29.1.6
                            <br /> ถ้าความตายเกิดขึ้นในทันที (เพื่อชนะเหรียญทอง) ตลาดแล้วครึ่งหนึ่งของเงินเดิมพันจะถูกนำไปใช้กับการเลือกแบบเต็มจำนวนในขณะที่อีกครึ่งหนึ่งของจำนวนเงินเดิมพันจะหายไป
                            ถ้าความร้อนที่เกิดขึ้นในตลาด Money Line (Head to Head) ผลที่ได้ก็คือการผูกและเดิมพันกับคู่แข่งทั้งสองจะได้รับการคืนเงิน
                            <br /> 3.29.2
                            <br /> เหรียญโอลิมปิก
                            <br /> 3.29.2.1
                            <br /> ตลาดจะนำเสนอจำนวนเหรียญที่ได้รับจากบุคคลหรือประเทศในการแข่งขันกีฬาโอลิมปิก 2008
                            <br /> 3.29.2.2
                            <br /> ตลาดเหล่านี้จะหมายถึงเหรียญทองทั้งเหรียญหรือเหรียญรวม (เหรียญทองเงินและเหรียญทองแดงรวมกัน)
                            <br /> 3.29.2.3
                            <br /> ตลาดทั้งหมดจะถูกตัดสินโดยตารางเหรียญอย่างเป็นทางการซึ่ง IOC ออกโดยทันทีหลังจากสิ้นสุดการแข่งขันกีฬาโอลิมปิก การเปลี่ยนแปลงใด
                            ๆ ที่เกิดขึ้นในตารางเหรียญจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.29.3
                            <br /> Moneyline (Head to Head)
                            <br /> 3.29.3.1
                            <br /> คู่แข่งหรือทีมใดจะชนะการแข่งขันหรือถูกวางไว้สูงกว่าในเหตุการณ์
                            <br /> 3.29.3.2
                            <br /> การตัดสินขั้นสุดท้ายจะถูกตัดสินโดยผู้แข่งขันที่ดำเนินไปไกลที่สุดในเหตุการณ์ ถ้าคู่แข่งทั้งคู่ถูกตัดออกในขั้นตอนเดียวกันผู้เข้าแข่งขันที่มีอันดับสูงกว่าจะได้รับรางวัลเป็นผู้ชนะ
                            คู่แข่งขันทั้งคู่ต้องถูกตัดออกในขั้นตอนเดียวกัน แต่ไม่ได้รับการจัดอันดับอย่างเป็นทางการจากนั้นการเดิมพันจะถือเป็นโมฆะ
                            <br /> 3.29
                            <br /> กีฬาโอลิมปิก
                            <br /> 3.29.1
                            <br /> ทั่วไป
                            <br /> 3.29.1.1
                            <br /> ตลาดทั้งหมดจะได้รับการตัดสินตามผลการประกาศอย่างเป็นทางการของ IOC
                            <br /> 3.29.1.2
                            <br /> พิธีเหรียญเดิมจะเป็นผลการแข่งขันอย่างเป็นทางการซึ่งการเดิมพันทั้งหมดจะได้รับการตัดสิน การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันในภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.29.1.3
                            <br /> การเดิมพันทั้งหมดจะถือว่าสมบูรณ์ถ้าการแข่งขันหรือการแข่งขันเสร็จสิ้นภายในระยะเวลาอย่างเป็นทางการของการแข่งขันกีฬาโอลิมปิกโดยไม่คำนึงถึงเวลาเริ่มต้นจริง
                            ๆ (ยกเว้นฟุตบอล) หากการแข่งขันหรือการแข่งขันไม่สมบูรณ์และไม่มีผลอย่างเป็นทางการเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.29.1.4
                            <br /> การเดิมพันใด ๆ ที่ได้รับการยอมรับว่าผิดพลาดหลังจากเหตุการณ์เริ่มต้นขึ้นจริง (ยกเว้นการเดิมพันสด) จะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.29.1.5
                            <br /> หากทีมหรือผู้แข่งขันไม่ได้เริ่มกิจกรรมใด ๆ การเดิมพันทั้งหมดที่ถูกวางลงในการเลือก (รวมถึงตลาดอย่างสมบูรณ์ (เพื่อชนะเหรียญทอง))
                            จะถือเป็นโมฆะและจะได้รับการคืนเงิน หากทีมที่ตั้งชื่อหรือคู่แข่งในตลาด Money Line (head to head) ไม่เริ่มเล่นการแข่งขันการเดิมพันทั้งหมดในตลาดนั้นจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.29.1.6
                            <br /> ถ้าความตายเกิดขึ้นในทันที (เพื่อชนะเหรียญทอง) ตลาดแล้วครึ่งหนึ่งของเงินเดิมพันจะถูกนำไปใช้กับการเลือกแบบเต็มจำนวนในขณะที่อีกครึ่งหนึ่งของจำนวนเงินเดิมพันจะหายไป
                            ถ้าความร้อนที่เกิดขึ้นในตลาด Money Line (Head to Head) ผลที่ได้ก็คือการผูกและเดิมพันกับคู่แข่งทั้งสองจะได้รับการคืนเงิน
                            <br /> 3.30
                            <br /> แล่นเรือใบ
                            <br /> 3.30.1
                            <br /> ถ้วยอเมริกา (รวมทั้ง Louis Vuitton Cup)
                            <br /> 3.30.2
                            <br /> ตลาดทั้งหมดจะตัดสินตามผลการแข่งขันอย่างเป็นทางการที่เว็บไซต์ทางการประกาศหลังจากการแข่งขันแต่ละครั้ง การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันที่ตามมาจะไม่ได้รับการพิจารณาเพื่อการเดิมพัน
                            <br /> 3.30.3
                            <br /> หากการแข่งขันถูกเลื่อนออกหรือยกเลิกการเดิมพันทั้งหมดถือเป็นที่ถูกต้องหากการแข่งสิ้นสุดลงภายใน 48 ชั่วโมงหมดอายุ
                            <br /> 3.31
                            <br /> การเมือง
                            <br /> 3.31.1
                            <br /> การเลือกตั้งประธานาธิบดีสหรัฐฯ
                            <br /> 3.31.1.1
                            <br /> พรรคการเมืองใดจะเป็นผู้ชนะการเลือกตั้งประธานาธิบดีสหรัฐฯปี 2012? ชื่อผู้สมัครได้รับการอ้างอิงเท่านั้น พรรครีพับลิกันและพรรคเดโมแครตไม่ควรชนะการเลือกตั้งแล้วการเดิมพันทั้งหมดจะเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.32
                            <br /> ขี่จักรยาน
                            <br /> 3.32.1
                            <br /> ตลาดทั้งหมดจะตัดสินตามผลการแข่งขันอย่างเป็นทางการที่เว็บไซต์ทางการประกาศหลังจากการแข่งขันแต่ละครั้ง การตัดสิทธิ์หรือการแก้ไขผลการแข่งขันที่ตามมาจะไม่ได้รับการพิจารณาเพื่อการเดิมพัน
                            <br /> 3.32.2
                            <br /> หากการแข่งขันถูกเลื่อนออกหรือยกเลิกการเดิมพันทั้งหมดถือเป็นที่ถูกต้องหากแข่งสิ้นสุดลงภายในระยะเวลา 24 ชั่วโมง
                            <br /> 3.32.3
                            <br /> ในการแข่งขัน Head to Head ทั้งสองนักแข่งต้องเริ่มต้นการแข่งขันเพื่อให้การเดิมพันถูกต้อง นักแข่งที่มีตำแหน่งการตกแต่งที่ดีกว่าจะได้รับการประกาศให้เป็นผู้ชนะ
                            หากทั้งสองนักแข่งไม่สามารถจบเกมการเดิมพันจะถูกประกาศเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.33
                            <br /> ตะกร้า Sepak
                            <br /> 3.33.1
                            <br /> ตลาด Moneyline หมายถึงผู้ชนะของการแข่งขันหรือชุดที่ระบุ ตลาดแฮนดิแคปขึ้นอยู่กับชุดหรือจุด (โปรดดูชื่อเรื่องการตลาด)
                            สูง / ต่ำกว่าและต่ำ / ต่ำกว่าตลาดตามจุด (เว้นแต่ระบุไว้เป็นอย่างอื่น)
                            <br /> 3.33.2
                            <br /> หากทีมใดเกษียณหรือถูกตัดสิทธิ์ในระหว่างการแข่งขันการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.33.3
                            <br /> หากการแข่งขันถูกเลื่อนออกไปหรือถูกระงับการเดิมพันทั้งหมดจะถือว่าถูกต้องหากการแข่งขันดำเนินต่อก่อนหมดอายุ 12 ชั่วโมง
                            <br /> 3.33.4
                            <br /> ผู้ชนะในเซ็ตแรก (Second, Third Set Winner ฯลฯ ) หมายถึงผลของชุดที่ระบุ การเดิมพันทั้งหมดจะถือเป็นโมฆะถ้าชุดที่ระบุไม่สมบูรณ์
                            <br /> 3.33.5
                            <br /> คะแนนจะไม่ได้รับการอัปเดตสำหรับการเดิมพันแบบสดของ Sepak Takraw
                            <br /> 3.34
                            <br /> อัตราเดิมพันคงที่ของสหราชอาณาจักร / ไอริช Head to Head
                            <br /> 3.34.1
                            <br /> หากการแข่งขันไม่เริ่มต้นในวันที่กำหนดการเดิมพันทั้งหมดจะเป็นโมฆะ
                            <br /> 3.34.2
                            <br /> ม้าทั้งสองจะต้องเริ่มการแข่งขัน หากม้าตัวใดตัวหนึ่งหรือทั้งสองฝ่ายถือว่าไม่ใช่นักวิ่ง / รอยขีดข่วนการเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.34.3
                            <br /> หากการเดิมพันได้รับการยอมรับเนื่องจากความผิดพลาดหลังจากที่การแข่งขันเริ่มขึ้นการวางเดิมพันดังกล่าวจะเป็นโมฆะและจะได้รับการคืนเงิน
                            <br /> 3.34.4
                            <br /> ม้าที่มีการวางตำแหน่งที่ดีขึ้นในการแข่งขันจะได้รับการประกาศให้เป็นผู้ชนะ ถ้าม้าคนใดคนหนึ่งไม่จบการแข่งขันผู้อื่นจะได้รับการประกาศให้เป็นผู้ชนะ
                            <br /> 3.34.5
                            <br /> ม้าทั้งสองข้างไม่สามารถจบการแข่งขันได้การเดิมพันทั้งหมดจะถือเป็นโมฆะ
                            <br /> 3.34.6
                            <br /> หากมีการประกาศความตายระหว่างสองม้าในหัวเพื่อหัวการเดิมพันทั้งหมดจะได้รับการคืนเงิน
                            <br /> 3.34.7
                            <br /> ผลการตัดสินจะถูกตัดสินเมื่อมีการประกาศ "ชั่งน้ำหนัก" หรือ "ทั้งหมดชัดเจน" และประกาศผลอย่างเป็นทางการ
                            <br /> 3.34.8
                            <br /> คำว่า "ฟิลด์" หมายถึงม้าทั้งหมดที่ไม่ใช่ม้าที่มีชื่ออยู่ในหัวเพื่อมุ่งหน้า
                            <br /> 3.35
                            <br /> Esports
                            <br /> 3.35.1
                            <br /> Moneyline หมายถึงทีมหรือผู้แข่งขันรายย่อยที่แพ้อีกฝ่ายหนึ่งหรือสูงกว่าในการแข่งขัน การจับคู่ตลาดที่ชนะเลิศหมายถึงจำนวนแผนที่
                            <br /> 3.35.2
                            <br /> ผู้ชนะการแข่งขันหมายถึงทีมที่ชนะหรือผู้แข่งขันรายบุคคลในรอบชิงชนะเลิศของการแข่งขัน esports
                            <br /> 3.35.3
                            <br /> ตลาดทั้งหมดจะได้รับการตัดสินตามผลการตัดสินอย่างเป็นทางการที่ประกาศโดยสมาคมหนังสือเดินทางที่เกี่ยวข้องหรือหน่วยงานที่จัดให้มีขึ้นในเว็บไซต์อย่างเป็นทางการ
                            การตัดสิทธิ์หรือการเปลี่ยนแปลงผลการแข่งขันในภายหลังจะไม่ได้รับการพิจารณาเพื่อวัตถุประสงค์ในการเดิมพัน
                            <br /> 3.35.4
                            <br /> หากมีการเลื่อนการแข่งขันขึ้นการเดิมพันทั้งหมดจะยังคงมีผลถ้าการแข่งขันเริ่มต้นใหม่ภายใน 48 ชั่วโมงจากกำหนดการเดิม
                            <br /> 3.35.5
                            <br /> หากการแข่งขันเริ่มขึ้นและมีการประกาศผลอย่างเป็นทางการการเดิมพันทั้งหมดถือว่าสมบูรณ์โดยไม่คำนึงถึงการไม่สามารถเล่นได้การตัดการเชื่อมต่อของผู้เล่นหรือการขัดจังหวะการใช้พลังงาน
                            หากการจับคู่ไม่เริ่มต้นขึ้นหรือการเริ่มต้นการจับคู่ แต่ไม่เสร็จสมบูรณ์และไม่มีการประกาศผลอย่างเป็นทางการการเดิมพันทั้งหมดจะเป็นโมฆะยกเว้นการเดิมพันที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            <br /> 3.35.6
                            <br /> หากการแข่งขันถูกเล่นซ้ำเนื่องจากการตัดการเชื่อมต่อผู้เล่นหรือการหยุดชะงักของการเล่นการเดิมพันทั้งหมดจะถือเป็นโมฆะยกเว้นการเดิมพันที่อยู่ในตลาดที่ได้รับการกำหนดโดยไม่มีเงื่อนไข
                            ในกรณีที่มีการเล่นซ้ำการเล่นซ้ำใหม่จะถือเป็นตลาดที่แยกต่างหากและใหม่
                            <br /> 3.35.7
                            <br /> หากจำนวนรอบ / แผนที่เปลี่ยนแปลงจากตารางเดิมแฮนดิแค็ปและการเดิมพันสูง / ต่ำจะถือเป็นโมฆะขณะที่การวางเดิมพันไลน์ไลน์จะถือว่าถูกต้อง
                            <br /> 3.35.8
                            <br /> First Blood markets หมายถึงทีมที่ฆ่าก่อน ฆ่าโดยฝ่ายตรงข้าม / ผู้เล่นเท่านั้น
                            <br /> 3.35.9
                            <br /> First Tower / Turret หมายถึงทีมที่ใช้หอคอย / ป้อมปืนเป็นอันดับแรก การเดิมพันมีผลแม้ว่าจะถูกทำลายโดยการคืบหรือถูกปฏิเสธ
                            <br /> 3.35.10
                            <br /> First Ten (10) Kill markets refer to the team which is first to record ten kills.
                            <br /> 3.35.11
                            <br /> First Roshan/Baron markets refer to the team which kills the most powerful neutral creep first.
                            <br /> 3.35.12
                            <br /> Kills markets (Moneyline, Handicap, Over/Under & Odd/Even) refer to the number of kills made by a team or individual
                            competitor by the time that the game has officially ended. If a team surrenders before the end of a match then all
                            kills that place after the surrender call count towards this market. NB Kills from towers and team creeps count towards
                            the official total as shown on the scoreboard. Deaths from denies, suicides and neutral creeps do not count towards
                            the official total.
                            <br /> 3.35.13
                            <br /> Round Winner Markets refers to the official winner of the round or group of rounds. This applies for games where
                            the map is divided into separate rounds only.
                            <br /> 3.35.14
                            <br /> Player Kills markets refer to the total number of kills by a specific player for a specific Match, map or round.
                            <br /> 3.35.15
                            <br /> Counter Strike Moneyline, Handicap,Over/Under & Odd/Even markets refer to the number of rounds won and will be settled
                            on the final result including overtime (unless otherwise stated)
                            <br /> 3.36
                            <br /> Muay Thai
                            <br /> 3.36.1
                            <br /> Red or Blue color of fighters is strictly for reference purposes only. All bets will be considered valid regardless
                            the color change of the fighters.
                            <br /> 3.36.2
                            <br /> Handicap markets refer to the winner of the fight. All bets on Handicap markets will be void of the fight is declared
                            a draw.
                            <br /> 3.36.3
                            <br /> Over/Under markets refer to the number of rounds which have been completed in the fight. Therefore, if a fight ends
                            in round 5 then the number of completed rounds is four. If the fight is decided by the judges then the number of
                            completed rounds is five.
                            <br /> 3.36.4
                            <br /> If one or both fighters are disqualified by the judges then all bets will be declared void.
                            <br /> 3.36.5
                            <br /> If a fight is postponed and not started within twelve hours of the scheduled start time then all bets are considered
                            void.
                            <br /> 3.36.6
                            <br /> A fight is deemed to have started when the bell is sounded for the beginning of the first round. If one, or both,
                            fighters should fail to start the fight then all bets will be void.
                            <br /> 3.36.7
                            <br /> All bets will be settled on the official decision given in the ring immediately after the fight. Subsequent changes
                            to the result are not recognized for betting purposes.
                            <br /> 3.37
                            <br /> Entertainment
                            <br /> 3.37.1
                            <br /> Sing! China – Which team/player will advance furthest in the show.
                            <br />
                            <br /> • Two teams/players will be paired for betting selection, teams/players belonging to different groups may also be
                            paired for betting selection.
                            <br />
                            <br /> • If the two teams/players paired for betting selection qualify for the next stage, then all bets for both teams/players
                            will be carried over to the succeeding stage.
                            <br />
                            <br /> • Bets will be considered as draw if the two teams/players are eliminated at the same stage.
                            <br /> 3.38
                            <br /> Number Game Betting Rules and Regulations
                            <br /> 3.38.1
                            <br /> Basic concept
                            <br /> 3.38.1.1
                            <br /> This game is played by betting on the numbers of the balls drawn from a bingo machine
                            <br /> 3.38.1.2
                            <br /> The Company will provide real time odds on the random draw of balls. You may place your bets based on such odds,
                            in a variety of bet types as explained below.
                            <br /> 3.38.2
                            <br /> Bet Types
                            <br /> 3.38.2.1
                            <br /> Generally, two types of betting will be available for the Number Game.
                            <br /> (A) Pre-Games - ผู้เล่นสามารถวางเดิมพันได้ก่อนที่เกมจะเริ่มต้น แต่เมื่อเกมเริ่มต้นการเดิมพันจะไม่ได้รับอนุญาต
                            <br /> (B) การวิ่งเกม - ผู้เล่นสามารถวางเดิมพันหลังจากเกมเริ่มต้นและอัตราเดิมพันจะแตกต่างกันไปสำหรับทุกๆลูก
                            <br /> 3.38.2.2
                            <br /> ประเภทของการเล่น pregame มีดังนี้
                            <br /> (A) เหนือ / ใต้ลูกแรกหรือลูกสุดท้ายที่วาด
                            <br /> (B) คี่ / คู่, ลูกแรกหรือลูกสุดท้ายที่วาด
                            <br /> (C) คี่ / คู่ (FT) (รวมสามลูกที่วาด)
                            <br /> (D) นักรบเทียบลูกที่สองหรือวาดลูกที่สาม
                            <br />
                            <br /> "ลูกบอลล่าสุดที่ดึงมา" หมายถึงจำนวนลูกลูกบิงโกที่ถูกจัดเตรียมไว้ล่วงหน้า การเดิมพันทั้งหมดในลูกที่ผ่านมาจะถือว่าเป็นโมฆะและการเดิมพันทั้งหมดในลูกที่ผ่านมาจะได้รับการคืนเงิน
                            <br />
                            <br /> การจ่ายเงินทำได้เฉพาะในเกมที่สมบูรณ์ เกมที่สมบูรณ์แบบเป็นเกมที่ลูกสุดท้ายถูกดึงออกมาโดยไม่เกิดข้อผิดพลาดขึ้นไปถึงจุดนั้น
                            ในกรณีที่เกิดข้อผิดพลาด บริษัท ขอสงวนสิทธิ์ในการยกเลิกเกมและคืนเงินเดิมพัน
                            <br /> 3.38.2.3
                            <br /> สูง / ต่ำ, ลูกแรกวาดหรือดึงบอลล่าสุด
                            <br /> บริษัท จะเสนออัตราเดิมพันกับจำนวนลูกที่ 1 หรือลูกสุดท้ายที่ถูก "เหนือ" หรือ "ใต้"
                            <br /> มากกว่า 1 / สุดท้ายบอลหมายเลข 38 ถึง 75 ถือเป็นลูก Over
                            <br /> ภายใต้ลูกที่ 1 / ครั้งสุดท้าย - บอลหมายเลข 1 ถึง 37 ถือว่าเป็นลูกใต้
                            <br /> ตัวอย่าง: ลูกบอลหมายเลข 30 ถูกวาดเป็นลูกสุดท้ายในระหว่างเกมดังนั้นการเดิมพัน 'Under' จะชนะ
                            <br /> 3.38.2.4
                            <br /> คี่ / คู่, ลูกแรกหรือลูกสุดท้ายที่วาด
                            <br /> บริษัท จะให้อัตราเดิมพันกับจำนวนลูกที่ 1 หรือลูกสุดท้ายที่ถูก "คี่" หรือ "คู่"
                            <br />
                            <br /> แปลก - ลูกบิงโกนับเป็นตัวเลขที่ถือว่าเป็นลูกบอลแปลก ๆ
                            <br /> แม้กระทั่งลูกบอลบิงโกที่มีเลขคู่ถือเป็นลูก Even
                            <br /> ตัวอย่าง: ลูกบอลหมายเลข 30 ถูกวาดเป็นลูกแรกในระหว่างเกมดังนั้นการเดิมพัน 'Even' จะชนะ
                            <br /> 3.38.2.5
                            <br /> คี่ / คู่, ลูกแรกหรือลูกสุดท้ายที่วาด
                            <br /> บริษัท จะเสนอราคาต่อรองของลูกบอลสามใบที่เป็นเลขคี่หรือคู่
                            <br /> Odd (FT) - ผลรวมของสามลูกที่วาดเป็นเลขคี่
                            <br /> Even (FT) - ผลรวมของสามลูกที่วาดเป็นจำนวนคู่
                            <br /> ตัวอย่าง: ลูกบอลหมายเลข 07, 13 และ 20 จะถูกวาดขึ้นและผลรวมของตัวเลขของลูกบอลเหล่านี้คือ 40 40 คือจำนวนคู่ดังนั้นการเดิมพัน
                            "Even (FT)" จะชนะ
                            <br /> 3.38.2.6
                            <br /> นักรบเทียบลูกที่สองหรือวาดลูกที่สาม
                            <br /> 3.38.2.6.1
                            <br /> หมายเลข 1 จะเป็นตัวเลขที่ต่ำที่สุดและ 75 จะเป็นตัวเลขสูงสุด
                            <br /> 3.38.2.6.2
                            <br /> บริษัท จะเสนออัตราเดิมพันสำหรับประเภทการเดิมพันนี้ก่อนที่ลูกที่ 1 จะถูกดึงออกมา ผู้เล่นอาจวางเดิมพันได้ตลอดเวลา
                            แต่ก่อนที่ลูกที่ 1 จะวาดขึ้น
                            <br /> ตัวอย่าง: ถ้าลูกที่ 2 วาดเป็นหมายเลข 45 และลูกที่ 3 ที่วาดเป็นเลข 60 แล้วผู้เล่นที่เดิมพันบอลที่ 3 จะเป็นผู้ชนะในเกม
                            <br /> 4.
                            <br /> กฎกีฬาเสมือนจริง
                            <br /> 4.1
                            <br /> ทั่วไป
                            <br /> 4.1.1
                            <br /> เกมกีฬาเสมือนเป็นการสร้างผลงานที่สร้างขึ้นโดยคอมพิวเตอร์สำหรับผลการสุ่มจับภาพโดยสุ่มเลือกทีมที่จะชนะการแข่งขันหรือการแข่งขันหรือผู้เข้าแข่งขันคนใดคนหนึ่งเป็นอันดับที่สองในสามและอื่น
                            ๆ ในการแข่งขันหรือการแข่งขัน ผลการแข่งขันการแข่งขันหรือกิจกรรมถูกควบคุมโดยเครื่องกำเนิดตัวเลขสุ่ม (Random Number
                            Generator - RNG) ที่ทดสอบโดย บริษัท ทดสอบที่ได้รับการรับรองอย่างเป็นอิสระ
                            <br /> 4.1.2
                            <br /> เมื่อใดก็ตามที่เกี่ยวข้องการเดิมพันกีฬาเสมือนจะถูกควบคุมโดยกฎเดียวกันสำหรับการวางเดิมพันในกิจกรรมกีฬาจริง
                            <br /> 4.1.3
                            <br /> กีฬาเสมือนเป็นการออกอากาศเกม สมาชิกทุกคนที่เดิมพันในการแข่งขันการแข่งขันหรือการแข่งขันเดียวกันจะได้รับผลลัพธ์เช่นเดียวกัน
                            <br />
                            <br /> 4.1.4
                            <br /> ในกรณีที่คอมพิวเตอร์ทำงานผิดพลาดทางอิเล็กทรอนิกส์หรืออื่น ๆ ที่ขัดขวางการนำเสนอการแข่งขันการแข่งขันหรือการแข่งขันการเดิมพันในการแข่งขันการแข่งขันหรือการแข่งขันจะเป็นโมฆะ
                            <br />
                            <br /> 4.1.5
                            <br /> แม้ว่าข้อมูลคำติชมในการแข่งขันการแข่งขันหรือกิจกรรมจะไม่ตรงกันกับวิดีโอสตรีมเสมือนก็ตามการเดิมพันทั้งหมดจะยังคงใช้ได้
                            <br /> 4.1.6
                            <br /> ในกรณีที่การแข่งขันการแข่งขันหรือการแข่งขันไม่เริ่มต้นหรือไม่เสร็จสิ้นและไม่สามารถตัดสินผลได้การแข่งขันการแข่งขันหรือการแข่งขันจะเป็นโมฆะ
                            การเดิมพันจะได้รับการคืนเงินตามกฎการเดิมพันนี้
                            <br /> 4.1.7
                            <br /> การเดิมพันที่ยอมรับในการแข่งขันในอนาคตการแข่งขันเหตุการณ์สัปดาห์หรือฤดูกาลจะยืนได้แม้ว่าสมาชิกจะล็อกเอาต์จากเว็บไซต์
                            <br /> 4.2
                            <br /> ฟุตบอลเสมือนจริง
                            <br /> 4.2.1
                            <br /> ฟุตบอลเสมือนหมายถึงการเดิมพันผลของการสุ่มหมายเลขที่สร้างการแข่งขันหรือการแข่งขันฟุตบอล RNG จะตัดสินผลของการแข่งขันหรือเหตุการณ์โดยใช้การให้คะแนนของระบบสำหรับแต่ละทีม
                            มีห้า (5) สระว่ายน้ำของทีมให้เลือกตั้งแต่ระดับนานาชาติถึงมาตรฐานระดับสโมสร ทีมสองทีม (2) จะแข่งขันในแต่ละเกม
                            <br /> 4.2.2
                            <br /> มีหกประเภทการเดิมพันสำหรับฟุตบอลเสมือนจริง:
                            <br />
                            <br /> 1. 2x2
                            <br /> 2. แก้ไขคะแนน
                            <br /> 3. จำนวนเป้าหมายทั้งหมด
                            <br /> 4. Double Chance
                            <br /> 5. ตาม / มากกว่า 2.5 จำนวนเป้าหมาย
                            <br /> 6. แฮนดิแค็ปเอเชีย
                            <br /> 4.2.3
                            <br /> การแข่งขันหรือการแข่งขันแต่ละครั้งเกิดขึ้นในสภาพที่มีแดดประมาณหกสิบ (60) วินาที ไฮไลต์รีลที่มีการพยายามทำเป้าหมาย
                            4 ครั้งจะแสดงขึ้นในแต่ละจุดซึ่งจะส่งผลให้เป้าหมาย eithera Miss หรือ Save
                            <br /> 4.2.4
                            <br /> การแข่งขันหรือเหตุการณ์แต่ละรายการจะเริ่มต้นด้วยการแนะนำซึ่งจะแสดงรายชื่อทีมทั้งสอง (2) และราคาที่สอดคล้องกันของประเภทการเดิมพันที่เสนอ
                            <br /> 4.2.5
                            <br /> การเดิมพันสำหรับการแข่งขันหรือการแข่งขันใด ๆ จะไม่ได้รับการยอมรับหลังจากการแจ้งเตือนการเตะออก การเดิมพันใด ๆ ที่ยอมรับโดยผิดพลาดหลังจากเตะจะเป็นโมฆะและถูกส่งคืน
                            <br /> 4.2.6
                            <br /> เมื่อการจับคู่หรือการแข่งขันเสร็จสิ้นลงการ์ดแสดงผลการแข่งขันจะปรากฏขึ้นโดยแสดงเส้นคะแนนและผลชนะสำหรับแต่ละประเภทการเดิมพัน
                            <br /> 4.2.7
                            <br /> หลังจากมีการแสดงผลของการจับคู่หรือเหตุการณ์การแข่งขันหรือเหตุการณ์ต่อไปจะมีขึ้น ผลของการจับคู่หรือเหตุการณ์แต่ละครั้งจะปรากฏในเว็บไซต์เป็นระยะเวลา
                            <br /> 4.3
                            <br /> การแข่งม้าเสมือนจริง
                            <br /> 4.3.1
                            <br /> การแข่งม้าแบบเสมือนหมายถึงการเดิมพันผลการแข่งขันแบบสุ่มที่สร้างการแข่งม้าหรือเหตุการณ์
                            <br /> 4.3.2
                            <br /> มีห้าประเภทการเดิมพันสำหรับการแข่งม้าเสมือนจริง:
                            <br />
                            <br /> 1. ชนะ
                            <br /> 2. สถานที่
                            <br /> 3. ชนะ / สถานที่
                            <br /> 4. พยากรณ์
                            <br /> 5. ไตรลักษณ์
                            <br /> 4.3.3
                            <br /> จำนวนม้าสามารถแตกต่างกันไปในแต่ละเผ่าพันธุ์หรือเหตุการณ์ซึ่งจัดขึ้นในทั้งแบบแบนร่อนหรือวิ่งเร็วในสภาวะที่มีแดดมืดทึบและกลางคืน
                            <br /> 4.3.4
                            <br /> โดยไม่ต้องคำนึงถึงจำนวนม้าที่วิ่งคำว่า Each Way สำหรับการแข่งม้าเสมือนเป็นราคาตลาดในตลาดที่ 1, 2, 3
                            <br /> 4.3.4.1
                            <br /> เมื่อวิ่ง 8-11: วางเดิมพันในตลาดที่ 1, 2, 3
                            <br /> 4.3.4.2
                            <br /> วิ่ง 12-15: วางราคาตลาดในตลาดที่ 1, 2, 3
                            <br /> 4.3.4.3
                            <br /> เมื่อวันที่ 16 นักวิ่ง: วางราคาตลาดใน 1, 2, 3, 4
                            <br /> 4.3.5
                            <br /> การแข่งขันแต่ละครั้งหรือเหตุการณ์เริ่มต้นด้วยการแนะนำการแสดงรายชื่อของม้าทั้งหมดรวมถึงตัวเลขและราคาของตัวเอง
                            <br /> 4.3.6
                            <br /> การแข่งขันหรือการแข่งขันแต่ละครั้งจะอยู่ระหว่าง 30 วินาทีและ 45 วินาที
                            <br /> 4.3.7
                            <br /> เมื่อการแข่งขันหรือการแข่งขันเสร็จสิ้นการเล่นใหม่ของม้าที่ข้ามเส้นจะแสดงพร้อมด้วยการแสดงผลของผู้เล่นที่สำเร็จ 3
                            หรือ 4 อันดับสุดท้าย
                            <br /> 4.3.8
                            <br /> หลังจากมีการแสดงผลการแข่งขันหรือการแข่งขันแล้วจะมีการเปิดการแข่งขันหรือการแข่งขันครั้งต่อไป ผลของการแข่งขันแต่ละครั้งหรือเหตุการณ์จะปรากฏในเว็บไซต์เป็นระยะ
                            ๆ
                            <br /> 4.4
                            <br /> การแข่งรถเกรย์ฮาวด์เสมือน
                            <br /> 4.4.1
                            <br /> เกรย์ฮาวด์เสมือนจริงหมายถึงการเดิมพันผลการแข่งขันแบบ greyhounds หรือเหตุการณ์แบบสุ่ม
                            <br /> 4.4.2
                            <br /> มีห้าประเภทการเดิมพันสำหรับ greyhounds เสมือนแข่ง:
                            <br />
                            <br /> 1. ชนะ
                            <br /> 2. สถานที่
                            <br /> 3. ชนะ / สถานที่
                            <br /> 4. พยากรณ์
                            <br /> 5. ไตรลักษณ์
                            <br /> 4.4.3
                            <br /> มีแปด (8) เกรย์ฮาวด์ในแต่ละการแข่งขันหรือการแข่งขันที่จัดขึ้นในแทร็กแบบแบนหรือแบบกระโดดในสภาวะที่มีแดดมืดทึบและกลางคืน
                            <br /> 4.4.4
                            <br /> คำว่า Each Way สำหรับการแข่งขันสุนัขไล่เนื้อชนิดหนึ่งเป็นอัตราเดิมพันของตลาดที่ 1, 2, 3
                            <br /> 4.4.5
                            <br /> การแข่งขันแต่ละครั้งหรือเหตุการณ์เริ่มต้นด้วยการแนะนำการแสดงรายชื่อของ greyhounds ทั้งหมดและตัวเลขและราคาของตน
                            <br /> 4.4.6
                            <br /> การแข่งขันหรือการแข่งขันแต่ละครั้งจะอยู่ระหว่าง 30 วินาทีและ 45 วินาที
                            <br /> 4.4.7
                            <br /> เมื่อการแข่งขันหรือการแข่งขันเสร็จสิ้นการเล่นใหม่ของ greyhound ที่ข้ามเส้นจะแสดงขึ้นพร้อมด้วยการแสดงผลของผู้เล่น
                            3 อันดับแรก
                            <br /> 4.4.8
                            <br /> หลังจากมีการแสดงผลการแข่งขันหรือการแข่งขันแล้วจะมีการเปิดการแข่งขันหรือการแข่งขันครั้งต่อไป ผลของการแข่งขันแต่ละครั้งหรือเหตุการณ์จะปรากฏในเว็บไซต์เป็นระยะ
                            ๆ
                            <br /> 4.5
                            <br /> เทนนิสเสมือน
                            <br /> 4.5.1
                            <br /> เทนนิสเสมือนหมายถึงการเดิมพันผลของการสุ่มหมายเลขที่สร้างการแข่งขันเทนนิสหรือกิจกรรม
                            <br /> 4.5.2
                            <br /> มีผู้เล่นสองคน (2) ในการแข่งขันเทนนิสหรือการแข่งขันซึ่งจัดขึ้นในสภาพสนามหญ้าในสภาพที่มีแดด
                            <br /> 4.5.3
                            <br /> มีสามประเภทการเดิมพันสำหรับเทนนิสเสมือน:
                            <br />
                            <br /> 1. Moneyline
                            <br /> 2. แก้ไขคะแนน
                            <br /> 3. คะแนนรวม
                            <br /> 4.5.4
                            <br /> การแข่งขันหรือการแข่งขันแต่ละครั้งจะเริ่มต้นด้วยการแนะนำการแสดงทั้งสองผู้เล่นและเสื้อและธงของตนผู้เล่นที่มีตัวบ่งชี้และราคาสำหรับแต่ละประเภทการเดิมพัน
                            <br /> 4.5.5
                            <br /> การแข่งขันหรือการแข่งขันแต่ละครั้งจะประกอบด้วยเกมเดียวที่มีคะแนนสูงสุด 12 (12) ที่อยู่ระหว่าง 30 วินาทีและ 120 วินาที
                            <br /> 4.5.6
                            <br /> หลังจากมีการแสดงผลของการจับคู่หรือเหตุการณ์การแข่งขันหรือเหตุการณ์ต่อไปจะมีขึ้น ผลของการแข่งขันแต่ละครั้งหรือเหตุการณ์จะปรากฏในเว็บไซต์เป็นระยะ
                            ๆ
                            <br /> 4.6
                            <br /> แข่งรถเสมือนจริง
                            <br /> Virtual Motor Racing การแข่งรถแต่ละครั้งจะใช้เวลาประมาณ 30 วินาที
                            <br />
                            <br /> 4.8.6
                            <br /> เมื่อการแข่งขันจบลงการเล่นใหม่ของจักรยานที่ข้ามเส้นจะปรากฏขึ้นตามด้วยการหยุดการตรึงภาพในบรรทัดและผลรวมถึงผู้ที่จบการแข่งขันสาม
                            (3)
                            <br />
                            <br /> 4.8.7
                            <br /> หลังจากมีการแสดงผลการแข่งขันแล้วจะมีการจัดงานแข่งรถครั้งต่อไป ผลลัพธ์ทั้งหมดจะปรากฏบนเว็บไซต์เป็นระยะ ๆ
                            <br /> 5.
                            <br /> คาสิโนสด
                            <br /> 5.1
                            <br /> กฎทั่วไป
                            <br /> 5.1.1
                            <br /> บริษัท มีสิทธิ์ในการเปลี่ยนแปลงระงับระงับลบแก้ไขหรือรีสตาร์ทเกมหรือการแข่งขันใด ๆ ใน Live Casino โดยถือว่าการเดิมพันถูกโจรกรรมปฏิเสธหรือยกเลิกการเดิมพันด้วยเหตุผล
                            เหตุการณ์บังเอิญกระทำของสงครามภัยธรรมชาติไฟฟ้าดับผิดพลาดของมนุษย์หรือความผิดพลาดหรือความประมาทโดย บริษัท หรือพนักงานของ
                            บริษัท ที่อยู่ในการละเมิดของมาตรฐานอุตสาหกรรมของการทำงานผิดพลาดของซอฟต์แวร์และเหตุการณ์อื่น ๆ ถือว่าเป็นเหตุสุดวิสัย
                            การตัดสินใจของ บริษัท ถือเป็นที่สิ้นสุดและเป็นผลผูกพันกับลูกค้า
                            <br /> 5.1.2
                            <br /> ผลเสมือนจริงหากมีสำหรับเกมคาสิโนสดทั้งหมดเป็นเพียงข้อมูลอ้างอิงเท่านั้นและจะไม่ถูกใช้เพื่อระบุผลของเกมคาสิโนสด
                            <br /> 5.1.3
                            <br /> ตัวจับเวลาการเดิมพันแสดงจำนวนเวลาที่ลูกค้าสามารถวางเดิมพันได้ ระยะเวลาในการจับเวลาจะเป็นไปตามที่ บริษัท กำหนด ลูกค้าจะไม่ได้รับอนุญาตให้วางเดิมพันหลังจากหมดอายุการจับเวลา
                            การวางเดิมพันหลังจากหมดอายุการจับเวลาจะถือว่าไม่ถูกต้องหรือเป็นโมฆะ
                            <br />
                            <br /> 5.1.4
                            <br /> ตัวจับเวลาการพนันอาจพบปัญหาทางเทคนิค การเดิมพันทั้งหมดที่วางไว้ในขณะที่ผู้จับเวลาเผชิญกับปัญหาทางเทคนิคอยู่ในความเสี่ยงของลูกค้าเองและ
                            บริษัท ฯ มีคำตัดสินขั้นสุดท้ายว่าจะยอมรับหรือปฏิเสธการเดิมพันดังกล่าวหรือไม่ การตัดสินใจของ บริษัท ถือเป็นที่สิ้นสุดและเป็นผลผูกพันกับลูกค้า
                            <br /> 5.1.5
                            <br /> ผลลัพธ์ที่แสดงรายการที่ไม่ถูกต้องเนื่องจากมีข้อผิดพลาดเกี่ยวกับการใช้ชีวิตจริงจะได้รับการแก้ไขตามสิ่งอำนวยความสะดวกในบันทึกวิดีโอของ
                            บริษัท การคำนวณการชนะ / ผลขาดทุนจะขึ้นอยู่กับผลการแก้ไขที่ได้รับการแก้ไขและการตัดสินใจของ บริษัท ถือเป็นที่สิ้นสุดและเป็นผลผูกพันกับลูกค้า
                            <br /> 5.1.6
                            <br /> ลูกค้ายอมรับว่าเกมมีความรวดเร็วและมักจะมีผลอย่างรวดเร็ว ในกรณีที่เกิดความแตกต่างระหว่างผลการแสดงภาพสตรีมมิ่งวิดีโอและผลการแข่งขันในเกมการเล่นเกมสด
                            บริษัท ขอสงวนสิทธิ์ที่จะใช้ผลของการเล่นเกมแบบสดเป็นผลสุดท้ายและการตัดสินใจของ บริษัท ถือเป็นที่สิ้นสุดและเป็นผลผูกพันกับลูกค้า
                            .
                            <br /> 5.1.7
                            <br /> บริษัท มีสิทธิ์ที่จะเปลี่ยนแปลงการไหลเวียน / ขั้นตอนการเล่นเกมในทุกสภาวะที่มีผลทันทีแม้จะมีการแจ้งสั้น ๆ เพื่อเพิ่มความเป็นธรรมและความโปร่งใสของเกม
                            การเปลี่ยนแปลงและการปรับปรุงกฎและข้อบังคับจะออกโดย บริษัท ในภายหลัง
                            <br /> 5.1.8
                            <br /> ในทุกสถานการณ์การตัดสินใจของ บริษัท ถือเป็นที่สิ้นสุดและเป็นผลผูกพันกับลูกค้า หากมีข้อโต้แย้งเกี่ยวกับการตีความหลักเกณฑ์การตีความหมายของ
                            บริษัท จะมีผลเหนือกว่า
                            <br /> 5.1.9
                            <br /> นอกเหนือจากกฎเหล่านี้แล้วกฎฉบับสมบูรณ์สามารถดูได้ที่นี่: กฎของคาสิโนสด
                            <br /> กลับสู่ด้านบน
                            <br /> 6.
                            <br /> กฎการวางเดิมพันของยักษ์ใหญ่เดิมพัน
                            <br /> 6.1
                            <br /> การวางเดิมพันของคุณ
                            <br /> 6.1.1
                            <br /> การยอมรับเดิมพัน
                            <br /> 6.1.1.1
                            <br /> ดาฟาเบ็ททำหน้าที่เป็นตัวแทนของ Colossus Bets และการเดิมพันทั้งหมด ("เดิมพัน") จะถูกวางลงในสระน้ำของ Colossus Bets
                            โดยตรงผ่านทางเว็บไซต์ดาฟาเบท ("Site") ในกรณีที่การเดิมพันไม่ถึงสระว่ายน้ำที่เกี่ยวข้องกับลูกค้าดาฟาเบท (“การเล่น”)
                            จะมีเงินเดิมพันของพวกเขาคืนเงินและไม่ดาฟาเบทมิได้เดิมพันยักษ์ใหญ่จะต้องรับผิดสำหรับความสูญเสียของเงินที่จะได้รับเนื่องจากมีเดิมพันถึงสระว่ายน้ำ
                            คำถามใด ๆ ที่คุณมีเกี่ยวกับกิจกรรมการเดิมพันของคุณในแอ็พพลิเคชันของ Colossus Bets ควรส่งถึงดาฟาเบท หากไม่สามารถแก้ปัญหาได้
                            Dafema จะติดต่อ Colossus Bets หากมีข้อขัดแย้งใด ๆ ระหว่างบทบัญญัติใด ๆ ในกฎการเดิมพันเหล่านี้และข้อกำหนดที่คล้ายกันในไซต์
                            colossusbets.com (คลิกที่นี่) จะมีการใช้ข้อกำหนดฉบับภาษาอังกฤษในไซต์ colossusbets.com
                            <br /> 6.1.1.2
                            <br /> คุณเป็นผู้รับผิดชอบในการตรวจสอบว่าคำแนะนำการเดิมพันที่คุณส่งมาถูกต้องก่อนที่จะยืนยันเดิมพัน Colossus Bets ขอสงวนสิทธิ์ในการปฏิเสธการวางเดิมพันใด
                            ๆ ไม่ว่าด้วยสาเหตุใด ๆ
                            <br /> 6.1.1.3
                            <br /> หากมีข้อขัดแย้งใด ๆ เกี่ยวกับรายละเอียดหรือสถานะของการเดิมพันหรือการเดิมพันบันทึกของ Colossus Bets จะเป็นแหล่งหลักฐานหลักสำหรับรายละเอียด
                            / สถานะของการเดิมพัน
                            <br />
                            <br /> 6.1.1.4
                            <br /> Colossus Bets อาจใช้ดุลพินิจ แต่เพียงผู้เดียวในการตัดสินใจระงับการเดิมพันในสระว่ายน้ำได้ตลอดเวลา ยักษ์ใหญ่เดิมพันยังขอสงวนสิทธิ์ในการยกเลิกสระว่ายน้ำทั้งหมดหรือขา
                            (s) หรือ (s) เดิมพัน: แก้ไขข้อผิดพลาดที่เห็นได้ชัด; เพื่อรักษาความซื่อสัตย์และความเป็นธรรมในสระว่ายน้ำยักษ์ใหญ่เดิมพัน;
                            ถ้ามีการเปลี่ยนแปลงรูปแบบหรือเหตุการณ์ภายในสระว่ายน้ำ หรือหากเชื่อว่าการเดิมพันใด ๆ ถูกวางไว้เป็นการฝ่าฝืนข้อกำหนดในการเล่นนี้
                            <br /> 6.1.2
                            <br /> การยอมรับเดิมพัน
                            <br /> 6.1.2.1
                            <br /> ผู้เล่นวางเดิมพันผลของเหตุการณ์ที่เกี่ยวข้องหลายอย่างซึ่งก่อนหน้านี้ได้เลือกไว้โดย Colossus Bets ("ขา") และตัดสินใจผ่านช่วงเวลาที่กำหนด
                            ("ระยะเวลาเกม")
                            <br /> 6.1.2.2
                            <br /> ขาในช่วงเวลาใด ๆ ของเกมจะต้องถูกเลือกโดย Colossus Bets ตามดุลยพินิจของทีม
                            <br /> 6.1.2.3
                            <br /> ผู้เล่นอาจเลือกที่จะวางเดิมพันอย่างน้อยหนึ่งรายการโดยแต่ละทีมจะมีการเลือกอย่างน้อยหนึ่งทีมในแต่ละขา (เช่นอาร์เซนอลเอาชนะ
                            Aston Villa 2-1 ลิเวอร์พูลเพื่อเอาชนะนิวคาสเซิล 3-2 และเชลซีและเอฟเวอร์ตันเพื่อดึง 1- 1) การเดิมพันแต่ละครั้งจะถูกระบุด้วยหมายเลขอ้างอิงที่ไม่ซ้ำกันเมื่อยอมรับเดิมพัน
                            <br /> 6.1.2.4
                            <br /> สำหรับขาที่กำหนดใด ๆ ผู้เล่นอาจทำการเลือกผลการคัดเลือกอย่างน้อยหนึ่งรายการ ตัวอย่างเช่นถ้าคุณเลือก 3-1 และ 2-1 ในขา
                            1 และ 1-0 ในขาอื่น ๆ ทั้งหมดนี้ถือเป็นเดิมพันสองชุด (หรือสอง "เส้น") เดิมพันแต่ละใบมีค่าใช้จ่ายเต็มรูปแบบเช่น£ 2
                            สำหรับผู้เล่นที่มีบัญชี Dafabet Player Account) จะเป็นสกุลเงินสเตอร์ลิง (GBP) และเครื่องมือวางเดิมพันของ Colossus
                            Bets จะเพิ่มจำนวนเส้นคูณด้วยจำนวนหุ้นที่ถือต่อ Line เพื่อแสดงจำนวนเงินเดิมพันทั้งหมดที่เดิมพันของคุณ
                            <br /> 6.1.2.5
                            <br /> การเดิมพันฟุตบอลอเมริกันจะวางไว้สำหรับผลรวมถึงช่วงเวลาทำงานล่วงเวลาทั้งหมดและหากผลการแข่งขันฟุตบอลอเมริกันในรอบหลังจากที่ทำงานล่วงเวลาในจุดที่ถูกต้องขอบสระว่ายน้ำจุดต่ำสุดขอบชนะสำหรับทีมที่บ้านและทีมเยือนจะถูกตัดสินว่าตาย
                            - ความร้อนที่ชนะการเลือก เว้นแต่ที่ระบุไว้เป็นอย่างอื่นเดิมพันทั้งหมดในกีฬาชนิดอื่น ๆ จะถูกนำไปวางไว้เพื่อให้ได้ผลลัพธ์ที่ถูกต้องในการเล่นตามปกติรวมทั้งเวลาหยุดการแข่งขัน
                            แต่ไม่รวมเวลาพิเศษช่วงเวลาการลงโทษหรือจุดโทษที่คล้ายกัน (ถ้าเกิดขึ้น)
                            <br/> 6.1.3
                            <br /> หน่วยเงินตราและสระน้ำ
                            <br /> 6.1.3.1
                            <br /> สกุลเงินหลักสำหรับสระว่ายน้ำทั้งหมดของยักษ์ใหญ่คือสเตอร์ลิง (GBP) ซึ่งหมายความว่าข้อมูลบางอย่าง (รวมถึง แต่ไม่ จำกัด
                            เฉพาะหน่วย Pool, ประวัติ Pool, Unit Distribution และ Winning Units) จะปรากฏบนเว็บไซต์ในรูปแบบ Sterling เท่านั้น อย่างไรก็ตามค่าที่เจาะจงสำหรับบัญชีของคุณรวมถึงรางวัลที่คุณกำลังเล่นตัวเลือกสัดส่วนการถือหุ้นและข้อเสนอพิเศษในการเบิกถอนเงินสดจะแสดงเป็นสกุลเงินของบัญชีของคุณ
                            <br /> 6.1.3.2
                            <br /> ในสระว่ายน้ำที่เฉพาะเจาะจงยักษ์ใหญ่เดิมพันให้ผู้เล่นเลือกที่จะวางเดิมพันในส่วนของค่าใช้จ่ายเต็มหน่วยที่กำหนดไว้สำหรับสระว่ายน้ำ
                            ตัวอย่างเช่นถ้าค่าใช้จ่ายเต็มหน่วยในสระว่ายน้ำคือ 2 ปอนด์ (เช่นเดียวกับใน Pick 7 Colossus Correct Score pool), Colossus
                            Bets อาจทำให้ผู้เล่นสามารถวางเดิมพันได้เป็นส่วนหนึ่งของค่าใช้จ่ายเต็มจำนวน 2 ปอนด์ การเดิมพันแบบเศษส่วนเช่นนี้จะให้สิทธิ์แก่ผู้เล่นในการจ่ายเงินปันผลให้แก่ผู้เล่นที่จุดชำระเงิน
                            ตัวอย่างเช่นถ้าผู้เล่นวางเดิมพัน 50 เพนนีในพูลที่มีต้นทุนต่อหน่วยเต็ม£ 2 ผู้เล่นจะได้รับส่วนแบ่งหนึ่งในสี่ (25%)
                            ของเงินปันผลที่จ่ายในสระนี้ (รวมถึงความสัมพันธ์ ไปที่ Bonus Pool ใด ๆ หากมี) ผู้เล่นที่เดิมพันด้วยสกุลเงินอื่น ๆ
                            นอกเหนือจากสเตอร์ลิงยังสามารถวางเดิมพันซึ่งเป็นส่วนหนึ่งของเงินเดิมพันในสกุลเงินท้องถิ่นทั้งหมดเพื่อสิทธิในการจ่ายเงินปันผลที่เกี่ยวข้องกัน
                            ตัวเลือกการเดิมพันที่มีให้กับผู้เล่นในสกุลเงินที่แตกต่างกันอาจแตกต่างกัน แต่ในทุกกรณีผู้เล่นจะมีสิทธิได้รับเงินปันผลซึ่งเป็นสัดส่วนกับต้นทุนของการเดิมพันของพวกเขาเท่านั้น
                            <br /> 6.1.3.3
                            <br /> การจ่ายเงินรางวัล (ยอดเงินรางวัลหรือยอดยกมา) ที่เกิดจากคุณจะถูกโอนไปยังบัญชีของคุณภายใต้กฎต่อไปนี้
                            <br /> A. บริษัท ฯ มีดุลยพินิจ แต่เพียงผู้เดียวในการกำหนดวิธีการจ่ายเงินรางวัลหรือเงินสดออกจากเครื่องเล่น
                            <br /> B. หากจำนวนเงิน 30,000 ดอลล่าร์หรือต่ำกว่าหรือเทียบเท่าในสกุลเงินที่แสดงอยู่ในบัญชีของผู้เล่นรวมค่าบริการ บริษัท
                            จะให้เครดิตการชนะของผู้เล่นหรือถอนเงินออกไปที่บัญชีของผู้เล่นโดยตรง
                            <br /> C. หากจำนวนเงินมากกว่า 30,000 ปอนด์หรือเทียบเท่าในสกุลเงินที่แสดงในบัญชีผู้เล่นรวมค่าบริการผู้เล่นควรติดต่อแผนกบริการลูกค้าของ
                            บริษัท เพื่อขอรับการตรวจสอบและข้อมูลเกี่ยวกับขั้นตอนการชนะ หรือเงินสดจะจ่าย บริษัท มีสิทธิ์ในการพิจารณาว่าจะจ่ายเงินให้แก่ผู้เล่นตามจำนวนเงินที่ได้รับหรือจำนวนเงินที่จ่ายออกไป
                            ผู้เล่นจะต้องรับผิดชอบค่าใช้จ่ายค่าโดยสารและที่พักถ้ามีในการอ้างสิทธิ์ในการชนะหรือเงินสดตามที่อธิบายไว้ในกฎข้อนี้.
                            <br /> D. ผู้เล่นจะเรียกร้องและเรียกเก็บเงินชนะหรือเงินสดภายในสาม (3) เดือนนับจากวันที่ได้รับการยืนยันเงินรางวัล บริษัท
                            มีดุลยพินิจในการพิจารณาว่าจะจ่ายเงินให้ผู้เล่นตามจำนวนเงินที่ได้รับหรือจำนวนเงินที่จ่ายออกไปและขอสงวนสิทธิ์ในการตัดสินใจเกี่ยวกับการชำระบัญชีเงินรางวัล
                            การตัดสินใจของ บริษัท ถือเป็นที่สิ้นสุดและมีผลผูกพันในเรื่องนี้
                            <br /> E. หาก Colossus Bets ล้มเหลวหรือปฏิเสธที่จะจ่ายเงินรางวัลของ Player หรือ Cash-out ผู้เล่นจะไม่สามารถเรียกเก็บเงินจาก
                            บริษัท ได้และการเรียกร้องทั้งหมดจะต้องถูกส่งตรงไปยัง Colossus Bets
                            <br /> F. ผู้เล่นรับผิดชอบค่าบริการธนาคารใด ๆ ที่ใช้กับการชำระเงินรางวัลหรือการถอนเงินสด การชำระเงินดังกล่าวจะกระทำกับผู้เล่นตามสกุลเงินของสกุลเงิน
                            GBP โดยใช้อัตราแลกเปลี่ยนระหว่างสกุลเงินที่ผู้เล่นเล่นสระว่ายน้ำยักษ์ใหญ่ที่เกี่ยวข้องและ GBP ด้วยอัตราดังกล่าวนับจากวันที่สระว่ายน้ำถูกโหลดโดย
                            Colossus Bets ลงในเว็บไซต์
                            <br /> G. เป็นความรับผิดชอบของ Player ในการทำบัญชีกับหน่วยงานด้านภาษีที่เกี่ยวข้องเกี่ยวกับการเก็บภาษีใด ๆ ที่อาจใช้กับกิจกรรมการพนันของผู้เล่นในเว็บไซต์
                            <br /> 6.1.4
                            <br /> การยุติการระงับการเลื่อนและข้อผิดพลาด
                            <br /> 6.1.4.1
                            <br /> ภายใต้บังคับแห่งบทบัญญัติอื่น ๆ ในข้อ 1 ด้านล่างการเดิมพันทั้งหมดจะตัดสินตามผลการแข่งขันอย่างเป็นทางการของเหตุการณ์ที่เกี่ยวข้องโดยไม่คำนึงถึงการถูกตัดสิทธิ์หรือการแก้ไขผลการแข่งขันที่ตามมา
                            <br /> 6.1.4.2
                            <br /> ในกรณีที่มีความไม่แน่นอนเกี่ยวกับผลการแข่งขันอย่างเป็นทางการ Colossus Bets ขอสงวนสิทธิ์ในการระงับการระงับการให้บริการของกลุ่มใด
                            ๆ จนกว่าความไม่แน่นอนจะได้รับการแก้ไขเพื่อความพึงพอใจที่เหมาะสม
                            <br /> 6.1.4.3
                            <br /> ยักษ์ใหญ่เดิมพันขอสงวนสิทธิ์ในการย้อนกลับการตั้งถิ่นฐานของสระว่ายน้ำหากได้รับการตัดสินด้วยความผิดพลาด (ตัวอย่างเช่นข้อผิดพลาดของมนุษย์หรือทางเทคนิค)
                            หาก Colossus Bets รีเซ็ตพูลให้ทำเช่นนี้อาจนำไปสู่การแก้ไขยอดคงเหลือในบัญชีของผู้เล่นเพื่อให้สอดคล้องกับการเปลี่ยนแปลงการตั้งถิ่นฐานของสระน้ำ
                            <br /> 6.1.4.4
                            <br /> แม้จะมีข้อตกลงใด ๆ ในข้อกำหนดในการเล่นนี้เมื่อพร็อพเพอร์ตี้ได้รับการตัดสินแล้วเป็นเวลา 72 ชั่วโมงข้อตกลงนี้จะถือว่าสมบูรณ์และเป็นที่สิ้นสุด
                            <br /> 6.1.4.5
                            <br /> หากการแข่งขันไม่สมบูรณ์ - เช่นการเล่นเต็มเวลา (เช่น 90 นาทีในกรณีของฟุตบอล) ตามที่เจ้าหน้าที่การแข่งขันรวมถึงเวลาหยุดการแข่งขัน)
                            ภายใน 3 วันนับจากวันที่เริ่มต้นการแข่งขันจะเป็นโมฆะ ขาสำหรับจุดประสงค์ของสระทั้งหมดที่มีการรวมไว้
                            <br /> 6.1.4.6
                            <br /> ถ้าการจับคู่เริ่มต้น แต่จะถูกยกเลิกหรือเลื่อนออกไปในภายหลัง แต่จะเสร็จสิ้นภายใน 3 วันนับจากวันที่เริ่มต้นที่กำหนดไว้จะถือว่าเป็นเลกที่ถูกต้องสำหรับทุกพูลที่รวมไว้
                            แต่จะไม่เริ่มต้นใหม่ตั้งแต่ต้น ถ้าการแข่งขันเริ่มต้นใหม่ตั้งแต่ต้นแล้วจะใช้ข้อ 1.17 ข้างต้น
                            <br /> 6.1.4.7
                            <br /> แม้ว่าจะมีบทบัญญัติของข้อ 1 ข้างต้นในกรณีที่ Colossus Bets เชื่อว่าการแข่งขัน (ไม่ว่าจะเป็นเริ่มต้นหรือไม่ก็ตาม)
                            จะไม่เสร็จสิ้นภายใน 3 วันนับจากวันที่เริ่มต้นการแข่งขัน Colossus Bets ขอสงวนสิทธิ์ในการประกาศการแข่งขันให้เป็น ถือเป็นโมฆะที่จุดนั้นเพื่อจุดประสงค์ของพูลที่เกี่ยวข้อง
                            (โดยไม่คำนึงว่าการจับคู่จะเสร็จสมบูรณ์หรือไม่ภายใน 3 วันนับจากวันที่เริ่มต้นที่กำหนดไว้)
                            <br /> 6.1.4.8
                            <br /> การระงับการเดิมพันหรือขาใด ๆ ที่อธิบายไว้ข้างต้นเกี่ยวกับการแข่งขันที่ถูกทอดทิ้ง / เลื่อนออกไปจะไม่ใช้กับการเดิมพัน
                            / ขาโดยไม่มีเงื่อนไขในเวลาที่ทำการยกเลิกหรือเลื่อนออกไป ตัวอย่างเช่นถ้า Colossus Bets เสนอขาขึ้นอยู่กับคะแนนที่ครึ่งหลังในการจับคู่การละทิ้งการจับคู่
                            ณ จุดใดก็ได้หลังจากจบครึ่งเวลาไม่เกี่ยวข้องกับความสมบูรณ์ของขาในคำถาม
                            <br /> 6.1.4.9
                            <br /> การอ้างอิงข้างต้นภายในข้อ 1 ถึงจำนวนวันที่ '' หมายถึงวันสิ้นสุดของเวลาตามเวลาท้องถิ่น (ที่มีการแข่งขัน) หลังจากหมดอายุจำนวนวันที่กำหนด
                            ตัวอย่างเช่นถ้าการจับคู่มีกำหนดจะแล้วเสร็จในวันที่ 15 พฤศจิกายนเมื่อมีการโหลดพูลในไซต์กฎที่ทำให้การจับคู่เสร็จสิ้นภายในสามวันหลังจากวันที่เสร็จสิ้นตามกำหนดเวลาจะหมายถึงวันครบกำหนดที่กำหนดให้เสร็จสิ้น
                            จะตรงกับเวลา 23.59: 59 ตามเวลาท้องถิ่นเมื่อวันที่ 18 พฤศจิกายน
                            <br /> 6.1.4.10
                            <br /> ค่าพลูใด ๆ ที่มีการตัดสินน้อยกว่าจำนวนขาที่โฆษณาแล้วพูลโบนัสและการค้ำประกันหรือการหมุนเวียนอื่น ๆ ที่ใช้บังคับกับสระจะถูกตัดทอน
                            ในกรณีดังกล่าวสระว่ายน้ำวินาศภัยและการจ่ายเงินปันผลจากการปลอบโยนจะขึ้นอยู่กับจำนวนเงินเดิมพันสุทธิที่ซื้อมาสำหรับสระว่ายน้ำเฉพาะรายนั้นแม้ว่า
                            บริษัท ยักษ์ใหญ่จะสงวนสิทธิ์ในการใช้การรับประกันทดแทนไปยังราคาพลูดังกล่าว
                            <br /> 6.1.4.11
                            <br /> จะมีการประกาศจ่ายเงินปันผลของ Win Pool อย่างน้อยหนึ่งเลกในสระ ถ้าไม่มีขาของสระว่ายน้ำจะเสร็จสิ้นเดิมพันทั้งหมดในสระว่ายน้ำนั้นจะเป็นโมฆะและเงินเดิมพันจะได้รับการคืนเงิน
                            ไม่รวมเงินเดิมพันที่หมุนเวียนจากสระก่อนหน้าซึ่งจะนำไปใช้ในสระน้ำในอนาคตตามที่ Colossus Bets กำหนด
                            <br /> 6.1.4.12
                            <br /> แม้ว่าจะมีเงื่อนไขตามข้อ 1.22 ข้างต้นก็ตามเท่าที่สระว่ายน้ำรวมถึงสระว่ายน้ำปลอบโยนเงินปันผลจะถูกประกาศให้เพียงพอสำหรับขาเพื่อไม่ให้ทุกตั๋วมีแถวที่ชนะอย่างน้อยหนึ่งชุด
                            ตัวอย่างเช่นถ้ามีเพียง 2 ขาที่ถูกต้องให้เลือก 6 คะแนนแล้ว '4 จาก 6 / ทั้งหมดที่ถูกต้องยกเว้น 2' Consolation Pool
                            จะเป็นโมฆะ แต่ '5 จาก 6 / ทั้งหมดที่ถูกต้องยกเว้นหนึ่ง' Consolation dividend จะถูกประกาศ
                            <br/> 6.1.4.13
                            <br /> หากสถานที่ตามกำหนดการสำหรับขามีการเปลี่ยนแปลงหลังจากที่ Colossus Bills ได้รับการวางบิลแล้วเลกจะเป็นโมฆะหากสถานที่ใหม่เป็นสนามแรกของทีมเยือนเดิม
                            สำหรับแมทช์ที่เล่นที่การเดิมพันในสถานที่ที่เป็นกลางจะมีขึ้นโดยไม่คำนึงว่าทีมใดจะเป็นทีมในบ้าน
                            <br /> 6.1.4.14
                            <br /> Colossus Bets ไม่รับผิดชอบต่อการพิมพ์ผิดพลาดในการส่งและ / หรือการประเมินผล รวมทั้ง (แต่ไม่ จำกัด เพียง) นาฬิกาใด
                            ๆ ที่นับจากจุดเริ่มต้นของการเดินต่อไปของการเล่นในพูลผลคะแนนสดและผลการแข่งขัน
                            <br /> 6.2
                            <br /> การจัดสระน้ำและการหักเงินที่เกี่ยวข้อง
                            <br /> 6.2.1
                            <br /> เดิมพันทั้งหมดเป็นเดิมพันในสระว่ายน้ำซึ่งเงินรางวัลจะถูกกำหนดโดยการอ้างถึงเงินเดิมพันและจำนวนรายการที่ถูกต้องในพูล
                            <br /> 6.2.2
                            <br /> เดิมพันที่ทำนายได้อย่างถูกต้องคะแนนและ / หรือผลลัพธ์ของจำนวนขาที่ต้องการจะชนะส่วนแบ่งของ Win Pool และที่ Consolation
                            Pools และ Pool Bonus ที่เกี่ยวข้อง
                            <br /> 6.2.2.1 "วินพูล" - ผู้เล่นที่เลือกผลการแข่งขันที่ถูกต้อง (เป็นคะแนนที่ถูกต้องในการทำสกอร์การทำสกอร์ที่ถูกต้องในแต้มริมสระว่ายน้ำและผลการแข่งขันที่บ้าน
                            / เสมอ / ไปในกลุ่ม 1x2) ของขาทั้งหมดของพูลจะ ชนะส่วนแบ่งของ Win Pool
                            <br /> "Consolation Pools" - ในบางกลุ่มผู้เล่นที่เลือกผลการแข่งขันที่ถูกต้องทั้งหมดยกเว้นหนึ่งสองหรือสามผลการแข่งขันจะต้องใช้
                            Pool Consolation Pool ร่วมกัน
                            <br /> "โบนัสพูล" - ผู้ชนะของวินพูล (หากไม่ได้รับเงินสดเต็มจำนวนแล้วดูกฎกติกาที่ 'cash-out' ด้านล่าง) จะได้รับฟรีที่คะแนนจากการจับคู่เพิ่มเติมที่
                            Colossus Bets เลือก และผู้ที่เลือกคะแนนที่ถูกต้องในการแข่งขันที่เพิ่มขึ้นดังกล่าวจะต้องร่วมโบนัสพูล
                            <br /> 6.2.3
                            <br /> กลุ่ม Win and Bonus จะเติบโตและโรลโอเวอร์ขึ้นอยู่กับว่าพวกเขาจะได้รับรางวัลหรือไม่ การหมุนเวียนจากสระว่ายน้ำรับรองจะถูกนำไปใช้กับ
                            Win Pool ที่สอดคล้องกันต่อไป Colossus Bets จะพยายามนำโรลโอเวอร์ทั้งหมดไปใช้กับสระที่เทียบเท่ากันต่อไป (ตัวอย่างเช่นการวางเดิมพันแบบพูลเล่ต์พูลลีกอังกฤษพรีเมียร์ลีก
                            6 จะถูกนำไปใช้กับพูลอังกฤษพรีเมียร์ลีก 6 สัปดาห์ต่อไป) แต่การเดิมพันแบบโรลโอเวอร์จะใช้โดย Colossus Bets ทำตามดุลยพินิจของตน
                            แต่เพียงผู้เดียว
                            <br />
                            <br /> 6.2.4
                            <br /> เงินเดิมพันของผู้เล่นจะถูกจัดสรรให้กับแต่ละกลุ่มตาม:
                            <br /> 6.2.4.1 การเดิมพันที่เลือก 7 และเลือก 6 คะแนนที่ถูกต้องและคะแนนที่ถูกต้องเกมแนวจะได้รับการจัดสรรดังนี้
                            <br /> * 60% ของเงินเดิมพันจะถูกจัดสรรให้กับ Win Pool
                            <br /> * 10% ของเงินเดิมพันจะถูกจัดสรรให้กับ Consolation Pool สำหรับการเลือกทั้งหมดที่ถูกต้อง
                            <br /> * 15% ของเงินเดิมพันจะถูกจัดสรรให้กับ Consolation Pool สำหรับการเลือกทั้งหมดที่ถูกต้อง
                            <br />
                            <br /> * 15% ของเงินเดิมพันจะถูกจัดสรรให้กับ Pool Bonus
                            <br />
                            <br /> 6.2.4.2 การเดิมพันในเกม 1x2 Pick 15 จะได้รับการจัดสรรดังนี้
                            <br /> * 40% ของเงินเดิมพันจะถูกจัดสรรให้กับ Win Pool
                            <br /> * 10% ของเงินเดิมพันจะถูกจัดสรรให้กับ Consolation Pool สำหรับการเลือกทั้งหมดที่ถูกต้อง
                            <br /> * 15% ของเงินเดิมพันจะถูกจัดสรรให้กับ Consolation Pool สำหรับการเลือกทั้งหมดที่ถูกต้อง
                            <br />
                            <br /> * 20% ของเงินเดิมพันจะถูกจัดสรรให้กับ Consolation Pool สำหรับสามตัวเลือกที่ถูกต้อง
                            <br /> * 15% ของเงินเดิมพันจะถูกจัดสรรให้กับ Pool Bonus
                            <br /> 6.2.4.3 หากเกมมีการตัดสินน้อยกว่าจำนวนขาที่มีการโฆษณาจำนวนโบนัสจะไม่ถูกนำมาใช้และเงินเดิมพันที่จัดสรรให้กับพูลโบนัสจะถูกจัดสรรให้แก่
                            Win Pool เพื่อให้ การจัดสรร Win Pool สำหรับเกมคะแนน Pick 6 ที่ถูกต้องจะเท่ากับ 75% ของเงินเดิมพันทั้งหมด ไม่รวมเงินเดิมพันที่นำมาในการหมุนเวียนจากเดิมพันโบนัสพูลแบบสัปดาห์ก่อนซึ่งจะเลื่อนกลับไปที่
                            Bonus Pool ตามที่กำหนดโดย Colossus Bets ถ้าสระการปลอบโยนจะถือเป็นโมฆะตามที่อธิบายไว้ในข้อ 1.24 ข้างต้นการจัดสรรจากเงินเดิมพันสำหรับ
                            Consolation Pool จะถูกนำไปใช้กับ Win Pool
                            <br />
                            <br /> 6.2.4.4 สำหรับเกมอื่น ๆ ทั้งหมดให้จัดสรร 100% ของ Win Pool และไม่มีสระอื่น ๆ ให้พร้อมใช้งาน
                            <br />
                            <br /> 6.2.5
                            <br /> เว้นแต่ระบุไว้เป็นอย่างอื่นสระแต่ละแห่งจะถูกหัก 30% จำนวนเงินสุทธิในแต่ละกลุ่มคือ 70% ของเงินเดิมพันและการจัดสรรเงินเดิมพันไปยังกลุ่มที่แตกต่างกันที่อ้างถึงข้างต้นคือก่อนการหักเงินนี้
                            <br /> 6.2.6
                            <br /> แต่ละสายที่ชนะในตั๋วมีสิทธิ์ได้รับรางวัลเดียวกับกองทุนรางวัลสูงสุดที่เกี่ยวข้องกับสายการบินเท่านั้น ตัวอย่างเช่นเส้นที่มีคะแนนที่ถูกต้องในแต่ละหกขาที่ถูกต้องคะแนน
                            6 สระว่ายน้ำจะชนะส่วนแบ่งของรางวัล Win Pool แต่ไม่มีรางวัลสระว่ายน้ำปลอบโยนที่แนบไปสระว่ายน้ำ Pick 6 ในทำนองเดียวกันบรรทัดในสระว่ายน้ำเดียวกันซึ่งรวมถึงห้าในหกคะแนนที่ถูกต้อง
                            (แต่ไม่ใช่หกในหกที่ถูกต้อง) จะชนะส่วนแบ่งของรางวัล "ทั้งหมดยกเว้นหนึ่งรางวัล" และดังนั้นจะไม่มีสิทธิ์ได้รับรางวัล
                            'ทั้งหมด แต่สอง' รางวัลชมเชยสระว่ายน้ำ
                            <br /> 6.2.7
                            <br /> แม้ว่าจะมีเงื่อนไขตามข้อ 2.6 ข้างต้นผู้เล่นที่มีสิทธิ์ได้รับโบนัสพูลโดยการชนะวินพูล (และยังไม่ได้จ่ายเงินเต็มจำนวน)
                            จะได้รับฟรีในการทำนายคะแนนที่ถูกต้องอีกหนึ่งคะแนนสำหรับการแข่งขันที่ตามมา โดย Colossus Bets ตามดุลยพินิจ ("Bonus
                            Leg") ผู้เล่นทุกคนที่ทำนายได้อย่างถูกต้องตามผลของเลกโบนัสจะต้องร่วม Pool Bonus
                            <br /> 6.2.8
                            <br /> ยูนุกซ์ทั้งหมดจะจ่ายปันผลและทำธุรกรรม cash-out บางส่วนไปจนถึง 1 เพนนีที่ใกล้ที่สุด (หรือสกุลเงินเทียบเท่า) ตัวอย่างเช่นการจ่ายเงินปันผล
                            350.49764 ปอนด์จะถูกปัดเศษเป็น 350.49 ปอนด์และการถอนเงินออกจาก 10% ของข้อเสนอ 25.67 ยูโรสำหรับ 100% ของตั๋วสดจะถูกปัดเศษเป็นจำนวนเงินที่เบิกเงินสด
                            2.56 เหรียญ
                            <br/> 6.3
                            <br /> เข้าสู่สระโบนัส
                            <br /> 6.3.1
                            <br /> หากคุณประสบความสำเร็จใน Win Pool (และยังไม่ได้จ่ายเงินเต็มจำนวน) คุณจะมีสิทธิได้รับโบนัส Pool Bonus ตามที่กำหนดไว้
                            การเลือกขาหนึ่งโบนัสจะได้รับอนุญาตสำหรับไลน์ที่ชนะใน Win Pool ที่ชนะรางวัล
                            <br /> 6.3.2
                            <br /> หากมีสิทธิได้รับ Bonus Pool คุณจะต้องติดต่อทีมบริการลูกค้าของดาฟาเบ็ทรายละเอียดเกี่ยวกับรางวัลชนะเลิศของแจ๊คพ็อตพูลและคุณจะได้รหัสที่ไม่ซ้ำกันซึ่งจำเป็นต้องใช้ในการเลือกโบนัสขาของคุณ
                            คุณต้องดำเนินการตามขั้นตอนการลงทะเบียนนี้ภายใน 72 ชั่วโมงหลังจากสิ้นสุดการจับคู่สุดท้ายของ Jackpot Pool ที่เกี่ยวข้อง
                            Dafabet อาจกำหนดให้คุณต้องผ่านขั้นตอนด้านความปลอดภัยบางอย่างก่อนที่จะยอมรับการลงทะเบียน / การเลือกของคุณ
                            <br /> 6.3.3
                            <br /> โบนัสเลกจะได้รับการระบุและเผยแพร่โดย Colossus Bets อย่างน้อย 24 ชั่วโมงก่อนกำหนดเวลาเริ่มต้น - โดยปกติคือเที่ยงวันศุกร์สำหรับการแข่งขันในช่วงสุดสัปดาห์หรือ
                            24 ชั่วโมงก่อนการแข่งขันฟุตบอลในช่วงกลางสัปดาห์เช่นการแข่งขันในแชมเปี้ยนส์ลีก
                            <br /> 6.3.4
                            <br /> เมื่อการเลือกขาโบนัสของคุณถูกสร้างขึ้นแล้วจะไม่สามารถเปลี่ยนแปลงได้เว้นแต่โบนัสขาแพ้จะเป็นโมฆะตามข้อ 1.17-1.18 ข้างต้น
                            ในกรณีดังกล่าวผู้เล่นจะต้องเข้าร่วมการเลือกสำหรับเหตุการณ์ที่กำหนดขึ้นใหม่หรือเหตุการณ์อื่นที่กำหนดโดย Colossus Bets
                            <br />
                            <br /> 6.3.5
                            <br /> ผู้เล่นที่มีคุณสมบัติใด ๆ ที่ไม่ได้ลงทะเบียนสำหรับขาโบนัสโดยไม่เสียค่าใช้จ่ายใด ๆ ตามเวลาที่กำหนดที่กล่าวถึงข้างต้นหรือผู้ที่ไม่สามารถทำการเลือกได้โดยใช้เวลาตัดเชือกที่โฆษณาไว้
                            (ซึ่งจะเป็นเวลา 3 ชั่วโมงก่อนกำหนดการเตะที่กำหนดเวลาไว้) ในการแข่งขันที่ได้รับเลือกให้เป็นขาโบนัส) จะได้รับการจัดสรร
                            1-1 ในการแข่งขันที่เกี่ยวข้องโดยอัตโนมัติหรือ (ในกลุ่มที่ขึ้นอยู่กับแต้มขอบ) ชนะทีมในบ้านโดยมีอัตราการชนะที่เล็กที่สุดโดยทั่วไป
                            คูปอง Win Pool ที่เกี่ยวข้อง
                            <br /> 6.3.6
                            <br /> ในกรณีที่ Colossus Bets เป็นเจ้าของ (หรือเป็นเจ้าของบางส่วน) ตั๋วที่ได้รับผ่านกลไกการตัดเงินสดที่อธิบายด้านล่างและตั๋วดังกล่าวมี
                            Win Pool ที่ชนะ Line, Colossus Bets จะมีสิทธิ์ในการเข้า Pool Bonus ในกรณีดังกล่าวยักษ์ใหญ่จะเสนอชื่อ (และเผยแพร่)
                            การเลือกขาโบนัส 24 ชั่วโมงก่อนที่จะมีการเริ่มต้นกิจกรรมที่เกี่ยวข้อง ในกรณีที่ Colossus Bets ครอบครองส่วนหนึ่งหรือมากกว่าของ
                            Win Pool มากกว่าหนึ่งรางวัลตามคำอธิบายข้างต้นจะมีสิทธิที่จะทำการเลือก Bonus Leg ในส่วนของตั๋วดังกล่าว
                            <br /> 6.3.7
                            <br /> ในกรณีที่คุณได้รับ Cash Ticket ออกจาก Live Ticket แล้วคุณจะมีสิทธิที่จะทำการเลือก Bonus Leg ได้ตามปกติตามที่ได้อธิบายไว้ข้างต้น
                            แต่การจ่ายโบนัส Pool Pool อาจเป็นไปตามส่วนของตั๋วเดิม เก็บไว้
                            <br /> 6.3.8
                            <br /> ทั้ง Colossus Bets และ Dafabet ยอมรับความรับผิดชอบใด ๆ ในส่วนที่เกี่ยวกับผู้เล่นที่พยายามจะให้ความร่วมมือซึ่งกันและกันเพื่อเพิ่มโอกาสในการได้รับรางวัลใด
                            ๆ หรือทำเงินสะสมใด ๆ ผู้เล่นเข้าสู่การจัดการดังกล่าวทั้งหมดโดยใช้ความเสี่ยงของตนเอง
                            <br /> 6.4
                            <br /> Cash-Out
                            <br /> 6.4.1
                            <br /> Colossus Bets สามารถวางเดิมพันได้ตลอดเวลาในช่วงระยะเวลาของการเล่นเกมผู้เล่นมีโอกาสได้รับเงินทั้งหมดหรือบางส่วนของตั๋วที่อาจยังคงมีเส้นชนะ
                            ("ตั๋วสด")
                            <br /> 6.4.2
                            <br /> ความพร้อมของข้อเสนอพิเศษในการเบิกถอนเงินสดไม่สามารถรับประกันได้และในช่วงเวลาที่มีข้อเสนอพิเศษสำหรับการเบิกถอนเงินสด
                            (หลังจากสรุปขาข้างหนึ่งในสระว่ายน้ำและก่อนที่จะเริ่มขาต่อไปหรือสำหรับกีฬาบางอย่างรวมถึงฟุตบอลในช่วง ระยะเวลาครึ่งหนึ่งของขาใดก็ได้)
                            ข้อเสนอพิเศษสำหรับการเบิกถอนเงินสดอาจไม่สามารถใช้งานได้สำหรับเหตุผลด้านเทคนิคการปฏิบัติงานหรือเหตุผลอื่นใด
                            <br /> กำหนดราคาตั๋วสด
                            <br /> 6.4.3
                            <br /> ในข้อเสนอซื้อตั๋วสด ("ข้อเสนอพิเศษ") Colossus Bets จะเสนอราคาเสนอซื้อเพิ่ม 10% ของตั๋วสดได้สูงสุด 100% ("ราคาเสนอ")
                            <br /> 6.4.4
                            <br /> ราคาเสนอซื้อจะถูกกำหนดโดย Colossus Bets ตามดุลยพินิจของ บริษัท
                            <br />
                            <br /> 6.4.5
                            <br /> กระบวนการเสนอซื้อ
                            <br /> A. ผู้เล่นจะได้รับแจ้งข้อเสนอพิเศษผ่านทางบัญชีของตน
                            <br /> B. หลังจากได้รับข้อเสนอผู้เล่นจะมีระยะเวลาระหว่างการเสนอซื้อโดย Colossus Bets กับการหมดอายุของข้อเสนอเพื่อตัดสินใจว่าจะยอมรับข้อเสนอ
                            (C) หรือปฏิเสธการเสนอซื้อ (D) หรือไม่ Colossus Bets ขอสงวนสิทธิ์ในการแก้ไขหรือยกเลิกข้อเสนอพิเศษที่ยังไม่ได้รับการยอมรับ
                            ข้อเสนอพิเศษทั้งหมดจะหมดอายุในการเล่นสดครั้งต่อไป
                            <br /> C. หากผู้เล่นยอมรับข้อเสนอสำหรับ 100% ของตั๋วสดสิทธิ์ทั้งหมดในตั๋วจะถูกกำหนดให้กับ Colossus Bets และราคาเสนอซื้อจะถูกโอนเข้าบัญชีของผู้เล่นโดยเร็วที่สุดเท่าที่จะเป็นไปได้ในทางที่เป็นไปได้
                            ดูข้อ 4.7 ด้านล่างเกี่ยวกับการขายตั๋วสดส่วนหนึ่ง
                            <br /> D. หากผู้เล่นปฏิเสธข้อเสนอ (หรือจะไม่ดำเนินการใด ๆ ในข้อเสนอ) ผู้เล่นจะยังคงเป็นเจ้าของสิทธิ์การเป็นเจ้าของตั๋วสดและถือครองโอกาสที่จะชนะหรือแบ่งปันเงินรางวัลที่เกี่ยวข้อง
                            4.6 เพื่อหลีกเลี่ยงข้อสงสัยเมื่อ Live Ticket ได้รับการชำระเงินเต็มจำนวนแล้วคุณจะไม่สามารถชนะจำนวนเงินใด ๆ ที่เกี่ยวข้องกับตั๋วดังกล่าวได้อีกต่อไป
                            หากการเดิมพันใด ๆ ในตั๋วนั้นประสบความสำเร็จในท้ายที่สุด Colossus Bets จะได้รับเงินปันผลจาก Win Pool (ร่วมกับสิทธิ
                            Pool Bonus Pool หรือเงินปันผลจาก Consolation Pool) ที่คุณมีสิทธิ์ที่จะขายตั๋วสดได้
                            <br/> 6.4.6
                            <br /> เพื่อหลีกเลี่ยงข้อสงสัยเมื่อ Live Ticket ได้รับการชำระเงินเต็มจำนวนแล้วคุณจะไม่สามารถชนะเงินใด ๆ ในแง่ของตั๋วดังกล่าวได้อีกต่อไป
                            หากการเดิมพันใด ๆ ในตั๋วนั้นประสบความสำเร็จในท้ายที่สุด Colossus Bets จะได้รับเงินปันผลจาก Win Pool (ร่วมกับสิทธิ
                            Pool Bonus Pool หรือเงินปันผลจาก Consolation Pool) ที่คุณจะได้รับสิทธิว่าคุณไม่ได้ขายตั๋ว Live Ticket
                            <br /> 6.4.7
                            <br /> ในกรณีที่คุณได้รับ Cash Ticket ออกจาก Live Ticket แล้วคุณจะมีสิทธิที่จะทำการเลือก Bonus Leg ได้ตามปกติตามที่ได้อธิบายไว้ข้างต้น
                            แต่การจ่ายโบนัส Pool Pool อาจเป็นไปตามส่วนของตั๋วเดิม เก็บไว้
                            <br /> ออกใบเสร็จของตั๋วสด
                            <br /> 6.4.8
                            <br /> ผู้เล่นจะต้องเป็นเจ้าของส่วนที่เหลือของ Live Ticket และหาก Live Ticket ประสบความสำเร็จ Player จะได้รับสิทธิดังกล่าวในจำนวน
                            Win Pool (พร้อมกับเปอร์เซ็นต์ของสิทธิใน Bonus Pool หรือ Consolation Pools ) สำหรับหุ้นที่ถือครองอยู่ใน Live Ticket
                            <br /> ตัวอย่างที่ทำงาน:
                            <br /> ผู้เล่น A จะได้รับส่วนแบ่ง 20% และต่อมาเป็น 30% ของจำนวนทั้งหมดของ Live Ticket Live Ticket คือการคาดการณ์ที่ถูกต้องของคะแนนของขาทั้งหมดในช่วงเวลาของเกมซึ่งพิสูจน์ให้เห็นว่าเป็นเดิมพันชนะสำหรับจุดประสงค์ของวินพูล
                            มีอีกหนึ่งยูนิตเต็ม Win Pool ที่ชนะการเดิมพันในเกม (จัดโดย Player B)
                            <br /> กองทุนที่ชนะสุทธิถือ 1,000,000 ปอนด์และกองทุนโบนัสสุทธิถือ 2,000,000 ปอนด์
                            <br /> สระชนะ: £ 1,000,000 ÷ 2 (เป็น 2 ผู้ชนะ) = เงินปันผล 500,000 ปอนด์
                            <br /> 50% ของ 500,000 ปอนด์ (ผู้เล่น A ที่ถือหุ้นใน Live Ticket) = 250,000 ปอนด์
                            <br /> ส่วนแบ่งของผู้เล่น A Win Win: £ 250,000
                            <br /> โบนัส Pool: 2,000,000 £.
                            <br /> ผู้เล่น A มีสิทธิที่จะทำการเลือก Bonus Leg เพื่อพยายามรับเงินเพิ่มอีก 1,000,000 ปอนด์เป็น 50% ของ Bonus Fund ผู้เล่น
                            A เลือกคะแนนที่ถูกต้องใน Bonus Leg (และ Player B จะเลือกคะแนนไม่ถูกต้อง)
                            <br /> ส่วนแบ่งการเล่นโบนัสของผู้เล่น A: 1,000,000 ปอนด์
                            <br /> ในตัวอย่างข้างต้นหากผู้เล่น B เลือกคะแนน Bonus Leg score ที่ถูกต้อง (และ Colossus Bets เลือกคะแนนที่ไม่ถูกต้อง)
                            จะมีหน่วย Bonus Pool จำนวน 1.5 หน่วย นี่หมายความว่าผู้เล่น A ซึ่งถือหน่วย Bonus Pool 0.5 หน่วย (หนึ่งในสามของหน่วยที่ชนะทั้งหมด)
                            จะได้รับส่วนแบ่งจากกองทุนโบนัส 666,666 เหรียญ (หนึ่งในสามของ Bonus Fund) ถ้า Colossus Bets ยังเลือกคะแนนที่ถูกต้องจะมี
                            2 Legion Bonus Leg Units ดังนั้น Player A (หนึ่งในสี่ของจำนวนผู้ชนะทั้งหมด) จะชนะ 500,000 ปอนด์
                            <br />
                            <br />
                            <br /> 6.4.9
                            <br /> ข้อเสนอที่ได้รับการยอมรับจากผู้เล่น (เต็มรูปแบบหรือบางส่วน) ได้รับจาก Colossus Bets ตามข้อมูลที่ผิดพลาด (ตัวอย่างเช่นตามคะแนนครึ่งเวลาที่
                            0-0 เมื่อคะแนนเป็นจริง 0-2 ) หรืออันเป็นผลมาจากความล้มเหลวทางเทคนิค Colossus Bets ขอสงวนสิทธิ์ในการยกเลิกข้อเสนอดังกล่าวหรือปรับจำนวนเงินที่จ่ายออกไป
                            การชำระเงินค่าปรับดังกล่าวจะขึ้นอยู่กับคะแนน / ผลลัพธ์ที่ถูกต้องในขณะที่มีการทำคำเสนอซื้อที่ผิดพลาดและการแก้ไขมูลค่าตั๋วที่เกี่ยวข้องในเวลานั้น
                            <br /> 6.4.10
                            <br /> ข้อเสนอที่ได้รับการยอมรับจากผู้เล่น (เต็มรูปแบบหรือบางส่วน) ได้รับการดำเนินการโดย Colossus Bets บนพื้นฐานที่ว่าขาที่กำหนดไว้ในพูลจะเสร็จสมบูรณ์
                            (ดังนั้นการรับประกันใด ๆ และการหมุนเวียนจะได้รับการระบุไว้ในข้อเสนอพิเศษดังกล่าว) แต่ขาดังกล่าวทั้งหมดยังไม่สมบูรณ์
                            Colossus Bets ขอสงวนสิทธิ์ในการปรับจำนวนเงินที่เรียกเก็บได้ การชำระเงินด้วยเงินสดที่ปรับเปลี่ยนดังกล่าวจะขึ้นอยู่กับมูลค่าที่แก้ไขแล้ว
                            (โดยให้จำนวนเงินที่สามารถรับได้ในพูลที่ใช้บังคับและโอกาสที่จะได้รับความสำเร็จที่แก้ไข) ของตั๋วที่เกี่ยวข้อง ณ จุดที่เสนอไว้
                            <br /> 6.4.11
                            <br /> Colossus Bets อาจขึ้นอยู่กับดุลพินิจของตนในการเสนอราคาตั๋วแบบสดซึ่งมี Win Pool อยู่แล้วดังนั้นจึงมีสิทธิ์ในการเลือก
                            Bonus Leg ข้อเสนอใด ๆ เพื่อสิทธิในการเลือกช่องโบนัสจะไม่ทำในลักษณะอัตโนมัติตามที่อธิบายไว้ในส่วนที่เรียกเก็บเงินจากข้อกำหนดในการเล่นนี้
                            แต่จะมีการทำ (และสรุป) ในกระบวนการด้วยตนเองตามที่กำหนดโดย ยักษ์ใหญ่เดิมพัน
                        </p>
                    </div>
                </Grid>
            </Grid>
            
        </div>
      );
    }
  }



  
  const mapStateToProps = (state) => {
    const { token } = state.auth;
    return {
        isAuthenticated: (token !== null && token !== undefined),
        error: state.auth.error,
        lang: state.language.lang,
        showAnnouncements: state.general.show_letou_announcements,
    }
}


GeneralRulesTh.propTypes = {
    classes: PropTypes.object.isRequired,
    callback: PropTypes.func,
};

export default withStyles(styles)(injectIntl(withRouter(connect(mapStateToProps, {
    show_letou_announcements
})(GeneralRulesTh))));